Repository: openSUSE/doc-sle-translations
Catalog: */po/adm_sudo.*.po
Languages: cs, pt_br

# _
source: translator-credits
cs: překladatelské kredity alkas alkas@volny.cz, 2016, 2020
pt_br: tradutor-créditos

source: yes
cs: ano
pt_br: sim

source: Many commands and system utilities need to be run as <systemitem class="username">root</systemitem> to modify files and/or perform tasks that only the super user is allowed to. For security reasons and to avoid accidentally running dangerous commands, it is generally advisable not to log in directly as <systemitem class="username">root</systemitem>. Instead, it is recommended to work as a normal, unprivileged user and use the <command>sudo</command> command to run commands with elevated privileges.
cs: Mnoho příkazů a systémových nástrojů musí být spuštěno jako <systemitem class="username">root</systemitem> pro úpravu souborů a/nebo provádění úkolů, které smí provádět pouze superuživatel. Z bezpečnostních důvodů a aby se zabránilo náhodnému spouštění nebezpečných příkazů, je obecně vhodné nepřihlásit se přímo jako <systemitem class="username">root</systemitem>. Místo toho se doporučuje pracovat jako normální, neprivilegovaný uživatel a pomocí příkazu <command>sudo</command> spouštět příkazy se zvýšenými oprávněními.
pt_br: Muitos comandos e utilitários do sistema precisam ser executados como <systemitem class="username"> root </systemitem> para modificar arquivos e/ou executar tarefas às quais somente o superusuário está autorizado. Por motivos de segurança e para evitar a execução acidental de comandos perigosos, geralmente é aconselhável não efetuar login diretamente como root <systemitem class="username"> root </systemitem>. Em vez disso, é recomendável trabalhar como um usuário normal e sem privilégios e usar o comando <command>sudo</command> para executar comandos com privilégios elevados.

source: On <phrase role="productname"><phrase os="osuse">openSUSE Leap</phrase><phrase os="sles">SUSE Linux Enterprise Server</phrase><phrase os="sled">SUSE Linux Enterprise Desktop</phrase></phrase>, <command>sudo</command> is configured by default to work similarly to su. However, <command>sudo</command> offers the possibility to allow users to run commands with privileges of any other user in a highly configurable manner. This can be used to assign roles with specific privileges to certain users and groups. It is for example possible to allow members of the group <systemitem class="groupname">users</systemitem> to run a command with the privileges of <systemitem class="username">wilber</systemitem>. Access to the command can be further restricted by, for example, forbidding to specify any command options. While su always requires the <systemitem class="username">root</systemitem> password for authentication with PAM, <command>sudo</command> can be configured to authenticate with your own credentials. This increases security by not having to share the <systemitem class="username">root</systemitem> password. For example, you can allow members of the group <systemitem class="groupname">users</systemitem> to run a command <command>frobnicate</command> as <systemitem class="username">wilber</systemitem>, with the restriction that no arguments are specified. This can be used to assign roles with specific abilities to certain users and groups.
cs: Na <phrase role="productname"><phrase os="osuse">openSUSE Leap</phrase><phrase os="sles">SUSE Linux Enterprise Server</phrase><phrase os="sled">SUSE Linux Enterprise Desktop</phrase></phrase> je příkaz <command>sudo</command> standardně konfigurován tak, aby účinkoval podobně jako su. Navíc <command>sudo</command> nabízí možnost, aby uživatelé mohli spouštět příkazy s oprávněními jakéhokoli jiného uživatele vysoce konfigurovatelným způsobem. To lze použít k přiřazení rolí se specifickými oprávněními určitým uživatelům a skupinám. Je například možné povolit členům skupiny<systemitem class="groupname">users</systemitem> spustit příkaz s právy <systemitem class="username">wilber</systemitem>. Přístup k příkazu lze dále omezit například zákazem stanovení jakékoli možnosti příkazu.Zatímco příkaz su vždy vyžaduje heslo uživatele <systemitem class="username">root</systemitem> k jeho ověření pomocí PAM, příkaz <command>sudo</command> lze konfigurovat ověření Vaším vlastním přihlášením. To zvyšuje bezpečnost, aniž musíte znát heslo superuživatele <systemitem class="username">root</systemitem>. Můžete například povolit členům skupiny <systemitem class="groupname">users</systemitem> vydat příkaz <command>frobnicate</command> jako uživatel <systemitem class="username">wilber</systemitem>, s tím omezením, že nejsou zadány žádné argumenty. To lze použít k přiřazení rolí se specifickými schopnostmi určitým uživatelům a skupinám.
pt_br: No <phrase role="productname"> <phrase os= "osuse">openSUSE Leap</phrase><phrase os="sles">SUSE Linux Enterprise Server</phrase><phrase os="sled">SUSE Linux Enterprise A área de trabalho</phrase></phrase>, <command>sudo</command> é configurada por padrão para funcionar de maneira semelhante ao su. No entanto, o <command>sudo</command> oferece a possibilidade de permitir que os usuários executem comandos com privilégios de qualquer outro usuário de uma maneira altamente configurável. Isso pode ser usado para atribuir funções com privilégios específicos a determinados usuários e grupos. É possível, por exemplo, permitir que membros do grupo <systemitem class="groupname">usuários</systemitem> executem um comando com os privilégios de <systemitem class="username">wilber</systemitem>. O acesso ao comando pode ser mais restrito, por exemplo, proibindo a especificação de qualquer opção de comando. Enquanto o su sempre exige a senha <systemitem class="nome de usuário"> root </systemitem> para autenticação com o PAM, o <command>sudo</command> pode ser configurado para autenticar com suas próprias credenciais. Isso aumenta a segurança por não ter que compartilhar a senha <systemitem class="username">root</systemitem>. Por exemplo, você pode permitir que os membros do grupo <systemitem class="groupname">usuários</systemitem> executem um comando <command>frobnicate</command> como <systemitem class="username">wilber</systemitem>, com a restrição de que nenhum argumento seja especificado. Isso pode ser usado para atribuir funções com habilidades específicas a determinados usuários e grupos.

source: Basic <command>sudo</command> Usage
cs: Základní použití příkazu <command>sudo</command>
pt_br: Uso básico do <command>sudo</command>

source: <command>sudo</command> is simple to use, yet very powerful.
cs: <command>sudo</command> je snadný k použití, ale velmi výkonný.
pt_br: <command>sudo</command> é simples de usar, mas muito poderoso.

source: Running a Single Command
cs: Spuštění jednoho příkazu
pt_br: Executando um único comando

source: Logged in as normal user, you can run any command as <systemitem class="username">root</systemitem> by adding <command>sudo</command> before it. It will prompt for the root password and, if authenticated successfully, run the command as <systemitem class="username">root</systemitem>:
cs: Když jste přihlášen jako běžný uživatel, můžete vydat jakýkoli příkaz jako <systemitem class="username">root</systemitem>, když tomu příkazu předřadíte <command>sudo</command>. Budete požádán o zadání hesla uživatele root a po úspěšném ověření provedete ten příkaz jako <systemitem class="username">root</systemitem>:
pt_br: Conectado como usuário normal, você pode executar qualquer comando como <systemitem class="username">root</systemitem> adicionando <command>sudo</command> antes dele. Ele solicitará a senha root e, se autenticado com êxito, execute o comando como <systemitem class="username">root</systemitem>:

source: <prompt>tux &gt; </prompt><command>id -un</command><co xml:id="co.sudo.usage.id"/> tux <prompt>tux &gt; </prompt><command>sudo</command> <command>id -un</command> root's password:<co xml:id="co.sudo.usage.pw"/> root <prompt>tux &gt; </prompt><command>id -un</command> tux<co xml:id="co.sudo.usage.after"/> <prompt>tux &gt; </prompt><command>sudo</command> <command>id -un</command> <co xml:id="co.sudo.usage.nopw"/> root
cs: <prompt>tux &gt; </prompt><command>id -un</command><co xml:id="co.sudo.usage.id"/> tux <prompt>tux &gt; </prompt><command>sudo</command> <command>id -un</command> heslo uživatele root:<co xml:id="co.sudo.usage.pw"/> root <prompt>tux &gt; </prompt><command>id -un</command> tux<co xml:id="co.sudo.usage.after"/> <prompt>tux &gt; </prompt><command>sudo</command> <command>id -un</command> <co xml:id="co.sudo.usage.nopw"/> root

source: The <command>id -un</command> command prints the login name of the current user.
cs: Příkaz <command>id -un</command> vypíše přihlašovací jméno aktuálního uživatele.
pt_br: O comando <command>id -un</command> imprime o nome de login do usuário atual.

source: The password is not shown during input, neither as clear text nor as bullets.
cs: Heslo není zobrazeno při zadávání, ani jako prostý text, ani jako odrážky.
pt_br: A senha não é mostrada durante a entrada, nem como texto não criptografado nem como marcadores.

source: Only commands started with <command>sudo</command> are run with elevated privileges. If you run the same command without the <command>sudo</command> prefix, it is run with the privileges of the current user again.
cs: Pouze příkazy spuštěné příkazem <command>sudo</command> jsou spouštěny se zvýšenými oprávněními. Pokud spustíte stejný příkaz bez předpony <command>sudo</command>, bude znovu spuštěn s oprávněními aktuálního uživatele.
pt_br: Somente comandos iniciados com <command>sudo</command> são executados com privilégios elevados. Se você executar o mesmo comando sem o prefixo <command>sudo</command>, ele será executado com os privilégios do usuário atual novamente.

source: For a limited amount of time, you do not need to enter the <systemitem class="username">root</systemitem> password again.
cs: Po určitou omezenou dobu nemusíte znovu zadávat heslo superuživatele <systemitem class="username">root</systemitem>.
pt_br: Por um período limitado de tempo, você não precisa inserir a senha <systemitem class="username">root</systemitem> novamente.

source: I/O Redirection
cs: Přesměrování vstupu a výstupu
pt_br: Redirecionamento E/S

source: I/O redirection does not work as you would probably expect:
cs: Přesměrování vstupu/výstupu (I/O) nefunguje tak, jak byste asi očekávali:
pt_br: O redirecionamento de E/S não funciona como você provavelmente esperaria:

source: <prompt>tux &gt; </prompt><command>sudo</command> echo s &gt; /proc/sysrq-trigger bash: /proc/sysrq-trigger: Permission denied <prompt>tux &gt; </prompt><command>sudo</command> cat &lt; /proc/1/maps bash: /proc/1/maps: Permission denied
cs: <prompt>tux &gt; </prompt><command>sudo</command> echo s &gt; /proc/sysrq-trigger bash: /proc/sysrq-trigger: Oprávnění odepřeno <prompt>tux &gt; </prompt><command>sudo</command> cat &lt; /proc/1/maps bash: /proc/1/maps: Oprávnění odepřeno

source: Only the <command>echo</command>/<command>cat</command> binary is run with elevated privileges, while the redirection is performed by the user's shell with user privileges. You can either start a shell like in <xref linkend="sec.sudo.shell"/> or use the <command>dd</command> utility instead:
cs: Se zvýšeným oprávněním běží pouze <command>echo</command>/<command>cat</command>, zatímco přesměrování provede uživatelský shell s právy uživatele. Můžete buď spustit shell jako v <xref linkend="sec.sudo.shell"/> nebo použít program <command>dd</command>:
pt_br: Somente o binário <command>echo</command>/<command>cat</command> é executado com privilégios elevados, enquanto o redirecionamento é realizado pelo shell do usuário com privilégios de usuário. Você pode iniciar um shell como em <xref linkend="sec.sudo.shell"/> ou usar o utilitário <command>dd</command>:

source: Starting a Shell
cs: Spuštění shellu
pt_br: Iniciando um Shell

source: Having to add <command>sudo</command> before every command can be cumbersome. While you could specify a shell as a command <command>sudo bash</command>, it is recommended to rather use one of the built-in mechanisms to start a shell:
cs: Může být obtížné přidat před každým příkazem <command>sudo</command>. Přestože byste mohli spustit shell jako příkaz <command>sudo bash</command>, pro spuštění shellu doporučujeme raději použít jeden z vestavěných mechanismů:
pt_br: Ter que adicionar <command>sudo</command> antes que cada comando pode ser complicado. Embora você possa especificar um shell como um comando <command>sudo bash</command>, é recomendável usar um dos mecanismos internos para iniciar um shell:

source: Starts a shell specified by the <envar>SHELL</envar> environment variable or the target user's default shell. If a command is given, it is passed to the shell (with the <option>-c</option> option), else the shell is run in interactive mode.
cs: Spustí shell určený proměnnou prostředí <envar>SHELL</envar> nebo výchozím prostředím cílového uživatele. Je-li zadán příkaz, je předán do shellu (s volbou <option>-c</option>), jinak je shell spuštěn v interaktivním režimu.
pt_br: Inicia um shell especificado pela variável de ambiente <envar>SHELL</envar> ou pelo shell padrão do usuário de destino. Se um comando é dado, ele é passado para o shell (com a opção <option>-c</option>), caso contrário, o shell é executado no modo interativo.

source: <prompt>tux:~ &gt; </prompt>sudo -i root's password: <prompt>root:/home/tux # </prompt>exit <prompt>tux:~ &gt; </prompt>
cs: <prompt>tux:~ &gt; </prompt>sudo -i heslo uživatele root: <prompt>root:/home/tux # </prompt>exit <prompt>tux:~ &gt; </prompt>

source: Like <option>-s</option>, but starts the shell as login shell. This means that the shell's start-up files (<filename>.profile</filename> etc.) are processed and the current working directory is set to the target user's home directory.
cs: Jako <option>-s</option>, ale spustí shell jako přihlašovací shell. To znamená, že jsou zpracovány startovací soubory shellu (<filename>.profile</filename> atd.) a aktuální pracovní adresář je nastaven do domovského adresáře cílového uživatele.
pt_br: Como <option>-s</option>, mas inicia o shell como shell de login. Isso significa que os arquivos de inicialização do shell (<filename>.profile</filename> etc.) são processados e o diretório de trabalho atual é definido como o diretório inicial do usuário de destino.

source: <prompt>tux:~ &gt; </prompt>sudo -i root's password: <prompt>root:~ # </prompt>exit <prompt>tux:~ &gt; </prompt>
cs: <prompt>tux:~ &gt; </prompt>sudo -i heslo uživatele root: <prompt>root:~ # </prompt>exit <prompt>tux:~ &gt; </prompt>

source: Environment Variables
cs: Proměnné prostředí
pt_br: Variáveis Do Ambiente

source: By default, <command>sudo</command> does not propagate environment variables:
cs: Standardně <command>sudo</command> nepřevezme proměnné prostředí:
pt_br: Por padrão, <command>sudo</command> não propaga variáveis de ambiente:

source: <prompt>tux &gt; </prompt>ENVVAR=test env | grep ENVVAR ENVVAR=test <prompt>tux &gt; </prompt>ENVVAR=test sudo env | grep ENVVAR root's password: <co xml:id="co.sudo.env.novar"/> <prompt>tux &gt; </prompt>
cs: <prompt>tux &gt; </prompt>ENVVAR=test env | grep ENVVAR ENVVAR=test <prompt>tux &gt; </prompt>ENVVAR=test sudo env | grep ENVVAR heslo uživatele root: <co xml:id="co.sudo.env.novar"/> <prompt>tux &gt; </prompt>

source: The empty output shows that the environment variable <envar>ENVVAR</envar> did not exist in the context of the command run with <command>sudo</command>.
cs: Prázdný výstup ukazuje, že proměnná prostředí <envar>ENVVAR</envar> v kontextu příkazu spuštěného pomocí <command>sudo</command> neexistovala.
pt_br: A saída vazia mostra que a variável de ambiente <envar>ENVVAR</envar> não existia no contexto do comando executado com <command>sudo</command>.

source: This behavior can be changed by the <literal>env_reset</literal> option, see <xref linkend="tab.adm.sudo.options"/>.
cs: Toto chování lze změnit volbou <literal>env_reset</literal>, viz <xref linkend="tab.adm.sudo.options"/>.
pt_br: Esse comportamento pode ser alterado pela opção <literal>env_reset</literal>, consulte <xref linkend="tab.adm.sudo.options"/>.

source: Configuring <command>sudo</command>
cs: Konfigurace <command>sudo</command>
pt_br: Configurando <command>sudo</command>

source: <command>sudo</command> is a very flexible tool with extensive configuration.
cs: <command>sudo</command> je velmi flexibilní nástroj s rozsáhlou konfigurací.
pt_br: O <command>sudo</command> é uma ferramenta muito flexível com uma configuração extensa.

source: Locked yourself out of sudo
cs: Zamkli jste se mimo sudo
pt_br: Trancou-se fora do sudo

source: If you accidentally locked yourself out of <command>sudo</command>, use <command>su -</command> and the <systemitem class="username">root</systemitem> password to get a root shell. To fix the error, run <command>visudo</command>.
cs: Pokud jste se omylem zamkli mimo <command>sudo</command>, použijte <command>su -</command> a heslo uživatele <systemitem class="username">root</systemitem>, abyste se dostali do shellu uživatele root. Chybu opravte spuštěním <command>visudo</command>.
pt_br: Se você acidentalmente se trancou fora do <command>sudo</command>, use <command>su -</command> e a senha <systemitem class="username">root</systemitem> para obter um shell root. Para corrigir o erro, execute <command>visudo</command>.

source: Editing the Configuration Files
cs: Úpravy konfiguračních souborů
pt_br: Editando os arquivos de configuração

source: The main policy configuration file for <command>sudo</command> is <filename>/etc/sudoers</filename>. As it is possible to lock yourself out of the system because of errors in this file, it is strongly recommended to use <command>visudo</command> for editing. It will prevent simultaneous changes to the opened file and check for syntax errors before saving the modifications.
cs: Hlavní konfigurační soubor zásad pro <command>sudo</command> je <filename>/etc/sudoers</filename>. Vzhledem k tomu, že je možné se v systému kvůli chybám v tomto souboru zamknout, důrazně doporučujeme pro úpravy použít <command>visudo</command>. Zabráníte současným změnám v otevřeném souboru a před uložením úprav příkaz zkontroluje, zda nedošlo k syntaktickým chybám.
pt_br: O principal arquivo de configuração de política para <command>sudo</command> é <filename>/etc/sudoers</filename>. Como é possível se bloquear do sistema devido a erros neste arquivo, é altamente recomendável usar <command>visudo</command> para editar. Ele evitará alterações simultâneas no arquivo aberto e verificará erros de sintaxe antes de salvar as modificações.

source: Despite its name, you can also use editors other than vi by setting the <envar>EDITOR</envar> environment variable, for example:
cs: Můžete použít i jiné editory než vi nastavením proměnné prostředí <envar>EDITOR</envar>, například:
pt_br: Apesar do nome, você também pode usar editores que não sejam o vi configurando a variável de ambiente <envar>EDITOR</envar>, por exemplo:

source: However, the <filename>/etc/sudoers</filename> file itself is supplied by the system packages and modifications may break on updates. Therefore, it is recommended to put custom configuration into files in the <filename>/etc/sudoers.d/</filename> directory. Any file in there is automatically included. To create or edit a file in that subdirectory, run:
cs: Samotný soubor <filename>/etc/sudoers</filename> je však dodáván systémovými balíčky a změny se mohou při aktualizacích poškodit. Doporučujeme proto do souborů v adresáři <filename>/etc/sudoers.d/</filename> vložit vlastní konfiguraci. Každý tam existující soubor je automaticky vložen. Chcete-li vytvořit nebo upravit soubor v tomto podadresáři, spusťte:
pt_br: No entanto, o próprio arquivo <filename>/etc/sudoers</filename> é fornecido pelos pacotes do sistema e as modificações podem ocorrer nas atualizações. Portanto, é recomendável colocar a configuração personalizada em arquivos no diretório <filename>/etc/sudoers.d/</filename>. Qualquer arquivo é incluído automaticamente. Para criar ou editar um arquivo nesse subdiretório, execute:

source: sudo visudo -f /etc/sudoers.d/<replaceable>NAME</replaceable>
cs: sudo visudo -f /etc/sudoers.d/<replaceable>NÁZEV</replaceable>
pt_br: sudo visudo -f /etc/sudoers.d/<replaceable>NOME</replaceable>

source: Alternatively with a different editor (for example <command>nano</command>):
cs: Alternativně s jiným editorem (například <command>nano</command>):
pt_br: Como alternativa com um editor diferente (por exemplo, <command>nano</command>):

source: sudo EDITOR=<replaceable>/usr/bin/nano</replaceable> visudo -f /etc/sudoers.d/<replaceable>NAME</replaceable>
cs: sudo EDITOR=<replaceable>/usr/bin/nano</replaceable> visudo -f /etc/sudoers.d/<replaceable>NÁZEV</replaceable>
pt_br: sudo EDITOR=<replaceable>/usr/bin/nano</replaceable> visudo -f /etc/sudoers.d/<replaceable>NOME</replaceable>

source: Ignored Files in <filename>/etc/sudoers.d</filename>
cs: Ignorované soubory v <filename>/etc/sudoers.d</filename>
pt_br: Arquivos ignorados em <filename>/etc/sudoers.d</filename>

source: The <literal>#includedir</literal> command in <filename>/etc/sudoers</filename>, used for <filename>/etc/sudoers.d</filename>, ignores files that end in <literal>~</literal> (tilde) or contain a <literal>.</literal> (dot).
cs: Příkaz <literal>#includedir</literal> v <filename>/etc/sudoers</filename>, použitý pro <filename>/etc/sudoers.d</filename>, ignoruje soubory názvů končících na <literal>~</literal> (tilda) nebo obsahující <literal>.</literal> (tečku).
pt_br: O comando <literal>#includedir</literal> em <filename>/etc/sudoers</filename>, usado para <filename>/etc/sudoers.d</filename>, ignora os arquivos que terminam em <literal>~</literal> (til) ou contém um <literal>.</literal> (ponto).

source: For more information on the <command>visudo</command> command, run <command>man 8 visudo</command>.
cs: Další informace o příkazu <command>visudo</command> získáte spuštěním <command>man 8 visudo</command>.
pt_br: Para obter mais informações sobre o comando <command>visudo</command>, execute <command>man 8 visudo</command>.

source: Basic sudoers Configuration Syntax
cs: Základní syntaxe konfigurace sudoers
pt_br: Sintaxe de configuração básico do arquivo sudoers

source: In the sudoers configuration files, there are two types of options: strings and flags. While strings can contain any value, flags can be turned either ON or OFF. The most important syntax constructs for sudoers configuration files are:
cs: V konfiguračních souborech sudoers existují dva typy voleb: řetězce a příznaky. Zatímco řetězce mohou obsahovat jakoukoli hodnotu, příznaky lze jen zapnout nebo vypnout. Nejdůležitější konstrukty syntaxe pro konfigurační soubory sudoers jsou:
pt_br: Nos arquivos de configuração do sudoers, existem dois tipos de opções: strings e sinalizadores. Embora as strings possam conter qualquer valor, os sinalizadores podem ser ativados ou desativados. As construções de sintaxe mais importantes para os arquivos de configuração de sudoers são:
