Repository: openSUSE/doc-sle-translations
Catalog: */po/adm_wbem.*.po
Languages: pt_br

source: Specifies the name of the file that contains either the CA or self-signed certificates of the clients. This file must be in PEM format and is only required if <literal>sslClientCertificate</literal> is set to <literal>accept</literal> or <literal>require</literal>. Default is <filename>/etc/sfcb/client.pem</filename>.
pt_br: Especifica o nome do arquivo que contém a CA ou os certificados autoassinados dos clientes. Esse arquivo deve estar no formato PEM e será necessário apenas se <literal>sslClientCertificate</literal> estiver definido como <literal>accept</literal> ou <literal>exigir</literal>. O padrão é <filename>/etc/sfcb/client.pem</filename>.

source: <literal>sslClientTrustStore:</literal> <replaceable>PATH</replaceable>
pt_br: <literal>sslClientTrustStore:</literal> <replaceable>CAMINHO</replaceable>

source: Specifies the way SFCB handles client certificate based authentication. If set to <literal>ignore</literal>, it will not request a certificate from the client. If set to <literal>accept</literal> it will request a certificate from the client but will not fail if the client does not present one. If set to <literal>require</literal>, it will refuse the client connection if the client does not present a certificate. Default value is <literal>ignore</literal>.
pt_br: Especifica a maneira como o SFCB lida com a autenticação baseada em certificado de cliente. Se definido como <literal>ignore</literal>, ele não solicitará um certificado ao cliente. Se definido como <literal>accept</literal>, solicitará um certificado ao cliente, mas não falhará se o cliente não apresentar um. Se definido como <literal>require</literal>, recusará a conexão do cliente se o cliente não apresentar um certificado. O valor padrão é <literal>ignore</literal>.

source: <literal>sslClientCertificate:</literal> <replaceable>OPTION</replaceable>
pt_br: <literal>sslClientCertificate:</literal> <replaceable>OPÇÃO</replaceable>

source: Disables requesting a client certificate.
pt_br: Desativa a solicitação de um certificado de cliente.

source: Will not fail if no certificate is present.
pt_br: Não falhará se nenhum certificado estiver presente.

source: Refuses the client connection without a valid certificate.
pt_br: Recusa a conexão do cliente sem um certificado válido.

source: Specifies the name of the local library to request for the user authentication based on client certificate. This is only requested if <literal>sslClientCertificate</literal> is not set to <literal>ignore</literal>. Default value is <filename>sfcCertificateAuthentication</filename>.
pt_br: Especifica o nome da biblioteca local a ser solicitada para autenticação do usuário com base no certificado do cliente. Isso é solicitado apenas se <literal>sslClientCertificate</literal> não estiver definido como <literal>ignore</literal>. O valor padrão é <filename>sfcCertificateAuthentication</filename>.

source: <literal>certificateAuthLib:</literal> <replaceable>FILE</replaceable>
pt_br: <literal>certificateAuthLib:</literal> <replaceable>ARQUIVO</replaceable>

source: Specifies the trace level for SFCB. You can override it by setting environment variable <literal>SFCB_TRACE_LEVEL</literal>. Default value is <literal>0</literal>.
pt_br: Especifica o nível de rastreio para SFCB. Você pode substituí-lo definindo a variável de ambiente <literal>SFCB_TRACE_LEVEL</literal>. O valor padrão é <literal>0</literal>.

source: <literal>traceLevel:</literal> <replaceable>NUM_LEVEL</replaceable>
pt_br: <literal>traceLevel:</literal> <replaceable>NUM_NÍVEL</replaceable>

source: Specifies the trace mask for SFCB. you can override it by the command line option <option>--trace-components</option>. Default value is <literal>0</literal>.
pt_br: Especifica a máscara de rastreamento para SFCB. você pode substituí-lo pela opção de linha de comando <option>--trace-components</option>. O valor padrão é <literal>0</literal>.

source: <literal>traceMask:</literal> <replaceable>MASK</replaceable>
pt_br: <literal>traceMask:</literal> <replaceable>MÁSCARA</replaceable>

source: Specifies the trace file for SFCB. You can override it by setting environment variable <literal>SFCB_TRACE_FILE</literal>. Default value is <literal>stderr</literal> (standard error output).
pt_br: Especifica o arquivo de rastreamento para SFCB. Você pode substituí-lo definindo a variável de ambiente <literal>SFCB_TRACE_FILE</literal>. O valor padrão é <literal>stderr</literal> (saída de erro padrão).

source: <literal>traceFile:</literal> <replaceable>OUTPUT</replaceable>
pt_br: <literal>traceFile:</literal> <replaceable>SAÍDA</replaceable>

source: Advanced SFCB Tasks
pt_br: Tarefas avançadas do SFCB

source: This chapter covers more advanced topics related to SFCB usage. To understand them, you need to have basic knowledge of the Linux file system and experience with the Linux command line. This chapter includes the following tasks:
pt_br: Este capítulo aborda tópicos mais avançados relacionados ao uso do SFCB. Para entendê-los, você precisa ter conhecimento básico do sistema de arquivos Linux e experiência com a linha de comandos do Linux. Este capítulo inclui as seguintes tarefas:

source: Installing CMPI providers
pt_br: Instalando Provedores CMPI

source: Testing SFCB
pt_br: Testando SFCB

source: Using <command>wbemcli</command> CIM client
pt_br: Usando o cliente CIM <command>wbemcli</command>

source: Installing CMPI Providers
pt_br: Instalando provedores CMPI

source: To install a CMPI provider, you need to make sure that its shared library is copied into one of the directories specified by <literal>providerDirs</literal> configuration option, see <xref linkend="sec.wbem.config.confile.16"/>. The provider must also be properly registered using <command>sfcbstage</command> and <command>sfcbrepos</command> commands.
pt_br: Para instalar um provedor CMPI, é necessário garantir que sua biblioteca compartilhada seja copiada em um dos diretórios especificados pela opção de configuração <literal>providerDirs</literal>, consulte <xref linkend="sec.wbem.config.confile.16 "/>. O provedor também deve ser registrado corretamente usando os comandos <command>sfcbstage</command> e <command>sfcbrepos</command>.

source: The provider package is usually prepared for SFCB, so that its installation takes care of the proper registration. Most SBLIM providers are prepared for SFCB.
pt_br: O pacote do provedor geralmente é preparado para o SFCB, para que sua instalação cuide do registro adequado. A maioria dos provedores de SBLIM está preparada para o SFCB.

source: Class Repository
pt_br: Repositório de Classes

source: <emphasis>Class repository</emphasis> is a place where SFCB stores information about CIM classes. It usually consists of a directory tree with namespace components. Typical CIM namespaces are <literal>root/cimv2</literal> or <literal>root/interop</literal>, which respectively translate to the class repository directory path on the file system
pt_br: <emphasis>Repositório de classes</emphasis> é um local em que o SFCB armazena informações sobre classes CIM. Geralmente consiste em uma árvore de diretórios com componentes de namespace. Os namespaces CIM típicos são <literal>root/cimv2</literal> ou <literal>root/interop</literal>, que são convertidos respectivamente no caminho do diretório do repositório de classes no sistema de arquivos

source: and
pt_br: e

source: Each namespace directory contains the file <filename>classSchemas</filename>. The file has a compiled binary representation of all the CIM classes registered under that namespace. It also contains necessary information about their CIM superclasses.
pt_br: Cada diretório de namespace contém o arquivo <filename>classSchemas</filename>. O arquivo possui uma representação binária compilada de todas as classes CIM registradas nesse espaço de nome. Ele também contém informações necessárias sobre suas superclasses CIM.

source: In addition, each namespace directory may contain a file <filename>qualifiers</filename> which contains all qualifiers for the namespace. When sfcbd restarts, the class provider will scan the directory <filename>/var/lib/sfcb/registration/repository/</filename> and all its subdirectories to determine the registered namespaces. Then <filename>classSchemas</filename> files are decoded and the class hierarchy for each namespace is built.
pt_br: Além disso, cada diretório de namespace pode conter um arquivo <filename>qualifiers</filename> que contém todos os qualificadores para o namespace. Quando o sfcbd for reiniciado, o provedor de classes examinará o diretório <filename>/var/lib/sfcb/registration/repository/</filename> e todos os seus subdiretórios para determinar os namespaces registrados. Os arquivos <filename>classSchemas</filename> são decodificados e a hierarquia de classes para cada namespace é criada.

source: Adding New Classes
pt_br: Adicionando novas classes

source: SFCB cannot make live CIM class manipulations. You need to add, change or remove classes offline and restart SFCB service with <command>systemctl restart sfcb</command> to register the changes.
pt_br: O SFCB não pode fazer manipulações de classe CIM ao vivo. Você precisa adicionar, alterar ou remover classes offline e reiniciar o serviço SFCB com <command>systemctl restart sfcb</command> para registrar as alterações.

source: To store providers class and registration information, SFCB uses a place called <emphasis>staging area</emphasis>. On SUSE® Linux Enterprise Server systems, it is the directory structure under <filename>/var/lib/sfcb/stage/</filename>.
pt_br: Para armazenar informações de classe e registro de provedores, o SFCB usa um local chamado <emphasis>staging area</emphasis>. Nos sistemas SUSE® Linux Enterprise Server, é a estrutura de diretórios em <filename>/var/lib/sfcb/stage/</filename>.

source: To add a new provider, you need to:
pt_br: Para adicionar um novo provedor, você precisa:

source: Copy the provider class definition files to the <filename>./mofs</filename> subdirectory of staging area directory (<filename>/var/lib/sfcb/stage/mofs</filename>).
pt_br: Copie os arquivos de definição da classe de provedor no subdiretório <filename>./mofs</filename> do diretório da área de temporariedade (<filename>/var/lib/sfcb/stage/mofs</filename>).

source: Copy a registration file which contains the name of the class or classes and type of provider, and the name of the executable library file into the <filename>./regs</filename> subdirectory.
pt_br: Copie um arquivo de registro que contenha o nome da classe ou classes e o tipo de provedor e o nome do arquivo da biblioteca executável no subdiretório <filename>./regs </filename>.

source: There are two default <quote>mof</quote> (class definition) files in the staging directory: <filename>indication.mof</filename> and <filename>interop.mof</filename>. MOF files under the root stage directory <filename>/var/lib/sfcb/stage/mofs</filename> will be copied into each namespace after running <filename>sfcbrepos</filename> command. The <filename>interop.mof</filename> will only be compiled into the <emphasis>interop</emphasis> namespace.
pt_br: Existem dois arquivos padrão <quote>mof</quote> (definição de classe) no diretório temporário: <filename>indicação.mof </filename> e <filename> interop.mof </ filename>. Os arquivos MOF no diretório do estágio raiz <filename>/var/lib/sfcb/stage/mofs</filename> serão copiados em cada espaço de nome após a execução do comando <filename>sfcbrepos</filename>. O <filename>interop.mof</filename> será compilado apenas no espaço de nome <emphasis>interop</emphasis>.

source: The directory layout may look like the following example:
pt_br: O layout do diretório pode parecer com o seguinte exemplo:

source: <prompt>tux &gt; </prompt>cat /var/lib/sfcb/stage/regs/Linux_DHCPRegisteredProfile.reg [Linux_DHCPRegisteredProfile] provider: Linux_DHCPRegisteredProfileProvider location: cmpiLinux_DHCPRegisteredProfile type: instance namespace: root/interop # [Linux_DHCPElementConformsToProfile] provider: Linux_DHCPElementConformsToProfileProvider location: cmpiLinux_DHCPElementConformsToProfile type: instance association namespace: root/cimv2 # [Linux_DHCPElementConformsToProfile] provider: Linux_DHCPElementConformsToProfileProvider location: cmpiLinux_DHCPElementConformsToProfile type: instance association namespace: root/interop
pt_br: <prompt>tux &gt; </prompt>cat /var/lib/sfcb/stage/regs/Linux_DHCPRegisteredProfile.reg [Linux_DHCPRegisteredProfile] provedor: Linux_DHCPRegisteredProfileProvider localização: cmpiLinux_DHCPRegisteredProfile tipo: instance namespace: root/interop # [Linux_DHCPElementConformsToProfile] provedor: Linux_DHCPElementConformsToProfileProvider localização: cmpiLinux_DHCPElementConformsToProfile tipo: instance association namespace: root/cimv2 # [Linux_DHCPElementConformsToProfile] provedor: Linux_DHCPElementConformsToProfileProvider localização: cmpiLinux_DHCPElementConformsToProfile tipo: instance association namespace: root/interop

source: SFCB uses a custom provider registration file for each provider.
pt_br: O SFCB usa um arquivo de registro de provedor personalizado para cada provedor.

source: SBLIM Providers Registration Files
pt_br: Arquivos de registro de provedores SBLIM

source: All SBLIM providers on the SBLIM Web site already include a registration file that is used to generate the .reg file for SFCB.
pt_br: Todos os provedores SBLIM no site da SBLIM já incluem um arquivo de registro usado para gerar o arquivo .reg para SFCB.

source: The format of SFCB registration file is:
pt_br: O formato do arquivo de registro SFCB é:

source: [&lt;class-name&gt;] provider: &lt;provide-name&gt; location: &lt;library-name&gt; type: [instance] [association] [method] [indication] group: &lt;group-name&gt; unload: never namespace: &lt;namespace-for-class&gt; ...
pt_br: [&lt;class-name&gt;] provedor: &lt;provide-name&gt; localização: &lt;library-name&gt; tipo: [instance] [association] [method] [indication] grupo: &lt;group-name&gt; não carregado: never namespace: &lt;namespace-for-class&gt; ...

source: where:
pt_br: onde:

source: The CIM class name (required)
pt_br: O nome da classe CIM (obrigatório)

source: The CMPI provider name (required)
pt_br: O nome do provedor CMPI (obrigatório)

source: The name of the provider library (required)
pt_br: O nome da biblioteca do provedor (obrigatório)

source: The type of the provider (required). This can be any combination of: <literal>instance</literal>, <literal>association</literal>, <literal>method</literal> or <literal>indication</literal>.
pt_br: O tipo do provedor (obrigatório). Pode ser qualquer combinação de: <literal>instance</literal>, <literal>association</literal>, <literal>method</literal> ou <literal>indication</literal>.

source: Multiple providers can be grouped together and run under a single process to further minimize runtime resources. All providers registered under the same &lt;group-name&gt; will be executed under the same process. By default each provider will be run as a separate process.
pt_br: Vários provedores podem ser agrupados e executados em um único processo para minimizar ainda mais os recursos de tempo de execução. Todos os provedores registrados no mesmo &lt;group-name&gt; serão executados no mesmo processo. Por padrão, cada provedor será executado como um processo separado.

source: Specifies the unload policy for the provider. Currently the only supported option is <option>never</option>, which specifies that the provider will not be monitored for idle times and will never be unloaded. By default each provider will be unloaded when its idle times exceed the value specified in the configuration file.
pt_br: Especifica a política de descarregamento para o provedor. Atualmente, a única opção suportada é <option>nunca</option>, que especifica que o provedor não será monitorado por períodos de inatividade e nunca será descarregado. Por padrão, cada provedor será descarregado quando seus tempos de inatividade excederem o valor especificado no arquivo de configuração.

source: List of namespaces for which this provider can be executed. This is required, although for most providers this will be <literal>root/cimv2</literal>.
pt_br: Lista de namespaces para os quais esse provedor pode ser executado. Isso é necessário, embora para a maioria dos provedores seja <literal>root/cimv2</literal>.

source: Once all the class definitions and provider registration files are stored in the staging area, you need to rebuild the SFCB class repository with the command <command>sfcbrepos</command> <option>-f</option>.
pt_br: Depois que todas as definições de classe e arquivos de registro do provedor estiverem armazenados na área de preparação, você precisará reconstruir o repositório de classes SFCB com o comando <command>sfcbrepos</command> <option>-f</option>.

source: You can add, change or remove classes this way. After rebuilding the class repository, restart SFCB with command <command>systemctl restart sfcb</command>.
pt_br: Você pode adicionar, alterar ou remover classes dessa maneira. Após reconstruir o repositório de classes, reinicie o SFCB com o comando <command>systemctl restart sfcb</command>.

source: Alternatively, the SFCB package contains a utility that will copy provider class mof files and registration files to the correct locations in the staging area.
pt_br: Como alternativa, o pacote SFCB contém um utilitário que copiará arquivos de classe de provedor e arquivos de registro para os locais corretos na área de preparação.

source: After running this command you still need to rebuild the class repository and restart SFCB service.
pt_br: Depois de executar este comando, você ainda precisará reconstruir o repositório de classes e reiniciar o serviço SFCB.

source: The SFCB package includes two testing scripts: <command>wbemcat</command> and <command>xmltest</command>.
pt_br: O pacote SFCB inclui dois scripts de teste: <command>wbemcat</command> e <command>xmltest</command>.

source: <command>wbemcat</command> sends raw CIM-XML data via HTTP protocol to the specified SFCB host (localhost by default) listening on port 5988. Then it displays the returned results. The following file contains the CIM-XML representation of a standard EnumerateClasses request:
pt_br: <command> wbemcat </command> envia dados CIM-XML brutos via protocolo HTTP para o host SFCB especificado (localhost por padrão) atendendo na porta 5988. Em seguida, exibe os resultados retornados. O arquivo a seguir contém a representação CIM-XML de uma solicitação EnumerateClasses padrão:

source: Sending this request to SFCB CIMOM returns a list of all supported classes for which there is a registered provider. Suppose you save the file as <filename>cim_xml_test.xml</filename>.
pt_br: O envio dessa solicitação ao SFCB CIMOM retorna uma lista de todas as classes suportadas para as quais existe um provedor registrado. Suponha que você salve o arquivo como <filename>cim_xml_test.xml</filename>.

source: The classes listed will vary depending on what providers are installed on your system.
pt_br: As classes listadas variam de acordo com quais provedores estão instalados no seu sistema.

source: The second script <command>xmltest</command> is also used to send a raw CIM-XML test file to the SFCB CIMOM. It then compares the returned results against a previously saved <quote>OK</quote> result file. If there does not yet exist a corresponding <quote>OK</quote> file, it will be created for later use:
pt_br: O segundo script <command>xmltest</command> também é usado para enviar um arquivo de teste CIM-XML bruto ao SFCB CIMOM. Em seguida, ele compara os resultados retornados com um arquivo de resultado <quote>OK</quote> salvo anteriormente. Se ainda não existir um arquivo <quote>OK</quote>, ele será criado para uso posterior:

source: <prompt>tux &gt; </prompt>xmltest cim_xml_test.xml Running test cim_xml_test.xml ... OK Saving response as cim_xml_test.OK <prompt role="root">root # </prompt>xmltest cim_xml_test.xml Running test cim_xml_test.xml ... Passed
pt_br: <prompt>tux &gt; </prompt>xmltest cim_xml_test.xml Executando teste cim_xml_test.xml ... OK Salvando resposta como cim_xml_test.OK <prompt role="root">root # </prompt>xmltest cim_xml_test.xml Executando teste cim_xml_test.xml ... Passou

source: Command Line CIM Client: wbemcli
pt_br: Cliente CIM da linha de comandos: wbemcli

source: In addition to <command>wbemcat</command> and <command>xmltest</command>, the SBLIM project includes a more advanced command line CIM client <command>wbemcli</command>. The client is used to send CIM requests to SFCB server and display returned results. It is independent of CIMOM library and can be used with all WBEM compliant implementations.
pt_br: Além do <command>wbemcat</command> e <command>xmltest</command>, o projeto SBLIM inclui um cliente CIM da linha de comandos mais avançado <command>wbemcli</command>. O cliente é usado para enviar solicitações CIM ao servidor SFCB e exibir os resultados retornados. É independente da biblioteca CIMOM e pode ser usado com todas as implementações compatíveis com WBEM.

source: For example, if you need to list all the classes implemented by SBLIM providers registered to your SFCB, send the <quote>EnumerateClasses</quote> (ec) request to SFCB:
pt_br: Por exemplo, se você precisar listar todas as classes implementadas pelos provedores SBLIM registrados no seu SFCB, envie a solicitação <quote>EnumerateClasses</quote> (ec) ao SFCB:

source: The <option>-dx</option> option shows you the actual XML sent to SFCB by <command>wbemcli</command> and the actual XML received. In the above example, the first of many returned classes was <literal>CIM_ResourcePool</literal> followed by <literal>Linux_Ext4FileSystem</literal>. Similar entries will appear for all of the other registered classes.
pt_br: A opção <option>-dx</option> mostra o XML real enviado ao SFCB por <command>wbemcli</command> e o XML real recebido. No exemplo acima, a primeira de muitas classes retornadas foi <literal>CIM_ResourcePool</literal> seguida por <literal>Linux_Ext4FileSystem</literal>. Entradas semelhantes aparecerão para todas as outras classes registradas.

source: If you omit the <option>-dx</option> option, <command>wbemcli</command> will display only a compact representation of the returned data:
pt_br: Se você omitir a opção <option>-dx</option>, o <command>wbemcli</command> exibirá apenas uma representação compacta dos dados retornados:

source: For More Information
pt_br: Para maiores informações

source: For more details about WBEM and SFCB, see the following sources:
pt_br: Para mais detalhes sobre o WBEM e o SFCB, consulte as seguintes fontes:

source: Distributed Management Task Force Web site
pt_br: Site da Força-Tarefa de Gerenciamento Distribuído

source: SBLIM providers packages
pt_br: Pacotes de provedores SBLIM
