Repository: openSUSE/doc-sle-translations
Catalog: */po/adm_shell.*.po
Languages: cs, pt, pt_br

# _
source: translator-credits
cs: překladatelské kredity alkas alkas@volny.cz, 2016, 2020
pt: créditos-tradutor Luís Tiago Favas <opensuse.overseverely@aleeas.com>, 2020
pt_br: tradutor-créditos

source: Bash and Bash Scripts
cs: Bash a skripty Bash
pt: Bash e Bash Scripts
pt_br: Scripts Bash e Bash

source: Today, many people use computers with a graphical user interface (GUI) like GNOME. Although GUIs offer many features, they're limited when performing automated task execution. Shells complement GUIs well, and this chapter gives an overview of some aspects of shells, in this case the Bash shell.
cs: Mnoho lidí dnes používá počítače s grafickým uživatelským rozhraním (GUI), jako je GNOME. Ačkoli GUI nabízejí mnoho funkcí, jsou při provádění automatizovaného provádění úkolů omezené. Shells (mušle) dobře doplňují GUI a tato kapitola poskytuje přehled některých aspektů shellů, v tomto případě shellu Bash.
pt: Hoje em dia, muitas pessoas utilizam computadores com recurso a uma interface gráfica de utilizador (GUI) como o GNOME. Embora possam oferecer muitas funcionalidades, são muito limitadas na execução de tarefas automatizadas. As Shells (ou interpretadores de linha de comando) complementam os GUIs muito bem, e este capítulo dá uma visão geral de alguns aspetos das mesmas, neste caso da shell Bash.
pt_br: Hoje, muitas pessoas usam computadores com uma interface gráfica do usuário (GUI) como o GNOME. Embora as GUIs ofereçam muitos recursos, elas são limitadas ao executar a execução automatizada de tarefas. Os shells complementam bem as GUIs, e este capítulo fornece uma visão geral de alguns aspectos dos shells, neste caso o shell Bash.

source: yes
cs: ano
pt: sim
pt_br: sim

source: What is <quote>The Shell</quote>?
cs: Co je to <quote>Shell</quote> (mušle)?
pt: O que é a <quote>Shell</quote>?
pt_br: O que é o <quote> The Shell </quote>?

source: Traditionally, <emphasis>the</emphasis> shell is Bash (Bourne again Shell). When this chapter speaks about <quote>the shell</quote> it means Bash. There are more shells available (ash, csh, ksh, zsh, …), each employing different features and characteristics. If you need further information about other shells, search for <emphasis>shell</emphasis> in YaST.
cs: Tradičně je mušlí (<emphasis>shellem</emphasis>) míněn Bash (Bourne again Shell). Když tato kapitola mluví o <quote>shellu</quote>, znamená to Bash. K dispozici je více mušlí (ash, csh, ksh, zsh,…), z nichž každá má různé vlastnosti a charakteristiky. Pokud potřebujete další informace o jiných shellech (mušlích), vyhledejte <emphasis>shell</emphasis> v YaST.
pt: Tradicionalmente, <emphasis>a</emphasis> shell é Bash (Bourne again Shell, do inglês "Shell nascida outra vez"). Quando este capítulo referência a palavra <quote>shell</quote> está se a referir ao Bash. Existem mais shells disponíveis (ash, csh, ksh, zsh, …) sendo que cada uma integra funcionalidades e características diferentes. Se precisar de mais informação sobre outras shell, pesquise por <emphasis>shell</emphasis> no YaST.
pt_br: Tradicionalmente, <emphasis> o </emphasis> shell é Bash (Bourne again Shell). Quando este capítulo fala sobre <quote> o shell </quote>, significa Bash. Existem muitos shells disponíveis (ash, csh, ksh, zsh,…), cada um empregando características e características diferentes. Se você precisar de mais informações sobre outros shells, pesquise <emphasis> shell </emphasis> no YaST.

source: Knowing the Bash Configuration Files
cs: Znalost konfiguračních souborů Bash
pt: Conhecendo os Ficheiros de Configuração do Bash
pt_br: Conhecendo os arquivos de configuração do Bash

source: A shell can be invoked as an:
cs: Shell může být vyvolán jako:
pt: Uma shell pode ser invocada como:
pt_br: Um shell pode ser chamado como:

source: Interactive login shell
cs: Interaktivní login
pt: Uma shell interativa de autenticação
pt_br: Shell de login interativo

source: This is used when logging in to a machine, invoking Bash with the <option>--login</option> option or when logging in to a remote machine with SSH.
cs: Používá se při přihlášení k počítači, vyvolání Bash volbou <option> --login </option> nebo při přihlášení ke vzdálenému počítači pomocí SSH.
pt: Isto é utilizado quando se autentica numa máquina, invocando o Bash com a opção <option>--login</option> ou quando se autentica numa máquina remota com SSH.
pt_br: Isso é usado ao efetuar login em uma máquina, chamando o Bash com a opção <option> --login </option> ou ao fazer login em uma máquina remota com SSH.

source: <quote>Ordinary</quote> interactive shell
cs: <quote>Běžný</quote> interaktivní shell
pt: Shell interativa <quote>Ordinária</quote>
pt_br: Shell interativo <quote>Comum</quote>

source: This is normally the case when starting xterm, konsole, gnome-terminal or similar tools.
cs: Normální varianta při startu xterm, konzole, gnome-terminálu nebo podobných nástrojů.
pt: Este é normalmente o caso quando se inicia o xterm, konsole, gnome-terminal ou ferramentas similares.
pt_br: Normalmente, este é o caso ao iniciar o xterm, konsole, gnome-terminal ou ferramentas similares.

source: Non-interactive shell
cs: Neinteraktivní shell
pt: Shell não interativa
pt_br: Shell não interativo

source: This is used when invoking a shell script at the command line.
cs: Používá se při volání skriptu shellu z příkazového řádku.
pt: Isto é utilizado quando invocado um shell script através da linha de comandos.
pt_br: Isso é usado ao chamar um script de shell na linha de comando.

source: Depending on the type of shell you use, different configuration files will be read. The following tables show the login and non-login shell configuration files.
cs: V závislosti na typu shellu, který používáte, budou načteny různé konfigurační soubory. Následující tabulky ukazují konfigurační soubory přihlašovacího (login) a nepřihlašovacího (běžného) shellu.
pt: Dependendo do tipo de shell que utiliza, diferentes ficheiros de configuração serão lidos. As seguintes tabelas mostram os ficheiros de configuração com e sem autenticação.
pt_br: Dependendo do tipo de shell usado, diferentes arquivos de configuração serão lidos. As tabelas a seguir mostram os arquivos de configuração de shell de logon e não logon.

source: Bash Configuration Files for Login Shells
cs: Konfigurační soubory Bash pro přihlašovací (login) shelly
pt: Ficheiros de Configuração do Bash para Shells com Autenticação
pt_br: Arquivos de configuração do Bash para shells de logon

source: File
cs: Soubor
pt: Ficheiro
pt_br: Arquivo

source: Description
cs: Popis
pt: Descrição
pt_br: Descrição

source: Do not modify this file, otherwise your modifications may be destroyed during your next update!
cs: Tento soubor neupravujte, vaše úpravy mohou být během příští aktualizace zničeny!
pt: Não altere este ficheiro, caso contrário as suas alterações serão destruídas durante a próxima atualização!
pt_br: Não modifique este arquivo, caso contrário, suas modificações poderão ser destruídas durante sua próxima atualização!

source: Use this file if you extend <filename>/etc/profile</filename>
cs: Použijte tento soubor, rozšiřujete-li <filename>/etc/profile</filename>
pt: Utilize este ficheiro se estender <filename>/etc/profile</filename>
pt_br: Use este arquivo se você estender <filename>/etc/profile</filename>

source: Contains system-wide configuration files for specific programs
cs: Obsahuje celosystémové konfigurační soubory pro specifické programy
pt: Contêm ficheiros de configuração a nível de todo o sistema para programas específicos
pt_br: Contém arquivos de configuração em todo o sistema para programas específicos

source: Insert user specific configuration for login shells here
cs: Sem vložte uživatelské nastavení pro přihlašovací shelly
pt: Insira aqui a configuração específica do utilizador para shells de autenticação
pt_br: Insira aqui a configuração específica do usuário para shells de login

source: Note that the login shell also sources the configuration files listed under <xref linkend="tab.adm.shell.configs.nonloginshells"/>.
cs: Všimněte si, že přihlašovací shell také poskytuje konfigurační soubory uvedené v <xref linkend="tab.adm.shell.configs.nonloginshells"/>.
pt: Note que a shell de autenticação também origina os ficheiros de autenticação listados em <xref linkend="tab.adm.shell.configs.nonloginshells"/>.
pt_br: Observe que o shell de login também origina os arquivos de configuração listados em <xref linkend = "tab.adm.shell.configs.nonloginshells" />.

source: Bash Configuration Files for Non-Login Shells
cs: Konfigurační soubory Bash pro nepřihlašovací (běžné) shelly
pt: Ficheiros de Configuração para Shells Sem Autenticação
pt_br: Arquivos de configuração bash para shells sem logon

source: Use this file to insert your system-wide modifications for Bash only
cs: Tento soubor použijte k vložení svých celosystémových modifikací jen pro Bash
pt: Utilize este ficheiro para inserir modificações a nível de sistema apenas para o Bash
pt_br: Use este arquivo para inserir suas modificações em todo o sistema somente para o Bash

source: Insert user specific configuration here
cs: Sem vložte uživatelsky specifickou konfiguraci
pt: Inserir configurações específicas de utilizador aqui
pt_br: Insira aqui a configuração específica do usuário

source: Additionally, Bash uses some more files:
cs: Bash používá tyto další soubory:
pt: Adicionalmente, o Bash utiliza mais alguns ficheiros:
pt_br: Além disso, o Bash usa mais alguns arquivos:

source: Special Files for Bash
cs: Zvláštní soubory pro Bash
pt: Ficheiros Especiais para o Bash
pt_br: Arquivos especiais para Bash

source: Contains a list of all commands you have typed
cs: Obsahuje seznam všech vámi napsaných příkazů
pt: Contêm a lista de todos os comandos escritos anteriormente
pt_br: Contém uma lista de todos os comandos que você digitou

source: Executed when logging out
cs: Vykoná se při odhlášení
pt: Executado quando sai do sistema
pt_br: Executado ao fazer logout

source: User defined aliases of frequently used commands. See <command>man 1 alias</command> for more details about defining aliases.
cs: Uživatelem definované aliasy nebo často používané příkazy. Další podrobnosti o definování aliasů viz příkaz <command>man 1 alias</command>.
pt: Pseudónimos definidos por utilizador para comandos frequentes. Veja <command>man 1 alias</command> para mais informações de como definir pseudónimos.
pt_br: Aliases definidos pelo usuário de comandos usados com frequência. Veja <command>man 1 alias</command> para obter mais detalhes sobre como definir aliases.

source: Writing Shell Scripts
cs: Psaní skriptů pro shell
pt: Escrevendo Shell Scripts
pt_br: Escrevendo scripts de shell

source: Shell scripts provide a convenient way to perform a wide range of tasks: collecting data, searching for a word or phrase in a text and other useful things. The following example shows a small shell script that prints a text:
cs: Skripty shellu poskytují pohodlný způsob, jak provádět širokou škálu úkolů: sběr dat, vyhledávání slova nebo fráze v textu a další užitečné věci. Následující příklad ukazuje malý skript, který tiskne text:
pt: Os shell scripts providenciam uma forma conveniente de executar uma variada gama de tarefas: recolher dados, procurar por uma palavra ou frase num texto, bem como muitas outras coisas úteis. O seguinte exemplo mostra-lhe um pequeno shell script que imprime no ecrã um texto:
pt_br: Os scripts de shell fornecem uma maneira conveniente de executar uma ampla variedade de tarefas: coleta de dados, pesquisa de uma palavra ou frase em um texto e outras coisas úteis. O exemplo a seguir mostra um pequeno script de shell que imprime um texto:

source: A Shell Script Printing a Text
cs: Skript shellu tisknoucí text
pt: Um Shell Script de Impressão no Ecrã de Texto
pt_br: Um script de shell de imprimir um texto

source: #!/bin/sh <co xml:id="co.adm.shell.shebang"/> # Output the following line: <co xml:id="co.adm.shell.comment"/> echo "Hello World" <co xml:id="co.adm.shell.echo"/>
cs: #!/bin/sh <co xml:id="co.adm.shell.shebang"/> # Výpis tohoto řádku: <co xml:id="co.adm.shell.comment"/> echo "Hello World - ahoj světe" <co xml:id="co.adm.shell.echo"/>
pt: #!/bin/sh <co xml:id="co.adm.shell.shebang"/> # Produz a seguinte linha: <co xml:id="co.adm.shell.comment"/> echo "Ola Mundo" <co xml:id="co.adm.shell.echo"/>
pt_br: #!/bin/sh <co xml:id="co.adm.shell.shebang"/> # Crie a seguinte linha: <co xml:id="co.adm.shell.comment"/> echo "Olá Mundo" <co xml:id="co.adm.shell.echo"/>

source: The first line begins with the <emphasis>Shebang</emphasis> characters (<literal>#!</literal>) which indicate that this file is a script. The interpreter, specified after the <emphasis>Shebang</emphasis>, executes the script. In this case, the specified interpreter is <command>/bin/sh</command>.
cs: První řádek začíná znaky <emphasis>Shebang</emphasis> (<literal>#!</literal>) indikujích, že tento soubor je skript. Skript provede interpret uvedený za znaky <emphasis>Shebang</emphasis>. V tomto případě to je <command>/bin/sh</command>.
pt: A primeira linha começa com os caracteres <emphasis>Shebang</emphasis> (<literal>#!</literal>) que indicam que este ficheiro é um script. O interpretador especificado após o <emphasis>Shebang</emphasis>, executa o script. Neste caso, o interpretador especificado é o <command>/bin/sh</command>.
pt_br: A primeira linha começa com os caracteres <emphasis> Shebang </emphasis> (<literal> #! </literal>) que indicam que esse arquivo é um script. O intérprete, especificado após o <emphasis> Shebang </emphasis>, executa o script. Nesse caso, o intérprete especificado é <command>/bin/sh</command>.

source: The second line is a comment beginning with the hash sign. We recommend that you comment difficult lines. With proper commenting, you can remember the purpose and function of the line. Also, other readers will hopefully understand your script. Commenting is considered good practice in the development community.
cs: Druhý řádek je komentář začínající znakem "zahrádka" (dvojkřížek, hash). Doporučujeme obtížné řádky okomentovat. Při správném komentování si můžete pamatovat účel a funkci řádku. I jiní čtenáři lépe pochopí váš skript. Komentování je v komunitě vývojářů považováno za dobrou praxi.
pt: A segunda linha é meramente um comentário e começa sempre com o símbolo cardinal(#). Recomendemos que comente linhas difíceis. Com comentários apropriados, pode facilmente relembrar-se do propósito e funcionalidade da linha em questão. Em adição, outros leitores do seu script terão a vida facilitada a perceber o pretendido no mesmo. Comentar é considerado uma boa prática na comunidade de programadores.
pt_br: A segunda linha é um comentário que começa com o sinal de hash. Recomendamos que você comente linhas difíceis. Com os comentários adequados, você pode se lembrar do propósito e da função da linha. Além disso, esperamos que outros leitores entendam seu script. Comentar é considerado uma boa prática na comunidade de desenvolvimento.

source: The third line uses the built-in command <command>echo</command> to print the corresponding text.
cs: Třetí řádek používá zabudovaný příkaz <command>echo</command> pro tisk uvedeného textu.
pt: A terceira linha utiliza o comando incorporado no sistema <command>echo</command> para imprimir o texto correspondente.
pt_br: A terceira linha usa o comando interno <command>echo</command> para imprimir o texto correspondente.

source: Before you can run this script, there are a few prerequisites:
cs: Několik předpokladů před spuštěním tohoto skriptu:
pt: Antes de poder executar o script, existem alguns pré-requisitos:
pt_br: Antes de executar este script, existem alguns pré-requisitos:

source: Every script should contain a Shebang line (as in the example above). If the line is missing, you need to call the interpreter manually.
cs: Každý skript by měl obsahovat řádek Shebang (jako v uvedeném příkladu). Když tento řádek chybí, musíte vyvolat interpret ručně.
pt: Todos os scripts devem incluir a linha Shebang (como exemplificado acima). Se esta linha for omitida, você terá de chamar o interpretador manualmente.
pt_br: Todo script deve conter uma linha Shebang (como no exemplo acima). Se a linha estiver faltando, você precisará chamar o interpretador manualmente.

source: You can save the script wherever you want. However, it is a good idea to save it in a directory where the shell can find it. The search path in a shell is determined by the environment variable <envar>PATH</envar>. Usually a normal user does not have write access to <filename>/usr/bin</filename>. Therefore it is recommended to save your scripts in the users' directory <filename>~/bin/</filename>. The above example gets the name <filename>hello.sh</filename>.
cs: Skript můžete uložit, kamkoli budete chtít. Je však dobré uložit jej do adresáře, kde ho shell najde. Cesta hledání pro shell je určena proměnnou prostředí <envar>PATH</envar>. Normální uživatel nemá právo zápisu do <filename>/usr/bin</filename>. Proto se doporučuje ukládat skripty do uživatelského adresáře <filename>~/bin/</filename>. Uvedený příklad má název <filename>hello.sh</filename>.
pt: Você pode guardar o seu script onde quiser. No entanto, é boa prática guarda-lo numa diretoria onde a shell o possa encontrar. O caminho de pesquisa na shell é determinado pela variável de ambiente <envar>PATH</envar>. Por norma um utilizador normal não têm permissões de escrita no <filename>/usr/bin</filename>. Portanto é recomendado que grave os seus scripts na diretoria de usuário <filename>~/bin/</filename>. Ao exemplo acima foi aplicado o nome de <filename>hello.sh</filename>.
pt_br: Você pode salvar o script onde quiser. No entanto, é uma boa ideia salvá-lo em um diretório onde o shell possa encontrá-lo. O caminho de pesquisa em um shell é determinado pela variável de ambiente <envar>PATH</envar>. Normalmente, um usuário normal não tem acesso de gravação a <filename>/usr/bin</filename>. Portanto, é recomendável salvar seus scripts no diretório de usuários <filename>~/bin/</filename>. O exemplo acima obtém o nome <filename>hello.sh</filename>.

source: The script needs executable permissions. Set the permissions with the following command:
cs: Skript potřebuje právo spustitelnosti. Nastavte jeho práva takto:
pt: O script necessita de permissão de execução. Pode-lhe dar essa mesma permissão com o seguinte comando:
pt_br: O script precisa de permissões executáveis. Defina as permissões com o seguinte comando:

source: If you have fulfilled all of the above prerequisites, you can execute the script in the following ways:
cs: Jsou-li uvedené předpoklady splněny, spustíte skript takto:
pt: Se cumpriu todos os pré-requisito mencionados previamente, pode agora executar o script das seguintes maneiras:
pt_br: Se você cumpriu todos os pré-requisitos acima, poderá executar o script das seguintes maneiras:

source: As Absolute Path
cs: Jako absolutní cestu
pt: Como Caminho Absoluto
pt_br: Como caminho absoluto

source: The script can be executed with an absolute path. In our case, it is <command>~/bin/hello.sh</command>.
cs: Skript lze spustit s absolutní cestou. V našem případě to je <command>~/bin/hello.sh</command>.
pt: O script pode ser executado com um caminho absoluto. No nosso caso, é <command>~/bin/hello.sh</command>.
pt_br: O script pode ser executado com um caminho absoluto. No nosso caso, é <command>~/bin/hello.sh</command>.

source: Everywhere
cs: Všude
pt: De Qualquer Lado
pt_br: Em toda parte

source: If the <envar>PATH</envar> environment variable contains the directory where the script is located, you can execute the script with <command>hello.sh</command>.
cs: Obsauje-li proměnná prostředí <envar>PATH</envar> adresář se skriptem, lze skript spustit příkazem <command>hello.sh</command>.
pt: Se a variável de ambiente <envar>PATH</envar> contêm a diretoria onde o script se encontra localizado, pode executar o mesmo com <command>hello.sh</command>.
pt_br: Se a variável de ambiente <envar>PATH</envar> contiver o diretório em que o script está localizado, você poderá executar o script com <command>hello.sh</command>.

source: Redirecting Command Events
cs: Přesměrování událostí příkazu
pt: Redirecionamento de Eventos de Comando
pt_br: Redirecionando eventos de comando

source: Each command can use three channels, either for input or output:
cs: Každý příkaz může používat tři kanály, jak vstupní, tak výstupní:
pt: Cada comando pode utilizar três canais, ou para entrada(input) ou para saída(output):
pt_br: Cada comando pode usar três canais, para entrada ou saída:

source: Standard Output
cs: Standardní výstup
pt: Output Padrão
pt_br: Saída padrão

source: This is the default output channel. Whenever a command prints something, it uses the standard output channel.
cs: Standardní výstupní kanál. Kdykoli příkaz něco vytiskne, použije standardní výstupní kanál.
pt: Este é o canal padrão de output. Sempre que um comando imprime alguma coisa, utiliza o canal de saída padrão.
pt_br: Este é o canal de saída padrão. Sempre que um comando imprime alguma coisa, ele usa o canal de saída padrão.

source: Standard Input
cs: Standardní vstup
pt: Input Padrão
pt_br: Entrada padrão

source: If a command needs input from users or other commands, it uses this channel.
cs: Potřebuje-li příkaz vstupní údaj od uživatele nebo z jiných příkazů, používá tento kanál.
pt: Sempre que um comando necessita de input(inserção de valores) dos utilizadores ou de outros comandos, utiliza este canal.
pt_br: Se um comando precisar de entrada de usuários ou outros comandos, ele usará este canal.

source: Standard Error
cs: Standardní chybový kanál
pt: Erro Padrão
pt_br: Erro padrão

source: Commands use this channel for error reporting.
cs: Tento kanál používají příkazy pro hlášení chyb.
pt: Os comandos utilizam este canal para reportar erros.
pt_br: Os comandos usam este canal para relatório de erros.

source: To redirect these channels, there are the following possibilities:
cs: Tyto kanály lze přesměrovat těmito způsoby:
pt: Para redirecionar estes canais, existem as seguintes possibilidades:
pt_br: Para redirecionar esses canais, existem as seguintes possibilidades:

source: <literal>Command &gt; File</literal>
cs: <literal>Příkaz &gt; Soubor</literal>
pt: <literal>Comando &gt; Ficheiro</literal>
pt_br: <literal>Comando &gt; Arquivo</literal>

source: Saves the output of the command into a file, an existing file will be deleted. For example, the <command>ls</command> command writes its output into the file <filename>listing.txt</filename>:
cs: Uloží výstup příkazu do souboru; pokud takový soubor už existoval, bude přepsán. Například příkaz <command>ls</command> zapíše svůj výstup do souboru <filename>listing.txt</filename>:
pt: Grava o output de um comando dentro de um ficheiro, se o ficheiro existir será apagado. No exemplo a seguir, o resultado do comando <command>ls</command> será escrito para o ficheiro <filename>listing.txt</filename>:
pt_br: Salva a saída do comando em um arquivo, um arquivo existente será excluído. Por exemplo, o comando <command> ls </command> grava sua saída no arquivo <filename> lista.txt </filename>:

source: <literal>Command &gt;&gt; File</literal>
cs: <literal>Příkaz &gt;&gt; Soubor</literal>
pt: <literal>Comando &gt;&gt; Ficheiro</literal>
pt_br: <literal>Comando &gt;&gt; Arquivo</literal>
