Repository: openSUSE/doc-sle-translations
Catalog: */po/adm_sudo.*.po
Languages: cs, pt_br

source: # Everything on a line after a # gets ignored <co xml:id="co.sudo.syntax.comment"/> Defaults !insults # Disable the insults flag <co xml:id="co.sudo.syntax.flag"/> Defaults env_keep += "DISPLAY HOME" # Add DISPLAY and HOME to env_keep tux ALL = NOPASSWD: /usr/bin/frobnicate, PASSWD: /usr/bin/journalctl <co xml:id="co.sudo.syntax.rule"/>
cs: # Vše, co je na řádku za "#", se ignoruje <co xml:id="co.sudo.syntax.comment"/> Defaults !insults # Vypnout příznak insults <co xml:id="co.sudo.syntax.flag"/> Defaults env_keep += "DISPLAY HOME" # Přidat DISPLAY a HOME k env_keep tux ALL = NOPASSWD: /usr/bin/frobnicate, PASSWD: /usr/bin/journalctl <co xml:id="co.sudo.syntax.rule"/>
pt_br: # Tudo em uma linha após um # é ignorado <co xml:id="co.sudo.syntax.comment"/> Defaults !insults # Desativa o sinalizador de insultos <co xml:id="co.sudo.syntax.flag"/> Defaults env_keep += "DISPLAY HOME" # Adiciona DISPLAY e HOME a env_keep tux ALL = NOPASSWD: /usr/bin/frobnicate, PASSWD: /usr/bin/journalctl <co xml:id="co.sudo.syntax.rule"/>

source: There are two exceptions: <literal>#include</literal> and <literal>#includedir</literal> are normal commands. Followed by digits, it specifies a UID.
cs: Jsou dvě výjimky: <literal>#include</literal> a <literal>#includedir</literal> jsou normální příkazy. Následují-li číslice, je to specifikace UID.
pt_br: Existem duas exceções: <literal>#include</literal> e <literal>#includedir</literal> são comandos normais. Seguido por dígitos, isso especifica uma UID.

source: Remove the <literal>!</literal> to set the specified flag to ON.
cs: K nastavení udaného příznaku na "zapnuto" (ON) odstraňte <literal>!</literal>.
pt_br: Remove o <literal>!</literal> para definir o sinalizador especificado como ON.

source: See <xref linkend="sec.sudo.conf.rule"/>.
cs: Viz <xref linkend="sec.sudo.conf.rule"/>.
pt_br: Ver <xref linkend="sec.sudo.conf.rule"/>.

source: Useful Flags and Options
cs: Užitečné příznaky a volby
pt_br: Opções e sinalizadores úteis

source: Option name
cs: Název volby
pt_br: Nome da opção

source: Description
cs: Popis
pt_br: Descrição

source: Example
cs: Příklad
pt_br: Exemplo

source: This flag controls whether the invoking user is required to enter the password of the target user (ON) (for example <systemitem class="username">root</systemitem>) or the invoking user (OFF).
cs: Tento příznak určuje, zda je vyvolávající uživatel povinen zadat heslo cílového uživatele (ON) (například <systemitem class="username">root</systemitem>) nebo vyvolávajícího uživatele (OFF).
pt_br: Esse sinalizador controla se o usuário que está chamando é obrigado a inserir a senha do usuário de destino (ON) (por exemplo, <systemitem class="nome de usuário"> raiz </systemitem>) ou o usuário que está chamando (OFF).

source: Defaults targetpw # Turn targetpw flag ON
cs: Defaults targetpw # Zapnout příznak targetpw ON
pt_br: Defaults targetpw # Ative o sinalizador targetpw

source: If set, <command>sudo</command> will prompt for the <systemitem class="username">root</systemitem> password instead of the target user's or the invoker's. The default is OFF.
cs: Pokud je nastaveno, <command>sudo</command> vyzve k zadání hesla uživatele <systemitem class="username">root</systemitem> místo cílového nebo volajícího uživatele. Výchozí hodnota je VYPNUTO.
pt_br: Se definido, o <command>sudo</command> solicitará a senha <systemitem class="username"> root </systemitem> em vez do usuário de destino ou do invocador. O padrão é OFF.

source: Defaults !rootpw # Turn rootpw flag OFF
cs: Defaults !rootpw # Vypnout příznak rootpw (OFF)
pt_br: Defaults !rootpw # Desativar o sinalizador rootpw

source: If set, <command>sudo</command> constructs a minimal environment with only <envar>TERM</envar>, <envar>PATH</envar>, <envar>HOME</envar>, <envar>MAIL</envar>, <envar>SHELL</envar>, <envar>LOGNAME</envar>, <envar>USER</envar>, <envar>USERNAME</envar>, and <envar>SUDO_*</envar> set. Additionally, variables listed in <literal>env_keep</literal> get imported from the calling environment. The default is ON.
cs: Je-li zapnut (ON), vytvoří <command>sudo</command> minimální prostředí a nastaví pouze proměnné <envar>TERM</envar>, <envar>PATH</envar>, <envar>HOME</envar>, <envar>MAIL</envar>, <envar>SHELL</envar>, <envar>LOGNAME</envar>, <envar>USER</envar>, <envar>USERNAME</envar> a <envar>SUDO_*</envar>. Navíc importuje z volajícího prostředí proměnné, jejichž seznam je v <literal>env_keep</literal>. Výchozí stav příznaku: zapnut (ON).
pt_br: Se definido, <command>sudo</command> constrói um ambiente mínimo com apenas <envar>TERM</envar>, <envar>PATH</envar>, <envar>HOME</envar>, <envar>MAIL</envar>, <envar>SHELL</envar>, <envar>LOGNAME</envar>, <envar>USER</envar>, <envar>USERNAME</envar> e <envar>SUDO_ *</envar>. Além disso, as variáveis listadas em <literal>env_keep</literal> são importadas do ambiente de chamada. O padrão é ON.

source: Defaults env_reset # Turn env_reset flag ON
cs: Defaults env_reset # Zapne příznak env_reset
pt_br: Defaults env_reset # Ativa o sinalizador env_reset

source: List of environment variables to keep when the <literal>env_reset</literal> flag is ON.
cs: Seznam proměnných prostředí k přenosu z volajícího prostředí, když je příznak <literal>env_reset</literal> zapnut (ON).
pt_br: Lista de variáveis de ambiente a serem mantidas quando o sinalizador <literal>env_reset</literal> estiver ativado.

source: # Set env_keep to contain EDITOR and PROMPT Defaults env_keep = "EDITOR PROMPT" Defaults env_keep += "JRE_HOME" # Add JRE_HOME Defaults env_keep -= "JRE_HOME" # Remove JRE_HOME
cs: # Nastaví env_keep, aby obsahovala EDITOR a PROMPT Defaults env_keep = "EDITOR PROMPT" Defaults env_keep += "JRE_HOME" # Přidá JRE_HOME Defaults env_keep -= "JRE_HOME" # Odstraní JRE_HOME
pt_br: # Define env_keep para conter EDITOR e PROMPT Defaults env_keep = "EDITOR PROMPT" Defaults env_keep += "JRE_HOME" # Adicionar JRE_HOME Defaults env_keep -= "JRE_HOME" # Remover JRE_HOME

source: List of environment variables to remove when the <literal>env_reset</literal> flag is OFF.
cs: Seznam proměnných prostředí, které nepřenést z volajícího prostředí, když je příznak <literal>env_reset</literal> vypnut (OFF).
pt_br: Lista de variáveis de ambiente a serem removidas quando o sinalizador <literal>env_reset</literal> estiver desativado.

source: # Set env_delete to contain EDITOR and PROMPT Defaults env_delete = "EDITOR PROMPT" Defaults env_delete += "JRE_HOME" # Add JRE_HOME Defaults env_delete -= "JRE_HOME" # Remove JRE_HOME
cs: # Nastaví env_delete, aby obsahovala EDITOR a PROMPT Defaults env_delete = "EDITOR PROMPT" Defaults env_delete += "JRE_HOME" # Přidá JRE_HOME Defaults env_delete -= "JRE_HOME" # Odstraní JRE_HOME
pt_br: # Defina env_delete para conter EDITOR e PROMPT Defaults env_delete = "EDITOR PROMPT" Defaults env_delete += "JRE_HOME" # Adicionar JRE_HOME Defaults env_delete -= "JRE_HOME" # Remover JRE_HOME

source: The <literal>Defaults</literal> token can also be used to create aliases for a collection of users, hosts, and commands. Furthermore, it is possible to apply an option only to a specific set of users.
cs: Direktivu <literal> Výchozí </literal> lze také použít k vytvoření aliasu pro kolekci uživatelů, hostitelů a příkazů. Lze také volbu použít pouze na určenou skupinu uživatelů.
pt_br: O token <literal>Defaults</literal> também pode ser usado para criar aliases para uma coleção de usuários, hosts e comandos. Além disso, é possível aplicar uma opção apenas a um conjunto específico de usuários.

source: For detailed information about the <filename>/etc/sudoers</filename> configuration file, consult <command>man 5 sudoers</command>.
cs: Podrobné údaje o konfiguračním souboru <filename>/etc/sudoers</filename> zjistíte v <command>man 5 sudoers</command>.
pt_br: Para obter informações detalhadas sobre o arquivo de configuração <filename>/etc/sudoers</filename>, consulte <command>man 5 sudoers</command>.

source: Rules in sudoers
cs: Pravidla platná v sudoers
pt_br: Regras em sudoers

source: Rules in the sudoers configuration can be very complex, so this section will only cover the basics. Each rule follows the basic scheme (<literal>[]</literal> marks optional parts):
cs: Pravidla v konfiguraci sudoers mohou být velmi složitá, proto se tato část bude zabývat pouze základy. Každé pravidlo se řídí základním schématem (<literal> [] </literal> označuje volitelné části):
pt_br: As regras na configuração do sudoers podem ser muito complexas; portanto, esta seção abordará apenas o básico. Cada regra segue o esquema básico (<literal>[]</literal> marca partes opcionais):

source: #Who Where As whom Tag What User_List Host_List = [(User_List)] [NOPASSWD:|PASSWD:] Cmnd_List
cs: #Kdo Kde Jako kdo Příznak Co User_List Host_List = [(User_List)] [NOPASSWD:|PASSWD:] Cmnd_List
pt_br: #Quem Onde Como quem Tag Que User_List Host_List = [(User_List)] [NOPASSWD:|PASSWD:] Cmnd_List

source: Syntax for sudoers Rules
cs: Syntaxe pravidel pro sudoers
pt_br: Regras de sintaxe para sudoers

source: One or more (separated by <literal>,</literal>) identifiers: Either a user name, a group in the format <literal>%GROUPNAME</literal> or a user ID in the format <literal>#UID</literal>. Negation can be performed with a <literal>!</literal> prefix.
cs: Jeden nebo více identifikátorů (oddělených <literal>,</literal>): Buď jméno uživatele, skupina ve formátu <literal>%SKUPINA</literal> nebo ID uživatele ve formátu <literal>#UID</literal>. Negaci lze provést předponou <literal>!</literal>.
pt_br: Um ou mais identificadores (separados por <literal>, </literal>): um nome de usuário, um grupo no formato <literal>%GROUPNAME</literal> ou um ID do usuário no formato <literal>#UID</literal>. A negação pode ser realizada com um prefixo <literal>!</literal>.

source: One or more (separated by <literal>,</literal>) identifiers: Either a (fully qualified) host name or an IP address. Negation can be performed with a <literal>!</literal> prefix. <literal>ALL</literal> is the usual choice for <literal>Host_List</literal>.
cs: Jeden nebo více identifikátorů (oddělených <literal>,</literal>): buď (plně kvalifikovaný) název hostitele nebo IP adresa. Negaci lze provést předponou <literal>!</literal>. <literal>ALL</literal> je obvyklá volba pro <literal>Host_List</literal>.
pt_br: Um ou mais identificadores (separados por <literal>, </literal>): Um nome de host (totalmente qualificado) ou um endereço IP. A negação pode ser realizada com um prefixo <literal>!</literal>.<literal>ALL</literal> é a escolha usual para <literal>Host_List</literal>.

source: The user will not be prompted for a password when running commands matching <literal>CMDSPEC</literal> after <literal>NOPASSWD:</literal>.
cs: Při spuštění příkazů odpovídajících <literal>CMDSPEC</literal> uvedených za <literal>NOPASSWD:</literal> nebude uživatel vyzván k zadání hesla.
pt_br: Não será solicitada uma senha ao usuário ao executar comandos correspondentes a <literal>CMDSPEC</literal> após <literal>NOPASSWD:</literal>.

source: <literal>PASSWD</literal> is the default, it only needs to be specified when both are on the same line:
cs: <literal>PASSWD</literal> je výchozí; musí být zadán, pouze pokud jsou oba na stejném řádku:
pt_br: <literal> PASSWD </literal> é o padrão, ele só precisa ser especificado quando os dois estiverem na mesma linha:

source: One or more (separated by <literal>,</literal>) specifiers: A path to an executable, followed by allowed arguments or nothing.
cs: Jeden nebo více specifikátorů (oddělených <literal>,</literal>): Cesta ke spustitelnému souboru, následovaná povolenými argumenty, nebo nic (prázdný).
pt_br: Um ou mais especificadores (separados por <literal>, </literal>): um caminho para um executável, seguido por argumentos permitidos ou nada.

source: /usr/bin/foo # Anything allowed /usr/bin/foo bar # Only "/usr/bin/foo bar" allowed /usr/bin/foo "" # No arguments allowed
cs: /usr/bin/foo # povoleno cokoli /usr/bin/foo bar # povoleno pouze "/usr/bin/foo bar" /usr/bin/foo "" # Argumenty nejsou povoleny

source: <literal>ALL</literal> can be used as <literal>User_List</literal>, <literal>Host_List</literal>, and <literal>Cmnd_List</literal>.
cs: Místo <literal>User_List</literal>, <literal>Host_List</literal> a <literal>Cmnd_List</literal> lze použít <literal>ALL</literal>.
pt_br: <literal>ALL</literal> pode ser usado como <literal>User_List</literal>, <literal>Host_List</literal>, e<literal>Cmnd_List</literal>.

source: A rule that allows <systemitem class="username">tux</systemitem> to run all commands as root without entering a password:
cs: Pravidlo, které umožňuje <systemitem class="username">tux</systemitem> spouštět všechny příkazy jako root bez zadání hesla:
pt_br: Uma regra que permite que <systemitem class="username">tux</systemitem> execute todos os comandos como root sem inserir uma senha:

source: A rule that allows <systemitem class="username">tux</systemitem> to run <command>systemctl restart apache2</command>:
cs: Pravidlo, které umožňuje <systemitem class="username">tux</systemitem> spouštět <command>systemctl restart apache2</command>:
pt_br: Uma regra que permite que <systemitem class="username">tux</systemitem> execute <command>systemctl restart apache2</command>:

source: A rule that allows <systemitem class="username">tux</systemitem> to run <command>wall</command> as <systemitem>admin</systemitem> with no arguments:
cs: Pravidlo, které umožňuje <systemitem class="username">tux</systemitem> spustit <command>wall</command> jako <systemitem>admin</systemitem> bez argumentů:
pt_br: Uma regra que permite que <systemitem class="username">tux</systemitem> execute <command>wall</command> como <systemitem>admin</systemitem> sem argumentos:

source: Dangerous constructs
cs: Nebezpečné konstrukce
pt_br: Construções perigosas

source: Constructs of the kind
cs: Konstrukce typu
pt_br: Construções do tipo

source: <emphasis>must not</emphasis> be used without <literal>Defaults targetpw</literal>, otherwise anyone can run commands as <systemitem class="username">root</systemitem>.
cs: <emphasis>nesmí být</emphasis> použity bez <literal>Defaults targetpw</literal>, jinak může kdokoli spouštět příkazy jako <systemitem class="username">root</systemitem>.
pt_br: <emphasis>não deve</emphasis> ser usado sem <literal>Padrões targetpw</literal>, caso contrário, qualquer um pode executar comandos como <systemitem class="username">root</systemitem>.

source: Common Use Cases
cs: Případy běžného použití
pt_br: Casos de uso comuns

source: Although the default configuration is often sufficient for simple setups and desktop environments, custom configurations can be very useful.
cs: Přestože výchozí konfigurace je často dostatečná pro jednoduchá nastavení v prostředí stolních počítačů, vlastní konfigurace mohou být velmi užitečné.
pt_br: Embora a configuração padrão geralmente seja suficiente para configurações simples e ambientes de desktop, configurações personalizadas podem ser muito úteis.

source: Using <command>sudo</command> without <systemitem class="username">root</systemitem> Password
cs: Použití <command>sudo</command> bez hesla uživatele <systemitem class="username">root</systemitem>
pt_br: Usando <command>sudo</command> sem <systemitem class="username"> root </systemitem> Senha

source: In cases with special restrictions (<quote>user X can only run command Y as <systemitem class="username">root</systemitem></quote>) it is not possible. In other cases, it is still favorable to have some kind of separation. By convention, members of the group <systemitem class="groupname">wheel</systemitem> can run all commands with <command>sudo</command> as root.
cs: V případech se zvláštními omezeními (<quote>uživatel X může spustit příkaz Y pouze jako <systemitem class="username">root</systemitem></quote>) to není možné. V jiných případech je však výhodné mít nějaký druh odstupu. Členové skupiny <systemitem class="groupname">wheel</systemitem> mohou běžně spouštět všechny příkazy s <command>sudo</command> jako root.
pt_br: Em casos com restrições especiais (o usuário X só pode executar o comando Y como <systemitem class="nome do usuário"> raiz </systemitem> </quote>), isso não é possível. Em outros casos, ainda é favorável ter algum tipo de separação. Por convenção, os membros do grupo <systemitem class="groupname">wheel</systemitem> podem executar todos os comandos com <command>sudo</command> como raiz.

source: Add yourself to the <systemitem class="groupname">wheel</systemitem> group
cs: Přidejte se do skupiny <systemitem class="groupname">wheel</systemitem>
pt_br: Adicione-se ao grupo <systemitem class="groupname">wheel</systemitem>

source: If your user account is not already member of the <systemitem class="groupname">wheel</systemitem> group, add it by running <command>sudo usermod -a -G wheel <replaceable>USERNAME</replaceable></command> and logging out and in again. Verify that the change was successful by running <command>groups <replaceable>USERNAME</replaceable></command>.
cs: Není-li Váš uživatelský účet již členem skupiny <systemitem class="groupname">wheel</systemitem>, přidejte jej spuštěním <command>sudo usermod -a -G wheel <replaceable>UŽIVATEL</replaceable></command>, pak se odhlaste a opět přihlaste. Ověřte, že změna byla úspěšná, příkazem <command>groups<replaceable>UŽIVATEL</replaceable></command>.
pt_br: Se sua conta de usuário ainda não for membro do grupo <systemitem class="groupname">wheel</systemitem>, inclua-a executando <command>sudo usermod -a -G wheel <replaceable> NOME DE USUÁRIO</replaceable> </command > saia e entre novamente. Verifique se a alteração foi bem-sucedida executando o comando <command>groups <replaceable>NOME DE USUÁRIO</replaceable> </command>.

source: Make authentication with the invoking user's password the default.
cs: Nastavte ověřování pomocí hesla volajícího uživatele jako výchozí.
pt_br: Se sua conta de usuário ainda não for membro do grupo <systemitem class="groupname">wheel</systemitem>, inclua-a executando <command>sudo usermod -a -G wheel<replaceable> NOME DE USUÁRIO</replaceable> </command> e sair e entrar novamente. Verifique se a alteração foi bem-sucedida executando <command>groups <replaceable>NOME DE USUÁRIO</replaceable> </command>.

source: Create the file <filename>/etc/sudoers.d/userpw</filename> with <command>visudo</command> (see <xref linkend="sec.sudo.conf.edit"/>) and add:
cs: Vytvořte soubor <filename>/etc/sudoers.d/userpw</filename> příkazem <command>visudo</command> (viz <xref linkend="sec.sudo.conf.edit"/>) a přidejte:
pt_br: Crie o arquivo <filename>/etc/sudoers.d/userpw</filename> com <command>visudo</command> (consulte <xref linkend="sec.sudo.conf.edit"/>) e adicione:

source: Select a new default rule.
cs: Vyberte nové výchozí pravidlo.
pt_br: Selecione uma nova regra padrão.

source: Depending on whether you want users to re-enter their passwords, uncomment the specific line in <filename>/etc/sudoers</filename> and comment out the default rule.
cs: V závislosti na tom, zda chcete, aby uživatelé znovu zadávali svá hesla, odkomentujte konkrétní řádek v <filename>/etc/sudoers</filename> a zakomentujte výchozí pravidlo.
pt_br: Dependendo se você deseja que os usuários digitem suas senhas novamente, remova o comentário da linha específica em <filename>/etc/sudoers</filename> e comente a regra padrão.

source: ## Uncomment to allow members of group wheel to execute any command # %wheel ALL=(ALL) ALL ## Same thing without a password # %wheel ALL=(ALL) NOPASSWD: ALL
cs: ## Odkomentováním umožníte členům skupiny wheel provést jakýkoli příkaz # %wheel ALL=(ALL) ALL ## Totéž bez nutnosti zadávat heslo # %wheel ALL=(ALL) NOPASSWD: ALL
pt_br: ## Remova o comentário para permitir que os membros do grupo wheel executem qualquer comando # %wheel ALL=(ALL) ALL ## A mesma coisa sem uma senha # %wheel ALL=(ALL) NOPASSWD: ALL

source: Make the default rule more restrictive
cs: Upravte výchozí pravidlo, aby bylo více omezující
pt_br: Tornar a regra padrão mais restritiva

source: Comment out or remove the allow-everything rule in <filename>/etc/sudoers</filename>:
cs: Zakomentujte nebo odstraňte vše-dovolující pravidlo v <filename>/etc/sudoers</filename>:
pt_br: Comente ou remova a regra allow-everything em <filename>/etc/sudoers</filename>:

source: ALL ALL=(ALL) ALL # WARNING! Only use this together with 'Defaults targetpw'!
cs: ALL ALL=(ALL) ALL # POZOR! Toto používat jen s 'Defaults targetpw'!
pt_br: ALL ALL=(ALL) ALL # AVISO! Use isso apenas em conjunto com 'Defaults targetpw'!

source: Dangerous rule in sudoers
cs: Nebezpečná pravidla v sudoers
pt_br: Regra perigosa em sudoers

source: Do not forget this step, otherwise <emphasis>any</emphasis> user can execute <emphasis>any</emphasis> command as <systemitem class="username">root</systemitem>!
cs: Nezapomeňte na tento krok, jinak může <emphasis>kterýkoli</emphasis> uživatel provést <emphasis>libovolný</emphasis> příkaz jako <systemitem class="username">root</systemitem>!
pt_br: Não se esqueça desta etapa, caso contrário, <emphasis>qualquer</emphasis> usuário pode executar <emphasis>qualquer</emphasis> comando como <systemitem class="username">root</systemitem>!

source: Test the configuration
cs: Otestujte konfiguraci
pt_br: Teste a configuração

source: Try to run <command>sudo</command> as member and non-member of <systemitem class="groupname">wheel</systemitem>.
cs: Zkuste spustit <command>sudo</command> jako člen a jako nečlen skupiny <systemitem class="groupname">wheel</systemitem>.
pt_br: Tente executar <command>sudo</command> como membro e não membro da roda <systemitem class="groupname">wheel</systemitem>.

source: <prompt>tux:~ &gt; </prompt>groups users wheel <prompt>tux:~ &gt; </prompt>sudo id -un tux's password: root <prompt>wilber:~ &gt; </prompt>groups users <prompt>wilber:~ &gt; </prompt>sudo id -un wilber is not in the sudoers file. This incident will be reported.
cs: <prompt>tux:~ &gt; </prompt>groups users wheel <prompt>tux:~ &gt; </prompt>sudo id -un tux's password: root <prompt>wilber:~ &gt; </prompt>groups users <prompt>wilber:~ &gt; </prompt>sudo id -un wilber není v souboru sudoers. Tento konflikt bude ohlášen.
pt_br: <prompt>tux:~ &gt; </prompt>groups users wheel <prompt>tux:~ &gt; </prompt>sudo id -un tux's password: root <prompt>wilber:~ &gt; </prompt>groups users <prompt>wilber:~ &gt; </prompt>sudo id -un wilbernão está no arquivo sudoers. Este incidente será relatado.

source: Using <command>sudo</command> with X.Org Applications
cs: Použití <command>sudo</command> s aplikacemi X.Org
pt_br: Usando <command>sudo</command> com aplicativos X.Org

source: When starting graphical applications with <command>sudo</command>, you will encounter the following error:
cs: Při spouštění grafických aplikací příkazem <command>sudo</command> se ohlásí chyba:
pt_br: Ao iniciar aplicativos gráficos com <command>sudo</command>, você encontrará o seguinte erro:

source: <prompt>tux &gt; </prompt><command>sudo</command> xterm xterm: Xt error: Can't open display: %s xterm: DISPLAY is not set
cs: <prompt>tux &gt; </prompt><command>sudo</command> xterm xterm: Xt error: Can't open display: %s [chyba Xt: nelze otevřít displej:] xterm: DISPLAY is not set [DISPLAY nenastaven]
pt_br: <prompt>tux &gt; </prompt><command>sudo</command> xterm xterm: Xt erro: Não é possível abrir a tela: %s xterm: DISPLAY não está definido

source: YaST will pick the ncurses interface instead of the graphical one.
cs: YaST vybere rozhraní ncurses místo grafického rozhraní.
pt_br: O YaST selecionará a interface ncurses em vez da interface gráfica.
