Repository: openSUSE/doc-sle-translations
Catalog: */po/adm_wbem.*.po
Languages: pt_br

# _
source: translator-credits
pt_br: tradutor-créditos

source: Web Based Enterprise Management Using SFCB
pt_br: Gerenciamento corporativo baseado na Web usando SFCB

source: yes
pt_br: sim

source: Introduction and Basic Concept
pt_br: Introdução e conceito básico

source: SUSE® Linux Enterprise Server (SLES) provides a collection of open standards based tools for the unified management of disparate computing systems and environments. Our enterprise solutions implement the standards proposed by the Distributed Management Task Force. The following paragraphs describe their basic components.
pt_br: O SUSE® Linux Enterprise Server (SLES) fornece uma coleção de ferramentas baseadas em padrões abertos para o gerenciamento unificado de sistemas e ambientes de computação diferentes. Nossas soluções corporativas implementam os padrões propostos pela Força-Tarefa de Gerenciamento Distribuído. Os parágrafos a seguir descrevem seus componentes básicos.

source: Distributed Management Task Force, Inc (DMTF) is the industry organization which leads the development of management standards for enterprise and Internet environments. Their goal is to unify management standards and initiatives, and to enable more integrated, cost effective and interoperable management solutions. DMTF standards provide common system management components for control and communication. Their solutions are independent of platforms and technologies. <emphasis>Web Based Enterprise Management</emphasis> and <emphasis>Common Information Model </emphasis> are one of their key technologies.
pt_br: A Distributed Management Task Force, Inc (DMTF) é a organização do setor que lidera o desenvolvimento de padrões de gerenciamento para ambientes corporativos e da Internet. Seu objetivo é unificar padrões e iniciativas de gerenciamento e permitir soluções de gerenciamento mais integradas, econômicas e interoperáveis. Os padrões DMTF fornecem componentes comuns de gerenciamento de sistema para controle e comunicação. Suas soluções são independentes de plataformas e tecnologias. <emphasis>Gerenciamento corporativo baseado na Web</emphasis> e <emphasis>Common Information Model</emphasis> são uma de suas principais tecnologias.

source: Web Based Enterprise Management (WBEM) is a set of management and Internet standard technologies. WBEM is developed to unify the management of enterprise computing environments. It provides the ability for the industry to deliver a well-integrated collection of management tools using Web technologies. WBEM consists of the following standards:
pt_br: O Gerenciamento Empresarial Baseado na Web (WBEM) é um conjunto de tecnologias padrão de gerenciamento e Internet. O WBEM foi desenvolvido para unificar o gerenciamento de ambientes de computação corporativa. Ele fornece a capacidade do setor de fornecer uma coleção bem integrada de ferramentas de gerenciamento usando tecnologias da Web. O WBEM consiste nos seguintes padrões:

source: A data model: the Common Information Model (CIM) standard
pt_br: Um modelo de dados: o padrão Common Information Model (CIM)

source: An encoding specification: CIM-XML Encoding Specification
pt_br: Uma especificação de codificação: Especificação de codificação CIM-XML

source: A transport mechanism: CIM operations over HTTP
pt_br: Um mecanismo de transporte: operações do CIM sobre HTTP

source: Common Information Model is a conceptual information model that describes system management. It is not bound to a particular implementation and enables the interchange of management information between management systems, networks, services and applications. There are two parts to CIM — the CIM Specification and the CIM Schema.
pt_br: O Common Information Model é um modelo de informação conceitual que descreve o gerenciamento do sistema. Não está vinculado a uma implementação específica e permite o intercâmbio de informações de gerenciamento entre sistemas, redes, serviços e aplicativos de gerenciamento. Existem duas partes no CIM - a Especificação CIM e o Esquema CIM.

source: The <emphasis>CIM Specification</emphasis> describes the language, naming and meta schema. The meta schema is a formal definition of the model. It defines the terms used to express the model and their usage and semantics. The elements of the meta schema are <emphasis>classes</emphasis>, <emphasis>properties</emphasis>, and <emphasis>methods</emphasis>. The meta schema also supports <emphasis>indications</emphasis> and <emphasis>associations</emphasis> as types of <emphasis>classes</emphasis>, and <emphasis>references</emphasis> as types of <emphasis>properties</emphasis>.
pt_br: A especificação <emphasis>CIM</emphasis> descreve a linguagem, a nomeação e o meta-esquema. O meta-esquema é uma definição formal do modelo. Ele define os termos usados para expressar o modelo e seu uso e semântica. Os elementos do meta-esquema são <emphasis>classes</emphasis>, <emphasis>propriedades</emphasis> e <emphasis>métodos</emphasis>. O meta-esquema também suporta <emphasis>indicações</emphasis> e <emphasis>associações</emphasis> como tipos de <emphasis>classes</emphasis> e <emphasis>referências</emphasis> como tipos de <emphasis>propriedades</emphasis>.

source: The <emphasis>CIM Schema</emphasis> provides the actual model descriptions. It supplies a set of classes with properties and associations that provide a well understood conceptual framework within which it is possible to organize the available information about the managed environment.
pt_br: O esquema <emphasis>CIM</emphasis> fornece as descrições reais do modelo. Ele fornece um conjunto de classes com propriedades e associações que fornecem uma estrutura conceitual bem compreendida na qual é possível organizar as informações disponíveis sobre o ambiente gerenciado.

source: The Common Information Model Object Manager (CIMOM) is a CIM object manager or, more specifically, an application that manages objects according to the CIM standard. CIMOM manages communication between CIMOM providers and a CIM client, where the administrator manages the system.
pt_br: O Common Information Model Object Manager (CIMOM) é um gerenciador de objetos CIM ou, mais especificamente, um aplicativo que gerencia objetos de acordo com o padrão CIM. O CIMOM gerencia a comunicação entre os provedores CIMOM e um cliente CIM, em que o administrador gerencia o sistema.

source: <emphasis>CIMOM providers</emphasis> are software performing specific tasks within the CIMOM that are requested by client applications. Each provider instruments one or more aspects of the CIMOM's schema. These providers interact directly with the hardware.
pt_br: Os <emphasis>fornecedores CIMOM</emphasis> são softwares que executam tarefas específicas no CIMOM solicitadas pelos aplicativos clientes. Cada provedor instrumenta um ou mais aspectos do esquema do CIMOM. Esses provedores interagem diretamente com o hardware.

source: <emphasis>Standards Based Linux Instrumentation for Manageability (SBLIM)</emphasis> is a collection of tools designed to support Web-Based Enterprise Management (WBEM). SUSE® Linux Enterprise Server uses the open source CIMOM (or CIM server) from the SBLIM project called <emphasis>Small Footprint CIM Broker</emphasis> .
pt_br: A <emphasis>Instrumentação Linux para Gerenciamento Baseada em Padrões (SBLIM)</emphasis> é uma coleção de ferramentas projetadas para oferecer suporte ao Gerenciamento Empresarial Baseado na Web (WBEM). O SUSE® Linux Enterprise Server usa o CIMOM de código aberto (ou servidor CIM) do projeto SBLIM chamado <emphasis>Small Footprint CIM Broker</emphasis>.

source: <emphasis>Small Footprint CIM Broker</emphasis> is a CIM server intended for use in resource-limited or embedded environments. It is designed to be modular and lightweight at the same time. Its based on open standards and it supports CMPI providers, CIM-XML encoding, and <emphasis>Managed Object Format (MOF)</emphasis>. It is highly configurable and performs stability even if the provider crashes. It is also easily accessible as it supports various transport protocols, such as HTTP, HTTPS, Unix domain sockets, Service Location Protocol (SLP), and Java Database Connectivity (JDBC).
pt_br: O <emphasis>Small Footprint CIM Broker</emphasis> é um servidor CIM destinado ao uso em ambientes incorporados ou limitados por recursos. Ele foi projetado para ser modular e leve ao mesmo tempo. É baseado em padrões abertos e suporta provedores CMPI, codificação CIM-XML e <emphasis>Managed Object Format (MOF)</emphasis>. É altamente configurável e executa estabilidade, mesmo se o provedor travar. Também é facilmente acessível, pois suporta vários protocolos de transporte, como HTTP, HTTPS, soquetes de domínio Unix, SLP (Service Location Protocol) e Java Database Connectivity (JDBC).

source: Setting Up SFCB
pt_br: Configurando o SFCB

source: To set up the Small Footprint CIM Broker (SFCB) environment, make sure the <guimenu>Web-Based Enterprise Management</guimenu> pattern in YaST is selected during <phrase role="productname"><phrase os="osuse">openSUSE Leap</phrase><phrase os="sles">SUSE Linux Enterprise Server</phrase><phrase os="sled">SUSE Linux Enterprise Desktop</phrase></phrase> installation. Alternatively, select it as a component to install on a server that is already running. Make sure the following packages are installed on your system:
pt_br: Para configurar o ambiente Small Footprint CIM Broker (SFCB), verifique se o padrão <guimenu>Gerenciamento corporativo baseado na Web</guimenu> no YaST foi selecionado durante <phrase role="productname"> <phrase os="osuse">openSUSE Leap</phrase><phrase os="sles"> instalação do SUSE Linux Enterprise Server </phrase> <phrase os="sled"> instalação do SUSE Linux Enterprise Desktop </phrase></phrase>. Como alternativa, selecione-o como um componente para instalar em um servidor que já esteja em execução. Verifique se os seguintes pacotes estão instalados no seu sistema:

source: cim-schema, Common Information Model (CIM) Schema
pt_br: esquema cim, esquema do Modelo de informação comum (CIM)

source: Contains the Common Information Model (CIM). CIM is a model for describing overall management information in a network or enterprise environments. CIM consists of a specification and a schema. The specification defines the details for integration with other management models. The schema provides the actual model descriptions.
pt_br: Contém o CIM (Common Information Model). O CIM é um modelo para descrever informações gerais de gerenciamento em ambientes de rede ou corporativos. O CIM consiste em uma especificação e um esquema. A especificação define os detalhes para integração com outros modelos de gerenciamento. O esquema fornece as descrições reais do modelo.

source: Contains a Python module for making CIM operation calls through the WBEM protocol to query and update managed objects.
pt_br: Contém um módulo Python para fazer chamadas de operação CIM por meio do protocolo WBEM para consultar e atualizar objetos gerenciados.

source: cmpi-provider-register, CIMOM neutral provider registration utility
pt_br: cmpi-provider-register, utilitário de registro de provedor neutro CIMOM

source: Contains a utility allowing CMPI provider packages to register with whatever CIMOM happens to be present on the system.
pt_br: Contém um utilitário que permite que os pacotes do provedor CMPI se registrem no CIMOM que estiver presente no sistema.

source: Contains Small Footprint CIM Broker. It is a CIM server conforming to the CIM Operations over HTTP protocol. It is robust, with low resource consumption and, therefore, specifically suited for embedded and resource constrained environments. SFCB supports providers written against the Common Manageability Programming Interface (CMPI).
pt_br: Contém o Footprint CIM Broker. É um servidor CIM em conformidade com o protocolo CIM Operations over HTTP. É robusto, com baixo consumo de recursos e, portanto, adequado especificamente para ambientes incorporados e com recursos limitados. O SFCB oferece suporte a provedores criados com base na Common Manageability Programming Interface (CMPI).

source: Contains Small Footprint CIM Client library runtime libraries.
pt_br: Contém bibliotecas de tempo de execução da biblioteca do cliente Small Footprint CIM.

source: Contains WBEM command line interface. It is a stand-alone command line WBEM client especially suited for basic systems management tasks.
pt_br: Contém interface de linha de comando WBEM. É um cliente WBEM de linha de comando independente, especialmente adequado para tarefas básicas de gerenciamento de sistemas.

source: Starting, Stopping and Checking Status for SFCB
pt_br: Iniciando, parando e verificando o status do SFCB

source: CIM server sfcbd daemon is installed together with Web-Based Enterprise Management software and is started by default at system start-up. The following table explains how to start, stop and check status for sfcbd.
pt_br: O servidor CIM sfcbd daemon é instalado junto com o software Enterprise Management com base na Web e é iniciado por padrão na inicialização do sistema. A tabela a seguir explica como iniciar, parar e verificar o status do sfcbd.

source: Commands for Managing sfcbd
pt_br: Comandos para gerenciar sfcbd

source: Task
pt_br: Tarefa

source: Linux Command
pt_br: Comando Linux

source: Start sfcbd
pt_br: Iniciar sfcbd

source: Enter <command>systemctl start sfcb</command> as <systemitem class="username">root</systemitem> in the command line.
pt_br: Digite <command>systemctl start sfcb</command> como <systemitem class="username">root</systemitem> na linha de comandos.

source: Stop sfcbd
pt_br: Parar sfcbd

source: Enter <command>systemctl stop sfcb</command> as <systemitem class="username">root</systemitem> in the command line.
pt_br: Digite <command>systemctl stop sfcb</command> como <systemitem class="username">root</systemitem> na linha de comandos.

source: Check sfcbd status
pt_br: Verificar status do sfcbd

source: Enter <command>systemctl status sfcb</command>as <systemitem class="username">root</systemitem> in the command line.
pt_br: Digite <command>systemctl status sfcb</command> como <systemitem class="username">root</systemitem> na linha de comandos.

source: Ensuring Secure Access
pt_br: Garantindo acesso seguro

source: The default setup of SFCB is relatively secure. However, check that the access to SFCB components is as secure as required for your organization.
pt_br: A configuração padrão do SFCB é relativamente segura. No entanto, verifique se o acesso aos componentes SFCB é tão seguro quanto necessário para sua organização.

source: Certificates
pt_br: Certificados

source: Secure Socket Layers (SSL) transports require a certificate for secure communication to occur. When SFCB is installed, it has a self-signed certificate generated.
pt_br: O transporte Secure Socket Layers (SSL) exige um certificado para que a comunicação segura ocorra. Quando o SFCB é instalado, ele gera um certificado autoassinado.

source: You can replace the path to the default certificate with a path to a commercial or self-signed one by changing the <literal>sslCertificateFilePath: <replaceable>PATH_FILENAME</replaceable> </literal> setting in <filename>/etc/sfcb/sfcb.cfg</filename>. The file must be in PEM format.
pt_br: Você pode substituir o caminho para o certificado padrão por um comercial ou autoassinado, alterando a configuração <literal>sslCertificateFilePath: <replaceable>PATH_FILENAME</replaceable> </literal> em <filename>/etc/sfcb/sfcb.cfg</filename>. O arquivo deve estar no formato PEM.

source: The default generated server certificate is in the following location:
pt_br: O certificado do servidor gerado padrão está no seguinte local:

source: Paths to SSL Certificates
pt_br: Caminhos para Certificados SSL

source: The default generated certificate files <filename>servercert.pem</filename> and <filename> serverkey.pem</filename> are stored under <filename>/etc/ssl/servercerts</filename> directory. Files <filename>/etc/sfcb/client.pem</filename>, <filename>/etc/sfcb/file.pem</filename> and <filename>/etc/sfcb/server.pem</filename> are symbolic links to these files.
pt_br: Os arquivos de certificado gerados padrão <filename>servercert.pem</filename> e <filename>serverkey.pem</filename> são armazenados no diretório <filename>/etc/ssl/servercerts</filename>. Os arquivos <filename>/etc/sfcb/client.pem</filename>, <filename>/etc/sfcb/file.pem</filename> e <filename>/etc/sfcb/server.pem</filename> são links simbólicos para esses arquivos.

source: To generate a new certificate, enter the following command as <systemitem class="username">root</systemitem> in the command line:
pt_br: Para gerar um novo certificado, digite o seguinte comando como <systemitem class="username">root</systemitem> na linha de comandos:

source: <prompt>tux &gt; </prompt>sh /usr/share/sfcb/genSslCert.sh Generating SSL certificates in . Generating a 2048 bit RSA private key ...................................................................+++ .+++ writing new private key to '/var/tmp/sfcb.0Bjt69/key.pem' -----
pt_br: <prompt>tux &gt; </prompt>sh /usr/share/sfcb/genSslCert.sh Gerando certificados SSL em . Gerando uma chave privada RSA de 2048 bits ...................................................................+++ .+++ escrevendo nova chave privada em '/var/tmp/sfcb.0Bjt69/key.pem' -----

source: By default, the script generates certificates <filename>client.pem</filename> , <filename>file.pem</filename> and <filename>server.pem</filename> in the current working directory. If you want the script to generate the certificates in <filename>/etc/sfcb</filename> directory, you need to append it to the command. If these files already exist, a warning message is displayed and the old certificates are not overwritten.
pt_br: Por padrão, o script gera os certificados <filename>client.pem</filename>, <filename>file.pem</filename> e <filename>server.pem</filename> no diretório de trabalho atual. Se você deseja que o script gere os certificados no diretório <filename>/etc/sfcb</filename>, é necessário anexá-lo ao comando. Se esses arquivos já existirem, uma mensagem de aviso será exibida e os certificados antigos não serão substituídos.

source: <prompt>tux &gt; </prompt>sh /usr/share/sfcb/genSslCert.sh /etc/sfcb Generating SSL certificates in . WARNING: server.pem SSL Certificate file already exists. old file will be kept intact. WARNING: client.pem SSL Certificate trust store already exists. old file will be kept intact.
pt_br: <prompt>tux &gt; </prompt>sh /usr/share/sfcb/genSslCert.sh /etc/sfcb Gerando certificados SSL em. AVISO: o arquivo de certificado SSL server.pem já existe. o arquivo antigo será mantido intacto. AVISO: o armazenamento confiável do certificado SSL client.pem já existe. o arquivo antigo será mantido intacto.

source: You must remove the old certificates from the file system and run the command again.
pt_br: Você deve remover os certificados antigos do sistema de arquivos e executar o comando novamente.

source: To change the way SFCB uses certificates, see <xref linkend="sec.wbem.setting.secure.auth"/>.
pt_br: Para alterar a maneira como o SFCB usa certificados, consulte <xref linkend="sec.wbem.setting.secure.auth"/>.

source: By default, SFCB is configured to accept all communications through the secure port 5989. The following paragraphs explain the communication port setup and recommended configuration.
pt_br: Por padrão, o SFCB está configurado para aceitar todas as comunicações através da porta segura 5989. Os parágrafos a seguir explicam a instalação da porta de comunicação e a configuração recomendada.

source: Port 5989 (secure)
pt_br: Porta 5989 (segura)

source: The secure port that SFCB communications use via HTTPS services. This is the default. With this setting, all communications between the CIMOM and client applications are encrypted when sent over the Internet between servers and workstations. Users must authenticate with the client application to reach SFCB server. We recommend that you keep this setting. For the SFCB CIMOM to communicate with the necessary applications, this port must be open on routers and firewalls if they are present between the client application and the nodes being monitored.
pt_br: A porta segura que as comunicações SFCB usam através dos serviços HTTPS. Esse é o padrão. Com essa configuração, todas as comunicações entre o CIMOM e os aplicativos clientes são criptografadas quando enviadas pela Internet entre servidores e estações de trabalho. Os usuários devem se autenticar com o aplicativo cliente para acessar o servidor SFCB. Recomendamos que você mantenha essa configuração. Para que o SFCB CIMOM se comunique com os aplicativos necessários, essa porta deve estar aberta nos roteadores e firewalls se estiverem presentes entre o aplicativo cliente e os nós que estão sendo monitorados.

source: Port 5988 (insecure)
pt_br: Porta 5988 (não segura)

source: The insecure port that SFCB communications use via HTTP services. This setting is disabled by default. With this setting, all communications between the CIMOM and client applications are open for review when sent over the Internet between servers and workstations by anyone, without any authentication. We recommend that you use this setting only when attempting to debug a problem with the CIMOM. When the problem is resolved, disable the non-secure port option back. For the SFCB CIMOM to communicate with the necessary applications that require non-secure access, this port must be open in routers and firewalls between the client application and the nodes being monitored.
pt_br: A porta insegura que as comunicações SFCB usam via serviços HTTP. Esta configuração está desativada por padrão. Com essa configuração, todas as comunicações entre o CIMOM e os aplicativos clientes são abertas para revisão quando enviadas pela Internet entre servidores e estações de trabalho por qualquer pessoa, sem autenticação. Recomendamos que você use essa configuração apenas ao tentar depurar um problema com o CIMOM. Quando o problema for resolvido, desative a opção de porta não segura novamente. Para que o SFCB CIMOM se comunique com os aplicativos necessários que requerem acesso não seguro, essa porta deve estar aberta em roteadores e firewalls entre o aplicativo cliente e os nós que estão sendo monitorados.

source: To change the default port assignments, see <xref linkend="sec.wbem.setting.secure.ports"/>.
pt_br: Para alterar as atribuições de porta padrão, consulte <xref linkend="sec.wbem.setting.secure.ports"/>.

source: Authentication
pt_br: Autenticação

source: SFCB supports HTTP basic authentication and authentication based on client certificates (HTTP over SSL connections). Basic HTTP authentication is enabled by specifying <literal>doBasicAuth=true</literal> in the SFCB configuration file ( <filename>/etc/sfcb/sfcb.cfg</filename> by default). SUSE® Linux Enterprise Server installation of SFCB supports Pluggable Authentication Modules (PAM) approach; therefore the local root user can authenticate to the SFCB CIMOM with local root user credentials.
pt_br: O SFCB suporta autenticação básica HTTP e autenticação baseada em certificados de cliente (conexões HTTP sobre SSL). A autenticação HTTP básica é ativada especificando <literal>doBasicAuth=true</literal> no arquivo de configuração SFCB (<filename>/etc/sfcb/sfcb.cfg</filename> por padrão). A instalação do SUSE® Linux Enterprise Server do SUSE® Linux suporta a abordagem de Módulos de autenticação conectável (PAM); portanto, o usuário raiz local pode autenticar no SFCB CIMOM com credenciais de usuário raiz local.
