Repository: openSUSE/doc-sle-translations
Catalog: */po/adm_wbem.*.po
Languages: pt_br

source: If the <literal>sslClientCertificate</literal> configuration property is set to <literal>accept</literal> or <literal>require</literal>, the SFCB HTTP adapter will request a certificate from clients when connecting via HTTP over SSL (HTTPS). If <literal>require</literal> is specified, the client <emphasis role="bold">must</emphasis> provide a valid certificate (according to the client trust store specified via <literal>sslClientTrustStore</literal>). If the client fails to do so, the connection will be rejected by the CIM server.
pt_br: Se a propriedade de configuração <literal>sslClientCertificate</literal> estiver definida como <literal>accept</literal> ou <literal>require</literal>, o adaptador SFCB HTTP solicitará um certificado aos clientes ao conectar via HTTP sobre SSL (HTTPS). Se <literal>require</literal> for especificado, o cliente <emphasis role="bold"> deverá </emphasis> fornecer um certificado válido (de acordo com o armazenamento confiável do cliente especificado por meio de <literal>sslClientTrustStore</literal>). Se o cliente falhar, a conexão será rejeitada pelo servidor CIM.

source: The setting <literal>sslClientCertificate=accept</literal> may not be obvious. It is very useful if both basic and client certificate authentication are allowed. If the client can provide a valid certificate, HTTPS connection will be established and the basic authentication procedure will not be executed. If this function cannot verify the certificate, the HTTP basic authentication will take place instead.
pt_br: A configuração <literal>sslClientCertificate=accept</literal> pode não ser óbvia. É muito útil se a autenticação de certificado básico e de cliente for permitida. Se o cliente puder fornecer um certificado válido, a conexão HTTPS será estabelecida e o procedimento básico de autenticação não será executado. Se essa função não puder verificar o certificado, a autenticação básica HTTP ocorrerá.

source: SFCB CIMOM Configuration
pt_br: Configuração SFCB CIMOM

source: SFCB is a lightweight implementation of the CIM server, but it is also highly configurable. Several options can control its behavior. You can control the SFCB server in three ways:
pt_br: O SFCB é uma implementação leve do servidor CIM, mas também é altamente configurável. Várias opções podem controlar seu comportamento. Você pode controlar o servidor SFCB de três maneiras:

source: by setting appropriate environment variables
pt_br: configurando variáveis de ambiente apropriadas

source: by using command line options
pt_br: usando opções de linha de comando

source: by changing its configuration file
pt_br: alterando seu arquivo de configuração

source: Environment Variables
pt_br: Variáveis Do Ambiente

source: Several environment variables directly affect the behavior of SFCB. You need to restart the SFCB daemon by <command>systemctl restart sfcb</command> for these changes to take effect.
pt_br: Várias variáveis de ambiente afetam diretamente o comportamento do SFCB. Você precisa reiniciar o daemon SFCB por <command>systemctl restart sfcb</command> para que essas alterações tenham efeito.

source: Specifies the path to the <systemitem>sfcbd</systemitem> daemon and utilities.
pt_br: Especifica o caminho para o daemon e utilitários <systemitem>sfcbd</systemitem>.

source: Specifies the path to the sfcb runtime libraries. Alternatively, you can add this path to the system-wide dynamic loader configuration file <filename>/etc/ld.so.conf</filename> .
pt_br: Especifica o caminho para as bibliotecas de tempo de execução sfcb. Como alternativa, você pode adicionar esse caminho ao arquivo de configuração do carregador dinâmico em todo o sistema <filename>/etc/ld.so.conf</filename>.

source: Specifies the provider name. The SFCB server pauses after the provider is loaded for the first time. You can then attach a runtime debugger to the provider's process for debugging purposes.
pt_br: Especifica o nome do provedor. O servidor SFCB pausa após o carregamento do provedor pela primeira vez. Em seguida, você pode anexar um depurador de tempo de execução ao processo do provedor para fins de depuração.

source: Specifies the name of the SFCB codec (currently supports only <literal>http</literal>. The SFCB server pauses after the codec is loaded for the first time. You can then attach a runtime debugger to the process.
pt_br: Especifica o nome do codec SFCB (atualmente suporta apenas <literal> http </literal>. O servidor SFCB pausa após o carregamento do codec pela primeira vez. Você pode anexar um depurador de tempo de execução ao processo.

source: Specifies the level of debug messages for SFCB. Valid values are 0 (no debug messages), or 1 (key debug messages) to 4 (all debug messages). Default is 1.
pt_br: Especifica o nível de mensagens de depuração para SFCB. Os valores válidos são 0 (sem mensagens de depuração) ou 1 (principais mensagens de depuração) a 4 (todas as mensagens de depuração). O padrão é 1.

source: By default, SFCB outputs its debug messages to standard error output (STDERR). Setting this variable causes the debug messages to be written to a specified file instead.
pt_br: Por padrão, o SFCB envia suas mensagens de depuração para a saída de erro padrão (STDERR). Definir essa variável faz com que as mensagens de depuração sejam gravadas em um arquivo especificado.

source: Specifies the level of debug messages for SBLIM providers. Valid values are 0 (no debug messages), or 1 (key debug messages) to 4 (all debug messages).
pt_br: Especifica o nível de mensagens de depuração para provedores SBLIM. Os valores válidos são 0 (sem mensagens de depuração) ou 1 (principais mensagens de depuração) a 4 (todas as mensagens de depuração).

source: By default, SBLIM provider outputs its trace messages to STDERR. Setting this variable causes the trace messages to be written to a specified file instead.
pt_br: Por padrão, o provedor SBLIM envia suas mensagens de rastreio para STDERR. Definir essa variável faz com que as mensagens de rastreamento sejam gravadas em um arquivo especificado.

source: Command Line Options
pt_br: Opções de linha de comando

source: <systemitem>sfcbd</systemitem>, the SFCB daemon, has several command line options that switch particular runtime features on or off. Enter these options when SFCB daemon starts.
pt_br: <systemitem> sfcbd </systemitem>, o daemon SFCB, possui várias opções de linha de comando que ativam ou desativam determinados recursos de tempo de execução. Insira essas opções quando o daemon SFCB for iniciado.

source: <literal>-c, --config-file</literal>=<replaceable>FILE</replaceable>
pt_br: <literal>-c, --config-file</literal>=<replaceable>ARQUIVO</replaceable>

source: When SFCB daemon starts, it reads its configuration from <filename>/etc/sfcb/sfcb.cfg</filename> by default. With this option, you can specify an alternative configuration file.
pt_br: Quando o daemon SFCB é iniciado, ele lê sua configuração em <filename>/etc/sfcb/sfcb.cfg</filename> por padrão. Com esta opção, você pode especificar um arquivo de configuração alternativo.

source: Forces sfcbd and its child processes to run in the background.
pt_br: Força o sfcbd e seus processos filhos a serem executados em segundo plano.

source: Turns on runtime statistics collecting. Various sfcbd runtime statistics will be written to the <filename>sfcbStat</filename> file in the current working directory. By default, no statistics are collected.
pt_br: Ativa a coleta de estatísticas de tempo de execução. Várias estatísticas de tempo de execução sfcbd serão gravadas no arquivo <filename>sfcbStat</filename> no diretório de trabalho atual. Por padrão, nenhuma estatística é coletada.

source: Specifies the level of verbosity for the system logging facility. <replaceable>LOGLEVEL</replaceable> can be one of LOG_INFO, LOG_DEBUG, or LOG_ERR, which is the default.
pt_br: Especifica o nível de detalhamento do recurso de log do sistema. <replaceable>LOGLEVEL</replaceable> pode ser um dos LOG_INFO, LOG_DEBUG ou LOG_ERR, que é o padrão.

source: Prints trace output in a different color per process for easier debugging.
pt_br: Imprime a saída de rastreamento em uma cor diferente por processo para facilitar a depuração.

source: Activates component-level tracing messages, where <replaceable>NUM</replaceable> is an OR-ed bitmask integer that defines which component to trace. After you specify <option>-t ?</option>, it lists all the components and their associated integer bitmask:
pt_br: Ativa as mensagens de rastreamento no nível do componente, em que <replaceable>NUM</replaceable> é um número inteiro de máscara de bits com edição OR que define qual componente rastrear. Depois de especificar <option>-t?</option>, ele lista todos os componentes e sua máscara de bits inteira associada:

source: <prompt>tux &gt; </prompt>sfcbd -t ? --- Traceable Components: Int Hex --- providerMgr: 1 0x0000001 --- providerDrv: 2 0x0000002 --- cimxmlProc: 4 0x0000004 --- httpDaemon: 8 0x0000008 --- upCalls: 16 0x0000010 --- encCalls: 32 0x0000020 --- ProviderInstMgr: 64 0x0000040 --- providerAssocMgr: 128 0x0000080 --- providers: 256 0x0000100 --- indProvider: 512 0x0000200 --- internalProvider: 1024 0x0000400 --- objectImpl: 2048 0x0000800 --- xmlIn: 4096 0x0001000 --- xmlOut: 8192 0x0002000 --- sockets: 16384 0x0004000 --- memoryMgr: 32768 0x0008000 --- msgQueue: 65536 0x0010000 --- xmlParsing: 131072 0x0020000 --- responseTiming: 262144 0x0040000 --- dbpdaemon: 524288 0x0080000 --- slp: 1048576 0x0100000
pt_br: <prompt>tux &gt; </prompt>sfcbd -t ? --- Componentes Rastreáveis: Int Hex --- providerMgr: 1 0x0000001 --- providerDrv: 2 0x0000002 --- cimxmlProc: 4 0x0000004 --- httpDaemon: 8 0x0000008 --- upCalls: 16 0x0000010 --- encCalls: 32 0x0000020 --- ProviderInstMgr: 64 0x0000040 --- providerAssocMgr: 128 0x0000080 --- providers: 256 0x0000100 --- indProvider: 512 0x0000200 --- internalProvider: 1024 0x0000400 --- objectImpl: 2048 0x0000800 --- xmlIn: 4096 0x0001000 --- xmlOut: 8192 0x0002000 --- sockets: 16384 0x0004000 --- memoryMgr: 32768 0x0008000 --- msgQueue: 65536 0x0010000 --- xmlParsing: 131072 0x0020000 --- responseTiming: 262144 0x0040000 --- dbpdaemon: 524288 0x0080000 --- slp: 1048576 0x0100000

source: A useful value that reveals the internal functions of sfcbd but does not generate too many messages, is <option>-t</option> <replaceable>2019</replaceable>.
pt_br: Um valor útil que revela as funções internas do sfcbd, mas não gera muitas mensagens, é <option>-t</option><replaceable>2019</replaceable>.

source: SFCB Configuration File
pt_br: Arquivo de configuração SFCB

source: SFCB reads its runtime configuration from configuration file <filename>/etc/sfcb/sfcb.cfg</filename> after starting up. This behavior can be overridden using <option>-c</option> option at start-up.
pt_br: O SFCB lê sua configuração de tempo de execução no arquivo de configuração <filename>/etc/sfcb/sfcb.cfg</filename> após a inicialização. Esse comportamento pode ser substituído usando a opção <option> -c </option> na inicialização.

source: The configuration file contains <option>option</option> : <replaceable>VALUE</replaceable> pairs, one per line. When making changes to this file, you can use any text editor that saves the file in a format that is native to the environment you are using.
pt_br: O arquivo de configuração contém a opção <option>opção</option>: pares <replaceable>VALUE</replaceable>, um por linha. Ao fazer alterações nesse arquivo, você pode usar qualquer editor de texto que salve o arquivo em um formato nativo do ambiente em uso.

source: Any setting that has the options commented out with a number sign (#) uses the default setting.
pt_br: Qualquer configuração que tenha as opções comentadas com um sinal de número (#) usa a configuração padrão.

source: The following list of options may not be complete. See the content of <filename>/etc/sfcb/sfcb.cfg</filename> and <filename>/usr/share/doc/packages/sblim-sfcb/README</filename> for their complete list.
pt_br: A lista de opções a seguir pode não estar completa. Veja o conteúdo de </etc/sfcb/sfcb.cfg</filename> e <filename>/usr/share/doc/packages/sblim-sfcb/README</filename> para obter sua lista completa.

source: Purpose
pt_br: Objetivo

source: Specifies the local port value that sfcbd should listen to receive HTTP (insecure) requests from CIM clients. Default is <literal>5988</literal> .
pt_br: Especifica o valor da porta local que o sfcbd deve receber para receber solicitações HTTP (inseguras) de clientes CIM. O padrão é <literal> 5988 </literal>.

source: Syntax
pt_br: Sintaxe

source: Specifies whether SFCB should accept HTTP client connections. Default is <literal>false</literal> .
pt_br: Especifica se o SFCB deve aceitar conexões do cliente HTTP. O padrão é <literal>false</literal>.

source: <literal>enableHttp:</literal> <replaceable>OPTION</replaceable>
pt_br: <literal>enableHttp:</literal> <replaceable>OPÇÃO</replaceable>

source: Option
pt_br: Opção

source: Description
pt_br: Descrição

source: Enables HTTP connections.
pt_br: Habilita conexões HTTP.

source: Disables HTTP connections.
pt_br: Desativa conexões HTTP.

source: Specifies the maximum number of simultaneous HTTP client connections before new incoming HTTP requests are blocked. Default is <literal>8</literal> .
pt_br: Especifica o número máximo de conexões simultâneas do cliente HTTP antes que novas solicitações HTTP recebidas sejam bloqueadas. O padrão é <literal>8</literal>.

source: <literal>httpProcs:</literal> <replaceable>MAX_NUMBER_OF_CONNECTIONS</replaceable>
pt_br: <literal>httpProcs:</literal> <replaceable>MAX_NUM_DE_CONEXÕES</replaceable>

source: These options control what user the HTTP server will run under. If <option>httpUserSFCB</option> is <literal>true</literal>, HTTP will run under the same user as the SFCB main process. If it is <literal>false</literal> the user name specified for <option>httpUser</option> will be used. This setting is used for both HTTP and HTTPS servers. <option>httpUser</option> <emphasis>must</emphasis> be specified if <option>httpUserSFCB</option> is set to <literal>false</literal>. the default is <literal>true</literal>.
pt_br: Essas opções controlam em qual usuário o servidor HTTP será executado. Se <option>httpUserSFCB</option> for <literal>true /literal>, o HTTP será executado no mesmo usuário que o processo principal do SFCB. Se for <literal>false</literal>, o nome de usuário especificado para <option>httpUser</option> será usado. Essa configuração é usada para servidores HTTP e HTTPS. <option>httpUser</option> <emphasis>deve</emphasis> ser especificado se <option>httpUserSFCB</option> estiver definido como <literal>false</literal>. o padrão é <literal>true</literal>.

source: Specifies whether to limit HTTP requests to localhost only. Default is <literal>false</literal>.
pt_br: Especifica se as solicitações HTTP devem ser limitadas apenas ao host local. O padrão é <literal>false</literal>.

source: Specifies the local port value where sfcbd listens for HTTPS requests from CIM clients. Default is <literal>5989</literal> .
pt_br: Especifica o valor da porta local em que o sfcbd atende a solicitações HTTPS de clientes CIM. O padrão é <literal>5989</literal>.

source: Specifies if SFCB will accept HTTPS client connections. Default is <literal>true</literal> .
pt_br: Especifica se o SFCB aceitará conexões do cliente HTTPS. O padrão é <literal>true</literal>.

source: Enables HTTPS connections.
pt_br: Habilita conexões HTTPS.

source: Disables HTTPS connections.
pt_br: Desativa conexões HTTPS.

source: Specifies the maximum number of simultaneous HTTPS client connections before new incoming HTTPS requests are blocked. Default is <literal>8</literal> .
pt_br: Especifica o número máximo de conexões simultâneas do cliente HTTPS antes que as novas solicitações HTTPS recebidas sejam bloqueadas. O padrão é <literal>8</literal>.

source: Specifies if SFCB will provide the <emphasis>interop</emphasis> namespace for indication support. Default is <literal>true</literal> .
pt_br: Especifica se o SFCB fornecerá o espaço de nome <emphasis>interop</emphasis> para suporte à indicação. O padrão é <literal>true</literal>.

source: <literal>enableInterOp:</literal> <replaceable>OPTION</replaceable>
pt_br: <literal>enableInterOp:</literal> <replaceable>OPÇÃO</replaceable>

source: Enables interop namespace.
pt_br: Habilita o espaço para nome de interoperabilidade.

source: Disables interop namespace.
pt_br: Desativa o namespace de interoperabilidade.

source: Specifies the maximum number of simultaneous provider processes. After this point, if a new incoming request requires loading a new provider, then one of the existing providers will first be automatically unloaded. Default is <literal>32</literal> .
pt_br: Especifica o número máximo de processos simultâneos do provedor. Após esse ponto, se uma nova solicitação de entrada exigir o carregamento de um novo provedor, um dos fornecedores existentes será primeiro descarregado automaticamente. O padrão é <literal>32</literal>.

source: Switches basic authentication on or off based on the client user identifier before it accepts the request. Default value is <literal>true</literal> which means that basic client authentication is performed.
pt_br: Ativa ou desativa a autenticação básica com base no identificador de usuário do cliente antes de aceitar a solicitação. O valor padrão é <literal>true</literal>, o que significa que a autenticação básica do cliente é realizada.

source: <literal>doBasicAuth:</literal> <replaceable>OPTION</replaceable>
pt_br: <literal>doBasicAuth:</literal> <replaceable>OPÇÃO</replaceable>

source: Enables basic authentication.
pt_br: Habilita autenticação básica.

source: Disables basic authentication.
pt_br: Desabilita a autenticação básica.

source: Specifies the local library name. The SFCB server loads the library to authenticate the client user identifier. Default is <literal>sfcBasicPAMAuthentication</literal> .
pt_br: Especifica o nome da biblioteca local. O servidor SFCB carrega a biblioteca para autenticar o identificador de usuário do cliente. O padrão é <literal>sfcBasicPAMAuthentication</literal>.

source: This option switches the use of HTTP/HTTPS <quote>chunking</quote> on or off. If switched on, the server will return large volumes of response data to the client in smaller <quote>chunks</quote>, rather than buffer the data and send it back all in one chunk. Default is <literal>true</literal> .
pt_br: Esta opção ativa ou desativa o uso de HTTP/HTTPS <quote>chunking</quote>. Se ativado, o servidor retornará grandes volumes de dados de resposta ao cliente em <quote>pequenos pedaços</quote>, em vez de armazenar em buffer os dados e enviá-los de volta em um único pedaço. O padrão é <literal>true</literal>.

source: <literal>useChunking:</literal> <replaceable>OPTION</replaceable>
pt_br: <literal>useChunking:</literal> <replaceable>OPÇÃO</replaceable>

source: Enables HTTP/HTTPS data chunking.
pt_br: Permite chunking de dados HTTP/HTTPS.

source: Disables HTTP/HTTPS data chunking.
pt_br: Desativa a chunking de dados HTTP/HTTPS.

source: Specifies the maximum time in seconds that SFCB HTTP process waits between two requests on one connection before it terminates. Setting it to <literal>0</literal> disables HTTP keep-alive. Default is <literal>0</literal>.
pt_br: Especifica o tempo máximo em segundos que o processo HTTP SFCB aguarda entre duas solicitações em uma conexão antes de terminar. Definir como <literal>0</literal> desativa o HTTP keep-alive. O padrão é <literal>0</literal>.

source: Specifies the maximum number of consecutive requests on one connection. Setting it to <literal>0</literal> disables HTTP keep-alive. Default value is <literal>10</literal> .
pt_br: Especifica o número máximo de solicitações consecutivas em uma conexão. Definir como <literal>0</literal> desativa o HTTP keep-alive. O valor padrão é <literal>10</literal>.

source: Specifies the registration directory, which contains the provider registration data, the staging area, and the static repository. Default is <filename>/var/lib/sfcb/registration</filename> .
pt_br: Especifica o diretório de registro, que contém os dados de registro do provedor, a área de preparação e o repositório estático. O padrão é <filename>/var/lib/sfcb/registration</filename>.

source: Specifies a space-separated list of directories where SFCB is searching for provider libraries. Default is <filename>/usr/lib64 /usr/lib64 /usr/lib64/cmpi</filename>.
pt_br: Especifica uma lista de diretórios separados por espaço em que o SFCB está procurando bibliotecas de provedores. O padrão é <filename>/usr/lib64/usr/lib64/usr/lib64/cmpi</filename>.

source: Specifies the interval in seconds at which the provider manager is checking for idle providers. Default is <literal>30</literal>.
pt_br: Especifica o intervalo em segundos em que o gerenciador de provedores está procurando provedores inativos. O padrão é <literal>30</literal>.

source: Specifies the interval in seconds before an idle provider gets unloaded by the provider manager. Default is <literal>60</literal>.
pt_br: Especifica o intervalo em segundos antes de um provedor inativo ser descarregado pelo gerente do provedor. O padrão é <literal>60</literal>.

source: If the provider registration file does not specify any other group, and the option is set to <literal>true</literal>, all providers in the same shared library are executed in the same process.
pt_br: Se o arquivo de registro do provedor não especificar nenhum outro grupo e a opção estiver configurada como <literal>true</literal>, todos os provedores na mesma biblioteca compartilhada serão executados no mesmo processo.

source: <literal>providerAutoGroup:</literal> <replaceable>OPTION</replaceable>
pt_br: <literal>providerAutoGroup:</literal> <replaceable>OPÇÃO</replaceable>

source: Enables grouping of providers.
pt_br: Permite o agrupamento de fornecedores.

source: Disables grouping of providers.
pt_br: Desativa o agrupamento de fornecedores.

source: Specifies the name of the file that contains the server certificate. The file must be in PEM (Privacy Enhanced Mail, RFC 1421 and RFC 1424) format. This file is only required if <literal>enableHttps</literal> is set to <literal>true</literal>. Default is <filename>/etc/sfcb/server.pem</filename>.
pt_br: Especifica o nome do arquivo que contém o certificado do servidor. O arquivo deve estar no formato PEM (Privacy Enhanced Mail, RFC 1421 e RFC 1424). Este arquivo é necessário apenas se <literal>enableHttps</literal> estiver definido como <literal>true</literal>. O padrão é <filename>/etc/sfcb/server.pem</filename>.

source: <literal>sslCertificateFilePath:</literal> <replaceable>PATH</replaceable>
pt_br: <literal>sslCertificateFilePath:</literal> <replaceable>CAMINHO</replaceable>

source: Specifies the name of the file that contains the private key for the server certificate. The file must be in PEM format and may not be protected by passphrase. This file is only required if <literal>enableHttps</literal> is set to <literal>true</literal>. Default is <filename>/etc/sfcb/file.pem</filename>.
pt_br: Especifica o nome do arquivo que contém o certificado do servidor. O arquivo deve estar no formato PEM (Privacy Enhanced Mail, RFC 1421 e RFC 1424). Este arquivo é necessário apenas se <literal>enableHttps</literal> estiver definido como <literal>true</literal>. O padrão é <filename>/etc/sfcb/server.pem</filename>.

source: <literal>sslKeyFilePath:</literal> <replaceable>PATH</replaceable>
pt_br: <literal>sslKeyFilePath:</literal> <replaceable>CAMINHO</replaceable>
