Repository: openSUSE/doc-sle-translations
Catalog: */po/adm_shell.*.po
Languages: cs, pt, pt_br

source: Appends the output of the command to a file. For example, the <command>ls</command> command appends its output to the file <filename>listing.txt</filename>:
cs: Přidá výstup příkazu k souboru. Například příkaz <command>ls</command> připojí svůj výstup na konec souboru <filename>listing.txt</filename>:
pt: Acrescenta o output de um comando dentro de um ficheiro. No exemplo a seguir , o resultado do comando <command>ls</command> vai ser acrescentado ao fim do ficheiro <filename>listing.txt</filename>:
pt_br: Anexa a saída do comando a um arquivo. Por exemplo, o comando <command>ls</command> anexa sua saída ao arquivo <filename>Listing.txt</filename>:

source: <literal>Command &lt; File</literal>
cs: <literal>Příkaz &lt; Soubor</literal>
pt: <literal>Comando &lt; Ficheiro</literal>
pt_br: <literal>Comando &lt; Arquivo</literal>

source: Reads the file as input for the given command. For example, the <command>read</command> command reads in the content of the file into the variable:
cs: Přečte soubor jako vstup pro daný příkaz. Například příkaz <command>read</command> načte obsah souboru do proměnné:
pt: Lê o ficheiro como input para um comando. Por exemplo, o comando <command>read</command> lê o conteúdo de um ficheiro para uma variável:
pt_br: Lê o arquivo como entrada para o comando fornecido. Por exemplo, o comando <command>read</command> lê o conteúdo do arquivo na variável:

source: <literal>Command1 | Command2</literal>
cs: <literal>Příkaz1 | Příkaz2</literal>
pt: <literal>Comando1 | Comando2</literal>
pt_br: <literal>Comando1 | Comando2</literal>

source: Redirects the output of the left command as input for the right command. For example, the <command>cat</command> command outputs the content of the <filename>/proc/cpuinfo</filename> file. This output is used by <command>grep</command> to filter only those lines which contain <literal>cpu</literal>:
cs: Přesměruje výstup příkazu 1 na vstup příkazu 2. Například příkaz <command>cat</command> vypíše obsah souboru <filename>/proc/cpuinfo</filename>. Tento výstup použije příkaz <command>grep</command> k výběru pouze řádků obsahujících <literal>cpu</literal>:
pt: Redireciona o output do comando na esquerda como input do comando da direita. No exemplo a seguir, o comando <command>cat</command> faz output do conteúdo presente no ficheiro <filename>/proc/cpuinfo</filename>. O output é depois utilizado pelo comando <command>grep</command> para filtrar por apenas as linhas que contêm a palavra <literal>cpu</literal>:
pt_br: Redireciona a saída do comando esquerdo como entrada para o comando direito. Por exemplo, o comando <command>cat</command> gera o conteúdo do arquivo <filename>/proc/cpuinfo</filename>. Esta saída é usada pelo <command>grep</command> para filtrar apenas as linhas que contêm <literal>cpu</literal>:

source: Every channel has a <emphasis>file descriptor</emphasis>: 0 (zero) for standard input, 1 for standard output and 2 for standard error. It is allowed to insert this file descriptor before a <literal>&lt;</literal> or <literal>&gt;</literal> character. For example, the following line searches for a file starting with <filename>foo</filename>, but suppresses its errors by redirecting it to <filename>/dev/null</filename>:
cs: Každý kanál má <emphasis>popisovač souboru</emphasis>: 0 (nula) - standardní vstup, 1 - standarcní výstup, 2 - standardní hlášení chyb. Je možno vložit popisovač souboru před znak <literal>&lt;</literal> nebo <literal>&gt;</literal>. Například tento řádek hledá soubory s názvy začínajícími <filename>foo</filename>, ale potlačí chybová hlášení jejich přesměrováním na <filename>/dev/null</filename>:
pt: Cada canal tem um <emphasis>descritor de ficheiro</emphasis>: 0 (zero) para input padrão, 1 para output padrão e 2 para erro padrão. É permitido inserir o descritor de ficheiro antes dos caracteres <literal>&lt;</literal> ou <literal>&gt;</literal>. No exemplo a seguir, a linha procura por um ficheiro começado por <filename>foo</filename>, mas suprime os erros ao redireciona-los para <filename>/dev/null</filename>:
pt_br: Todo canal possui um <emphasis>descritor de arquivos</emphasis>: 0 (zero) para entrada padrão, 1 para saída padrão e 2 para erro padrão. É permitido inserir esse descritor de arquivo antes de um caracter <literal>&lt;</literal> ou caracter <literal>&gt;</literal>. Por exemplo, a linha a seguir procura um arquivo começando com <filename>foo</filename>, mas suprime seus erros redirecionando-o para <filename>/dev/null</filename>:

source: Using Aliases
cs: Použití aliasů
pt: Utilizando Pseudónimos
pt_br: Usando aliases

source: An alias is a shortcut definition of one or more commands. The syntax for an alias is:
cs: Alias je definice zkratky jednoho nebo více příkazů. Syntaxe pro alias je tato:
pt: Um pseudónimo é um atalho definido por um ou mais comandos. A sintaxe para um é a seguinte:
pt_br: Um alias é uma definição de atalho de um ou mais comandos. A sintaxe para um alias é:

source: alias <replaceable>NAME</replaceable>=<replaceable>DEFINITION</replaceable>
cs: alias <replaceable>NÁZEV</replaceable>=<replaceable>DEFINICE</replaceable>
pt: alias<replaceable>NOME</replaceable>=<replaceable>Definição</replaceable>

source: For example, the following line defines an alias <command>lt</command> that outputs a long listing (option <option>-l</option>), sorts it by modification time (<option>-t</option>), and prints it in reverse sorted order (<option>-r</option>):
cs: Například následující řádek definuje alias <command>lt</command>, který vypíše dluhý seznam (volbou <option>-l</option>), seřadí ho podle času modifikace (<option>-t</option>) a vypíše ho v opačném řazení (<option>-r</option>):
pt: Por exemplo, a seguinte linha define um alias de nome <command>lt</command> que faz output de uma longa listagem (<option>-l</option>), ordena-a pela data de modificação (<option>-t</option>), e imprime-a por ordem inversa (<option>-r</option>):
pt_br: Por exemplo, a linha a seguir define um alias <command>lt</command> que gera uma listagem longa (opção <option> -l </option>), classifica-a pelo tempo de modificação (<option> -t </option> ) e imprime na ordem inversa de classificação (<option> -r </option>):

source: To view all alias definitions, use <command>alias</command>. Remove your alias with <command>unalias</command> and the corresponding alias name.
cs: Všechny definované aliasy vypíše příkaz <command>alias</command>. Alias odstraníte příkazem <command>unalias</command> a názvem aliasu.
pt: Para ver todas as definições dos pseudónimos, utilize o comando <command>alias</command>. Para remover um pseudónimo insira o comando <command>unalias</command> em conjunto com o nome correspondente do pseudónimo que deseja eliminar.
pt_br: Para visualizar todas as definições de alias, use <command>alias</command>. Remova seu alias com <command>unalias</command> e o nome do alias correspondente.

source: Using Variables in Bash
cs: Použití proměnných v Bash
pt: Utilizando Variáveis no Bash
pt_br: Usando variáveis no Bash

source: A shell variable can be global or local. Global variables, or environment variables, can be accessed in all shells. In contrast, local variables are visible in the current shell only.
cs: Proměnná prostředí může být globální nebo lokální. Globální proměnné, čili proměnné prostředí, jsou dostupné ve všech shellech. Naopak lokální proměnné jsou viditelné pouze v aktuálním shellu.
pt: Uma variável de shell pode ser global ou local. Variáveis globais, ou variáveis de ambiente, podem ser acedidas por todas as shells. No entanto, variáveis locais apenas são visíveis à shell atual.
pt_br: Uma variável de shell pode ser global ou local. Variáveis globais ou variáveis de ambiente podem ser acessadas em todos os shells. Por outro lado, as variáveis locais são visíveis apenas no shell atual.

source: To view all environment variables, use the <command>printenv</command> command. If you need to know the value of a variable, insert the name of your variable as an argument:
cs: Ke zobrazení všech proměnných prostředí použijte příkaz <command>printenv</command>. Hodnotu jedné proměnné zobrazíte zadáním jejího názvu do argumentu:
pt: Para visualizar todas as variáveis de ambiente, utilize o comando <command>printenv</command>. Se desejar saber o valor de uma variável, insira o nome da mesma como argumento para o comando:
pt_br: Para visualizar todas as variáveis de ambiente, use o comando <command>printenv</command>. Se você precisar conhecer o valor de uma variável, insira o nome da sua variável como argumento:

source: A variable, be it global or local, can also be viewed with <command>echo</command>:
cs: Proměnnou, ať globální či lokální, lze též zobrazit příkazem <command>echo</command>:
pt: Uma variável, independentemente de ser global ou local, pode também ser visualizada com o comando <command>echo</command>:
pt_br: Uma variável, global ou local, também pode ser visualizada com <command>echo</command>:

source: To set a local variable, use a variable name followed by the equal sign, followed by the value:
cs: K nastavení hodnoty lokální proměnné použijte její název, rovnítko a hodnotu:
pt: Para definir uma variável local, use o nome da variável seguido do sinal de igual, seguido do valor:
pt_br: Para definir uma variável local, use um nome de variável seguido pelo sinal de igual, seguido pelo valor:

source: <prompt>tux &gt; </prompt>PROJECT="SLED"
cs: <prompt>tux &gt; </prompt>PROJECT="SLEĎ"

source: Do not insert spaces around the equal sign, otherwise you get an error. To set an environment variable, use <command>export</command>:
cs: Okolo rovnítka nevkládejte mezery, jinak se ohlásí chyba. Pro nastavení proměnné prostředí (tedy globální) použijte příkaz <command>export</command>:
pt: Não insira espaços entre o símbolo igual, caso contrário receberá um erro. Poderá definir uma variável de ambiente , utilizando o comando <command>export</command>:
pt_br: Não insira espaços ao redor do sinal de igual, caso contrário, você receberá um erro. Para definir uma variável de ambiente, use <command>export</command>:

source: To remove a variable, use <command>unset</command>:
cs: K odstranění proměnné použijte příkaz <command>unset</command>:
pt: Para remover uma variável, utilize o comando <command>unset</command>:
pt_br: Para remover uma variável, use <command>unset</command>:

source: The following table contains some common environment variables which can be used in you shell scripts:
cs: Následující tabulka obsahuje některé běžné proměnné prostředí použitelné ve skriptech pro shell:
pt: A tabela seguinte contêm algumas variáveis de ambiente comuns que podem ser utilizadas nos seus shell scripts:
pt_br: A tabela a seguir contém algumas variáveis de ambiente comuns que podem ser usadas nos scripts de shell:

source: Useful Environment Variables
cs: Užitečné proměnné prostředí (globální)
pt: Variáveis de Ambiente Úteis
pt_br: Variáveis de ambiente úteis

source: the home directory of the current user
cs: domovský adresář aktuálně přihlášeného uživatele
pt: a diretoria home(a pasta pessoal) do utilizador atual
pt_br: o diretório inicial do usuário atual

source: the current host name
cs: aktuální název počítače v síti
pt: o nome de host atual
pt_br: o nome do host atual

source: when a tool is localized, it uses the language from this environment variable. English can also be set to <literal>C</literal>
cs: je-li nástroj lokalizován, používá jazyk z této proměnné prostředí; angličtinu lze také nastavit na <literal>C</literal>
pt: quando uma ferramenta fornece traduções noutras línguas, a mesma escolhe a linguagem baseada no valor desta variável de ambiente. Inglês pode também ser definida para <literal>C</literal>
pt_br: quando uma ferramenta é localizada, ela usa o idioma dessa variável de ambiente. O inglês também pode ser definido como <literal>C</literal>

source: the search path of the shell, a list of directories separated by colon
cs: hledací cesta shellu - seznam adresářů oddělených dvojtečkami
pt: o caminho de pesquisa da shell, uma lista de diretorias separadas por dois pontos
pt_br: o caminho de pesquisa do shell, uma lista de diretórios separados por dois pontos

source: specifies the normal prompt printed before each command
cs: udává normální výzvu tištěnou před každým příkazem (končívá &gt;)
pt: especifica o texto/símbolo utilizado para representar a prontidão do sistema para executar o próximo comando (prompt) normal impresso antes de cada comando
pt_br: especifica o prompt normal impresso antes de cada comando

source: specifies the secondary prompt printed when you execute a multi-line command
cs: udává druhotnou výzvu tištěnou, když zadáváte víceřádkový příkaz
pt: especifica o prompt secundário utilizado para executar comandos de múltiplas linhas
pt_br: especifica o prompt secundário impresso quando você executa um comando de várias linhas

source: current working directory
cs: aktuální pracovní adresář
pt: diretoria atual onde a shell se encontra
pt_br: diretório de trabalho atual

source: the current user
cs: aktuálně přihlášený uživatel
pt: o utilizador atual
pt_br: o usuário atual

source: Using Argument Variables
cs: Použití proměnných v argumentu
pt: Utilizando Variáveis de Argumento
pt_br: Usando variáveis de argumento

source: For example, if you have the script <command>foo.sh</command> you can execute it like this:
cs: Máte-li například skript <command>foo.sh</command>, můžete ho spustit takto:
pt: Por exemplo, se tiver um script <command>foo.sh</command> pode executá-lo da seguinte maneira:
pt_br: Por exemplo, se você tiver o script <command>foo.sh</command>, poderá executá-lo assim:

source: <prompt>tux &gt; </prompt>foo.sh "Tux Penguin" 2000
cs: <prompt>tux &gt; </prompt>foo.sh "Tučňák Tux" 2000

source: To access all the arguments which are passed to your script, you need positional parameters. These are <envar>$1</envar> for the first argument, <envar>$2</envar> for the second, and so on. You can have up to nine parameters. To get the script name, use <envar>$0</envar>.
cs: Pro přístup ke všem argumentům, které jsou předávány skriptu, potřebujete poziční parametry. Je to <envar>$1</envar> pro první argument, <envar>$2</envar> pro druhý, atd. - můžete mít až devět parametrů. Chcete-li jako argument získat název skriptu, použijte <envar>$0</envar>.
pt: Para aceder aos argumentos que são passados ao seu script, necessita de utilizar argumentos posicionais. Estes são <envar>$1</envar> para o primeiro argumento, <envar>$2</envar> para o segundo, e assim adiante. Pode definir até nove argumentos. Para aceder ao nome do script, utilize o argumento <envar>$0</envar>.
pt_br: Para acessar todos os argumentos passados para o seu script, você precisa de parâmetros posicionais. Estes são <envar>$1</envar> para o primeiro argumento, <envar>$2</envar> para o segundo e assim por diante. Você pode ter até nove parâmetros. Para obter o nome do script, use <envar>$0</envar>.

source: The following script <command>foo.sh</command> prints all arguments from 1 to 4:
cs: Tento skript, <command>foo.sh</command>, tiskne své argumenty číslo 1 až 4:
pt: O seguinte script <command>foo.sh</command> imprime todos os argumentos de 1 a 4:
pt_br: O script a seguir <command>foo.sh</command> imprime todos os argumentos de 1 a 4:

source: If you execute this script with the above arguments, you get:
cs: Provedete-li tento skript s uvedenými argumenty, vypíše se:
pt: Se executar este script com os argumentos acima mencionados, você obtém:
pt_br: Se você executar este script com os argumentos acima, obtém:

source: "Tux Penguin" "2000" "" ""
cs: "Tučňák Tux" "2000" "" ""

source: Using Variable Substitution
cs: Použití substituce proměnných
pt: Utilizando Substituição de Variáveis
pt_br: Usando substituição variável

source: Variable substitutions apply a pattern to the content of a variable either from the left or right side. The following list contains the possible syntax forms:
cs: Substituce proměnných aplikují na obsah proměnné vzorek, a to buď z levé nebo pravé strany. Následující seznam obsahuje možné tvary syntaxe:
pt: Substituição de variáveis aplica um padrão no contexto de uma variável ou pelo lado esquerdo ou direito. A lista seguinte contêm as sintaxes possíveis:
pt_br: As substituições de variáveis aplicam um padrão ao conteúdo de uma variável, do lado esquerdo ou direito. A lista a seguir contém os possíveis formulários de sintaxe:

source: <literal>${VAR#pattern}</literal>
cs: <literal>${PROMĚNNÁ#vzorek}</literal>
pt: <literal>${VAR#padrão}</literal>

source: removes the shortest possible match from the left:
cs: odstraní nejkratší možný výskyt vzorku zleva:
pt: remove a correspondência mais curta possível da esquerda:
pt_br: remove a correspondência mais curta possível da esquerda:

source: <literal>${VAR##pattern}</literal>
cs: <literal>${PROMĚNNÁ##vzorek}</literal>
pt: <literal>${VAR##padrão}</literal>

source: removes the longest possible match from the left:
cs: odstraní nejdelší možný výskyt vzorku zleva:
pt: remove a correspondência mais longa possível da esquerda:
pt_br: remove a correspondência mais longa possível da esquerda:

source: <literal>${VAR%pattern}</literal>
cs: <literal>${PROMĚNNÁ%vzorek}</literal>
pt: <literal>${VAR%padrão}</literal>

source: removes the shortest possible match from the right:
cs: odstraní nejkratší možný výskyt vzorku zprava:
pt: remove a correspondência mais curta possível da direita:
pt_br: remove a correspondência mais curta possível da direita:

source: <literal>${VAR%%pattern}</literal>
cs: <literal>${PROMĚNNÁ%%vzorek}</literal>
pt: <literal>${VAR%%padrão}</literal>

source: removes the longest possible match from the right:
cs: odstraní nejdelší možný výskyt vzorku zprava:
pt: remove a correspondência mais longa possível da direita:
pt_br: remove a correspondência mais longa possível da direita:

source: <literal>${VAR/pattern_1/pattern_2}</literal>
cs: <literal>${PROMĚNNÁ/vzorek_1/vzorek_2}</literal>
pt: <literal>${VAR/padrão_1/padrão_2}</literal>

source: substitutes the content of <replaceable>VAR</replaceable> from the <replaceable>PATTERN_1</replaceable> with <replaceable>PATTERN_2</replaceable>:
cs: nahradí obsah <replaceable>PROMĚNNÉ</replaceable> - namísto <replaceable>VZOREK_1</replaceable> dá <replaceable>VZOREK_2</replaceable>:
pt: substitui o conteúdo de <replaceable>VAR</replaceable> do <replaceable>PADRÃO_1</replaceable> com <replaceable>PADRÃO_2</replaceable>:
pt_br: substitui o conteúdo de <replaceable>VAR</replaceable> do <replaceable>PATTERN_1</replaceable> por <replaceable>PATTERN_2</replaceable>:

source: Grouping and Combining Commands
cs: Seskupování a kombinování příkazů
pt: Agrupar e Combinar Comandos
pt_br: Agrupando e combinando comandos

source: Shells allow you to concatenate and group commands for conditional execution. Each command returns an exit code which determines the success or failure of its operation. If it is 0 (zero) the command was successful, everything else marks an error which is specific to the command.
cs: Shell vám umožní zřetězit a seskupit příkazy pro podmíněné provedení. Každý příkaz vrací návratový (výstupní) kód, který určuje úspěch nebo selhání své činnosti. Pokud je návratový kód 0 (nula), příkaz byl úspěšný, všechno ostatní znamená chybu, která je pro každý příkaz specifická.
pt: As shells permitem-lhe concatenar e agrupar comandos para execução condicional. Cada comando retorna um código de saída que determina o sucesso ou falha da sua operação. Se devolver um 0 (zero) o comando correu com sucesso, se devolver qualquer outro significa um determinado tipo de erro que é específico para o comando em questão.
pt_br: Os shells permitem concatenar e agrupar comandos para execução condicional. Cada comando retorna um código de saída que determina o sucesso ou falha de sua operação. Se for 0 (zero), o comando foi bem-sucedido, tudo o resto marca um erro específico para o comando.

source: The following list shows, how commands can be grouped:
cs: Tento seznam ukazuje, jak lze příkazy seskupit:
pt: A seguinte lista mostra-lhe, como os comandos podem ser agrupados:
pt_br: A lista a seguir mostra como os comandos podem ser agrupados:

source: <literal>Command1 ; Command2</literal>
cs: <literal>Příkaz1 ; Příkaz2</literal>
pt: <literal>Comando1 ; Comando2</literal>
pt_br: <literal>Comando1; Comando2</literal>

source: executes the commands in sequential order. The exit code is not checked. The following line displays the content of the file with <command>cat</command> and then prints its file properties with <command>ls</command> regardless of their exit codes:
cs: provede příkazy postupně, návratový kód se nekontroluje. Další řádek ukazuje obsah souboru příkazem <command>cat</command> a pak vypíše vlastnosti toho souboru příkazem <command>ls</command> nehledě na jeho návratové kódy:
pt: executa os comandos em ordem sequencial. O código de saída não é verificado. A seguinte linha mostra o conteúdo do ficheiro com o comando <command>cat</command> e imprime as propriedades do ficheiro com o comando <command>ls</command> independentemente dos códigos de saída:
pt_br: executa os comandos em ordem sequencial. O código de saída não está marcado. A linha a seguir exibe o conteúdo do arquivo com <command>cat</command> e depois imprime suas propriedades com <command>ls</command>, independentemente de seus códigos de saída:

source: <literal>Command1 &amp;&amp; Command2</literal>
cs: <literal>Příkaz1 &amp;&amp; Příkaz2</literal>
pt: <literal>Comando1 &amp;&amp; Comando2</literal>

source: runs the right command, if the left command was successful (logical AND). The following line displays the content of the file and prints its file properties only, when the previous command was successful (compare it with the previous entry in this list):
cs: spustí druhý příkaz, pokud byl první příkaz úspěšný (logické AND/A). Následující řádek zobrazuje obsah souboru a vytiskne jeho vlastnosti pouze v případě, že předchozí příkaz byl úspěšný (porovnejte s předchozí položkou tohoto seznamu):
pt: corre o comando da direita, se o comando da esquerda correr com sucesso (lógico E). A seguinte linha mostra o conteúdo do ficheiro e imprime as propriedades do mesmo apenas, quando o comando anterior é bem sucedido (isto é compara o código de saída do primeiro comando e se for bem sucedido executa o segundo):
pt_br: executa o comando da direita, se o comando esquerdo tiver sido bem-sucedido (AND lógico). A linha a seguir exibe o conteúdo do arquivo e imprime apenas suas propriedades, quando o comando anterior foi bem-sucedido (compare-o com a entrada anterior nesta lista):

source: <literal>Command1 || Command2</literal>
cs: <literal>Příkaz1 || Příkaz2</literal>
pt: <literal>Comando1 || Comando2</literal>
pt_br: <literal>Comand1 || Comando2</literal>

source: runs the right command, when the left command has failed (logical OR). The following line creates only a directory in <filename>/home/wilber/bar</filename> when the creation of the directory in <filename>/home/tux/foo</filename> has failed:
cs: spustí Příkaz2, když Příkaz1 selhal (logické OR/NEBO). Následující řádek vytvoří adresář v <filename>/home/wilber/bar</filename>, jen když vytvoření adresáře v <filename>/home/tux/foo</filename> selhalo:
pt: corre o comando da direita, quando o comando da esquerda falha (lógico OU). A seguinte linha cria apenas uma diretoria em <filename>/home/wilber/bar</filename> quando a criação de uma diretoria em <filename>/home/tux/foo</filename> falha:
pt_br: executa o comando da direita, quando o comando esquerdo falhar (OR lógico). A linha a seguir cria apenas um diretório em <filename>/home/wilber/bar</filename> quando a criação do diretório em <filename>/home/tux/foo</filename> falhou:
