Repository: openSUSE/doc-sle-translations
Catalog: */po/adm_sudo.*.po
Languages: cs, pt_br

source: To use X.Org in applications started with <command>sudo</command>, the environment variables <envar>DISPLAY</envar> and <envar>XAUTHORITY</envar> need to be propagated. To configure this, create the file <filename>/etc/sudoers.d/xorg</filename>, (see <xref linkend="sec.sudo.conf.edit"/>) and add the following line:
cs: Chcete-li použít X.Org v aplikacích spuštěných příkazem <command>sudo</command>, je třeba přenést proměnné prostředí <envar>DISPLAY</envar> a <envar>XAUTHORITY</envar>. Chcete-li to nakonfigurovat, vytvořte soubor <filename>/etc/sudoers.d/xorg</filename> (viz <xref linkend="sec.sudo.conf.edit"/>) a přidejte následující řádek:
pt_br: Para usar o X.Org em aplicativos iniciados com <command>sudo</command>, as variáveis de ambiente <envar>DISPLAY</envar> e <envar>XAUTHORITY</envar> precisam ser propagadas. Para configurar isso, crie o arquivo <nome do arquivo>/etc/sudoers.d/xorg</filename>, (consulte <xref linkend="sec.sudo.conf.edit"/>) e adicione a seguinte linha:

source: If not set already, set the <envar>XAUTHORITY</envar> variable as follows:
cs: Nastavte proměnnou <envar>XAUTHORITY</envar> (pokud již není nastavena) takto:
pt_br: Se ainda não estiver definido, defina a variável <envar>XAUTHORITY</envar> da seguinte maneira:

source: Now X.Org applications can be run as usual:
cs: Nyní lze spustit aplikace X.Org jako obvykle:
pt_br: Agora os aplicativos X.Org podem ser executados como de costume:

source: More Information
cs: Další informace
pt_br: Mais Informações

source: A quick overview about the available command line switches can be retrieved by <command>sudo --help</command>. An explanation and other important information can be found in the man page: <command>man 8 sudo</command>, while the configuration is documented in <command>man 5 sudoers</command>.
cs: Rychlý přehled dostupných přepínačů příkazového řádku lze získat příkazem <command>sudo --help</command>. Vysvětlení a další důležité informace lze nalézt na stránce manuálu: <command>man 8 sudo</command>. Konfigurace je dokumentována v <command>man 5 sudoers</command>.
pt_br: Uma rápida visão geral sobre as opções de linha de comando disponíveis pode ser recuperada por <command>sudo --help</command>. Uma explicação e outras informações importantes podem ser encontradas na página de manual: <command>man 8 sudo</command>, enquanto a configuração está documentada em <command>man 5 sudoers</command>.
