Repository: openSUSE/doc-sle-translations
Catalog: */po/apache2_yast_i.*.po
Languages: cs, pt_br

# _
source: translator-credits
cs: překladatelské kredity alkas alkas@volny.cz, 2016, 2020
pt_br: tradutor-créditos

source: Configuring Apache with YaST
cs: Konfigurace Apache pomocí YaST
pt_br: Configurando o Apache com o YaST

source: yes
cs: ano
pt_br: sim

source: To configure your Web server with YaST, start YaST and select <menuchoice> <guimenu>Network Services</guimenu> <guimenu>HTTP Server</guimenu> </menuchoice>. When starting the module for the first time, the <guimenu>HTTP Server Wizard</guimenu> starts, prompting you to make a few basic decisions concerning administration of the server. After having finished the wizard, the <guimenu>HTTP Server Configuration</guimenu> dialog starts each time you call the <guimenu>HTTP Server</guimenu> module. For more information, see <xref linkend="sec.apache2.configuration.yast.server_configuration"/>.
cs: Chcete-li konfigurovat svůj webový server pomocí programu YaST, spusťte program YaST a vyberte <menuchoice><guimenu>Síťové služby</guimenu><guimenu>HTTP server</guimenu></menuchoice>. Při prvním spuštění modulu se spustí <guimenu>Průvodce serverem HTTP</guimenu>, který vás vyzve k provedení několika základních rozhodnutí týkajících se správy serveru. Po dokončení průvodce se dialogové okno <guimenu>Konfigurace serveru HTTP</guimenu> spustí při každém volání modulu <guimenu>HTTP Server</guimenu>. Další informace viz <xref linkend="sec.apache2.configuration.yast.server_configuration"/>.
pt_br: Para configurar seu servidor Web com o YaST, inicie o YaST e selecione <menuchoice><guimenu>Serviços de Rede</guimenu><guimenu>Servidor HTTP</guimenu></menuchoice>. Ao iniciar o módulo pela primeira vez, o <guimenu>Assistente para Servidor HTTP</guimenu> é iniciado, solicitando que você tome algumas decisões básicas sobre a administração do servidor. Após a conclusão do assistente, a caixa de diálogo <guimenu>Configuração do servidor HTTP</guimenu> é iniciada sempre que você chama o módulo <guimenu>Servidor HTTP<guimenu></guimenu>. Para obter mais informações, consulte <xref linkend="sec.apache2.configuration.yast.server_configuration"/>.

source: HTTP Server Wizard
cs: Průvodce HTTP serverem
pt_br: Assistente de servidor HTTP

source: The HTTP Server Wizard consists of five steps. In the last step of the dialog, you may enter the expert configuration mode to make even more specific settings.
cs: Průvodce serverem HTTP se skládá z pěti kroků. V posledním kroku dialogu můžete vstoupit do režimu expertní konfigurace a provést ještě konkrétnější nastavení.
pt_br: O Assistente para servidor HTTP consiste em cinco etapas. Na última etapa da caixa de diálogo, você pode entrar no modo de configuração avançada para fazer configurações ainda mais específicas.

source: Network Device Selection
cs: Výběr síťového zařízení
pt_br: Seleção de dispositivo de rede

source: Here, specify the network interfaces and ports Apache uses to listen for incoming requests. You can select any combination of existing network interfaces and their respective IP addresses. Ports from all three ranges (well-known ports, registered ports, and dynamic or private ports) that are not reserved by other services can be used. The default setting is to listen on all network interfaces (IP addresses) on port <systemitem>80</systemitem>.
cs: Zde zadejte síťová rozhraní a porty, které Apache používá k příjmu příchozích požadavků. Můžete vybrat libovolnou kombinaci existujících síťových rozhraní a jejich příslušných IP adres. Lze použít porty ze všech tří rozsahů (známé porty, registrované porty a dynamické nebo soukromé porty), které nejsou rezervovány jinými službami. Výchozí nastavení je příjem na všech síťových rozhraních (IP adresách) na portu <systemitem>80</systemitem>.
pt_br: Aqui, especifique as interfaces e portas de rede que o Apache usa para escutar solicitações recebidas. Você pode selecionar qualquer combinação de interfaces de rede existentes e seus respectivos endereços IP. Portas de todos os três intervalos (portas conhecidas, portas registradas e portas dinâmicas ou privadas) que não são reservadas por outros serviços podem ser usadas. A configuração padrão é escutar em todas as interfaces de rede (endereços IP) na porta <systemitem>80</systemitem>.

source: Check <guimenu>Open Port In Firewall</guimenu> to open the ports in the firewall that the Web server listens on. This is necessary to make the Web server available on the network, which can be a LAN, WAN, or the public Internet. Keeping the port closed is only useful in test situations where no external access to the Web server is necessary. If you have multiple network interfaces, click <guimenu>Firewall Details</guimenu> to specify on which interface(s) the port(s) should be opened.
cs: Zaškrtnutím <guimenu>Otevřít port ve Firewallu</guimenu> otevřete v bráně firewall porty, na kterých webový server přijímá. To je nezbytné pro zpřístupnění webového serveru v síti, což může být LAN, WAN nebo veřejný internet. Uzavření portu je užitečné pouze v testovacích situacích, kdy není nutný externí přístup k webovému serveru. Pokud máte více síťových rozhraní, klikněte na <guimenu>Podrobnosti o bráně firewall</guimenu> a určete, na jakém rozhraní má/mají být port(y) otevřen(y).
pt_br: Marque <guimenu>Abrir porta no firewall</guimenu> para abrir as portas no firewall em que o servidor da Web ouve. Isso é necessário para disponibilizar o servidor Web na rede, que pode ser uma LAN, WAN ou a Internet pública. Manter a porta fechada é útil apenas em situações de teste em que nenhum acesso externo ao servidor da Web é necessário. Se você tiver várias interfaces de rede, clique em <guimenu>Detalhes do firewall</guimenu> para especificar em quais interfaces as portas devem ser abertas.

source: Click <guimenu>Next</guimenu> to continue with the configuration.
cs: Pokračování konfigurace - klikněte <guimenu>Next</guimenu>.
pt_br: Clique em <guimenu>Avançar</ guimenu> para continuar com a configuração.

source: Modules
cs: Moduly
pt_br: Módulos

source: The <guimenu>Modules</guimenu> configuration option allows for the activation or deactivation of the script languages that the Web server should support. For the activation or deactivation of other modules, refer to <xref linkend="sec.apache2.configuration.yast.server_configuration.modules"/>. Click <guimenu>Next</guimenu> to advance to the next dialog.
cs: Konfigurační možnost <guimenu>Moduly</guimenu> umožňuje aktivaci nebo deaktivaci skriptovacích jazyků, které by měl webový server podporovat. Informace o aktivaci nebo deaktivaci ostatních modulů najdete v <xref linkend="sec.apache2.configuration.yast.server_configuration.modules"/>. Kliknutím na <guimenu>Další</guimenu> přejdete na další dialog.
pt_br: A opção de configuração <guimenu>Módulos</guimenu> permite a ativação ou desativação dos idiomas de script aos quais o servidor da Web deve suportar. Para a ativação ou desativação de outros módulos, consulte <xref linkend="sec.apache2.configuration.yast.server_configuration.modules"/>. Clique em <guimenu>Próximo</guimenu> para avançar para a próxima caixa de diálogo.

source: Default Host
cs: Výchozí hostitel (název počítače v síti)
pt_br: Host Padrão

source: This option pertains to the default Web server. As explained in <xref linkend="sec.apache2.configuration.manually.vhost"/>, Apache can serve multiple virtual hosts from a single physical machine. The first declared virtual host in the configuration file is commonly called the <emphasis>default host</emphasis>. Each virtual host inherits the default host's configuration.
cs: Tato možnost se týká výchozího webového serveru. Jak je vysvětleno v <xref linkend="sec.apache2.configuration.manually.vhost"/>, Apache může obsluhovat více virtuálních hostitelů z jednoho fyzického počítače. První deklarovaný virtuální hostitel v konfiguračním souboru se běžně nazývá <emphasis>výchozí hostitel</emphasis>. Každý virtuální hostitel zdědí výchozí konfiguraci hostitele.
pt_br: Esta opção pertence ao servidor da Web padrão. Conforme explicado em <xref linkend="sec.apache2.configuration.manually.vhost"/>, o Apache pode atender a vários hosts virtuais a partir de uma única máquina física. O primeiro host virtual declarado no arquivo de configuração é chamado de <emphasis>host padrão</emphasis>. Cada host virtual herda a configuração do host padrão.

source: To edit the host settings (also called <emphasis>directives</emphasis>), select the appropriate entry in the table then click <guimenu>Edit</guimenu>. To add new directives, click <guimenu>Add</guimenu>. To delete a directive, select it and click <guimenu>Delete</guimenu>.
cs: Pro úpravy nastavení hostitele (zvaného též <emphasis>direktivy</emphasis>), zvolte příslušnou položku tabulky a klikněte <guimenu>Edit</guimenu>. Pro přidání nových direktiv klikněte <guimenu>Add</guimenu>. Pro výmaz direktivy ji vyberte a klikněte <guimenu>Delete</guimenu>.
pt_br: Para editar as configurações do host (também chamadas de <emphasis>diretivas</emphasis>), selecione a entrada apropriada na tabela e clique em <guimenu>Editar</guimenu>. Para adicionar novas diretivas, clique em <guimenu>Adicionar</guimenu>. Para excluir uma diretiva, selecione-a e clique em <guimenu>Excluir</guimenu>.

source: HTTP Server Wizard: Default Host
cs: Průvodce serverem HTTP: Výchozí hostitel
pt_br: Assistente de servidor HTTP: host padrão

source: Here is list of the default settings of the server:
cs: Seznam výchozích nastavení serveru:
pt_br: Aqui está uma lista das configurações padrão do servidor:

source: <systemitem>Document Root</systemitem>
cs: <systemitem>Kořen dokumentů</systemitem>

source: Path to the directory from which Apache serves files for this host. <filename>/srv/www/htdocs</filename> is the default location.
cs: Cesta do adresáře, z něhož Apache obsluhuje soubory pro tohoto hostitele. <filename>/srv/www/htdocs</filename> je výchozí umístění.
pt_br: Caminho para o diretório no qual o Apache serve arquivos para este host. <filename>/srv/www/htdocs</filename> é o local padrão.

source: Using <systemitem>Alias</systemitem> directives, URLs can be mapped to physical file system locations. This means that a certain path even outside the <literal>Document Root</literal> in the file system can be accessed via a URL aliasing that path.
cs: Použitím direktiv <systemitem>Alias</systemitem> lze URL mapovat na umístění fyzických souborových systémů. To znamená, že některé cesty, i mimo <literal>Document Root</literal> v systému souborů, lze používat přes URL mající alias dotyčné cesty.
pt_br: Usando as diretivas <systemitem>Alias</systemitem>, os URLs podem ser mapeados para os locais físicos do sistema de arquivos. Isso significa que um determinado caminho, mesmo fora da <literal>Document Root</literal>, no sistema de arquivos, pode ser acessado através de uma URL com o apelido desse caminho.

source: The default <phrase role="productname"><phrase os="osuse">openSUSE Leap</phrase><phrase os="sles">SUSE Linux Enterprise Server</phrase><phrase os="sled">SUSE Linux Enterprise Desktop</phrase></phrase> <systemitem>Alias</systemitem> <filename>/icons</filename> points to <filename>/usr/share/apache2/icons</filename> for the Apache icons displayed in the directory index view.
cs: Výchozí <phrase role="productname"><phrase os="osuse">openSUSE Leap</phrase><phrase os="sles">SUSE Linux Enterprise Server</phrase><phrase os="sled">SUSE Linux Enterprise Desktop</phrase></phrase> <systemitem>Alias</systemitem> <filename>/icons</filename> odkazuje na <filename>/usr/share/apache2/icons</filename>, ikony Apache zobrazované ve výpisu adresáře.
pt_br: O padrão <phrase role="productname"><phrase os="osuse">openSUSE Leap</phrase><phrase os="sles">SUSE Linux Enterprise Server</phrase><phrase os="sled">SUSE Linux Enterprise Desktop</phrase></phrase><systemitem>Alias</systemitem><filename>/icons</filename> aponta para <filename>/usr/share/apache2/icons</filename> para os ícones do Apache exibidos em a visualização do índice de diretório.

source: Similar to the <systemitem>Alias</systemitem> directive, the <systemitem>ScriptAlias</systemitem> directive maps a URL to a file system location. The difference is that <systemitem>ScriptAlias</systemitem> designates the target directory as a CGI location, meaning that CGI scripts should be executed in that location.
cs: Direktiva <systemitem>ScriptAlias</systemitem> mapuje URL na umístění systému souborů, podobně jako direktiva <systemitem>Alias</systemitem>. Rozdíl tkví v tom, že <systemitem>ScriptAlias</systemitem> označí cílový adresář jako umístění CGI, takže se z tohoto umístění budou spouštět CGI skripty.
pt_br: Semelhante à diretiva <systemitem>Alias</systemitem>, a diretiva <systemitem>ScriptAlias</systemitem> mapeia uma URL para um local do sistema de arquivos. A diferença é que <systemitem>ScriptAlias</systemitem> designa o diretório de destino como um local CGI, o que significa que os scripts CGI devem ser executados nesse local.

source: With <systemitem>Directory</systemitem> settings, you can enclose a group of configuration options that will only apply to the specified directory.
cs: Nastavením <systemitem>Directory</systemitem> můžete uzavřít skupinu konfiguračních možností, jež se budou aplikovat pouze na určený adresář.
pt_br: Com as configurações do <systemitem>Diretório</systemitem>, você pode incluir um grupo de opções de configuração que serão aplicadas apenas ao diretório especificado.

source: Access and display options for the directories <filename>/srv/www/htdocs</filename>, <filename>/usr/share/apache2/icons</filename> and <filename>/srv/www/cgi-bin</filename> are configured here. It should not be necessary to change the defaults.
cs: Zde se konfigurují přístupové a zobrazovací možnosti pro adresáře <filename>/srv/www/htdocs</filename>, <filename>/usr/share/apache2/icons</filename> a <filename>/srv/www/cgi-bin</filename>. Asi nebude nutno měnit výchozí nastavení.
pt_br: Opções de acesso e exibição para os diretórios <filename>/srv/www/htdocs</filename>, <filename>/usr/share/apache2/icons</filename> e <filename>/srv/www/cgi-bin</filename> estão configurados aqui. Não deve ser necessário alterar os padrões.

source: With include, additional configuration files can be specified. Two <systemitem>Include</systemitem> directives are already preconfigured: <filename>/etc/apache2/conf.d/</filename> is the directory containing the configuration files that come with external modules. With this directive, all files in this directory ending in <filename>.conf</filename> are included. With the second directive, <filename>/etc/apache2/conf.d/apache2-manual.conf</filename>, the <filename>apache2-manual</filename> configuration file is included.
cs: Pomocí include lze určit další konfigurační soubory. Jsou předkonfigurovány dvě direktivy <systemitem>Include</systemitem>: <filename>/etc/apache2/conf.d/</filename> obsahuje konfigurační soubory přicházející s externími moduly. Tato direktiva vloží všechny soubory v uvedeném adresáři končící na <filename>.conf</filename>. Druhá direktiva <filename>/etc/apache2/conf.d/apache2-manual.conf</filename> vloží konfigurační soubor <filename>apache2-manual</filename>.
pt_br: Com include, arquivos de configuração adicionais podem ser especificados. Duas diretivas <systemitem>Include</systemitem> já estão pré-configuradas: <filename>/etc/apache2/conf.d/</filename> é o diretório que contém os arquivos de configuração que acompanham os módulos externos. Com esta diretiva, todos os arquivos neste diretório que terminam em <filename>.conf</filename> são incluídos. Com a segunda diretiva, <filename>/etc/apache2/conf.d/apache2-manual.conf</filename>, o arquivo de configuração <filename>apache2-manual</filename> está incluído.

source: <systemitem>Server Name</systemitem>
cs: <systemitem>Název serveru</systemitem>

source: This specifies the default URL used by clients to contact the Web server. Use a fully qualified domain name (FQDN) to reach the Web server at <literal>http://<replaceable>FQDN</replaceable>/</literal> or its IP address. You cannot choose an arbitrary name here—the server must be <quote>known</quote> under this name.
cs: Určuje výchozí adresu URL používanou klienty pro kontaktování webového serveru. Použijte plně kvalifikovaný název domény (FQDN) k dosažení webového serveru na <literal>http://<replaceable>FQDN</replaceable>/</literal> nebo na jeho IP adrese. Zde si nemůžete zvolit libovolné jméno - server musí být tímto jménem <quote>známý</quote>.
pt_br: Isso especifica o URL padrão usado pelos clientes para entrar em contato com o servidor da Web. Use um nome de domínio totalmente qualificado (FQDN) para acessar o servidor da Web em <literal>http://<replaceable>FQDN</replaceable>/</literal> ou seu endereço IP. Você não pode escolher um nome arbitrário aqui - o servidor deve ser <quote>conhecido</quote> sob esse nome.

source: <systemitem>Server Administrator E-Mail</systemitem>
cs: <systemitem>E-Mail správce serveru</systemitem>
pt_br: <systemitem>E-mail do administrador do servidor</systemitem>

source: E-mail address of the server administrator. This address is, for example, shown on error pages Apache creates.
cs: E-mailová adresa správce serveru. Tato adresa je zobrazena například na chybových stránkách, které Apache vytváří.
pt_br: Endereço de email do administrador do servidor. Este endereço é, por exemplo, mostrado nas páginas de erro criadas pelo Apache.

source: After finishing with the <guimenu>Default Host</guimenu> step, click <guimenu>Next</guimenu> to continue with the configuration.
cs: Po dokončení kroku <guimenu>Výchozí hostitel</guimenu> klikněte na <guimenu>Další</guimenu> a pokračujte v konfiguraci.
pt_br: Após terminar com a etapa <guimenu>Host padrão</guimenu>, clique em <guimenu>Avançar</guimenu> para continuar com a configuração.

source: Virtual Hosts
cs: Virtuální hostitelé
pt_br: Hosts virtuais

source: In this step, the wizard displays a list of already configured virtual hosts (see <xref linkend="sec.apache2.configuration.manually.vhost"/>). If you have not made manual changes prior to starting the YaST HTTP wizard, no virtual host is present.
cs: V tomto kroku zobrazí průvodce seznam již zkonfigurovaných virtuálních hostitelů (viz <xref linkend="sec.apache2.configuration.manually.vhost"/>). Pokud jste před spuštěním průvodce YaST HTTP neprovedli ruční změny, není zobrazen žádný virtuální hostitel.
pt_br: Nesta etapa, o assistente exibe uma lista de hosts virtuais já configurados (consulte <xref linkend="sec.apache2.configuration.manually.vhost"/>). Se você não fez alterações manuais antes de iniciar o assistente HTTP do YaST, nenhum host virtual está presente.

source: To add a host, click <guimenu>Add</guimenu> to open a dialog in which to enter basic information about the host, such as <guimenu>Server Name</guimenu>, <guimenu>Server Contents Root</guimenu> (<systemitem>DocumentRoot</systemitem>), and the <guimenu>Administrator E-Mail</guimenu>. <guimenu>Server Resolution</guimenu> is used to determine how a host is identified (name based or IP based). Specify the name or IP address with <guimenu>Change Virtual Host ID</guimenu>
cs: Chcete-li přidat hostitele, klikněte na <guimenu>Přidat</guimenu> a otevřete dialog, ve kterém zadáte základní informace o hostiteli, například <guimenu>Název serveru</guimenu>, <guimenu>Kořen obsahu serveru</guimenu> (<systemitem> Kořen dokumentů</systemitem>) a <guimenu>E-mail správce</guimenu>. <guimenu>Označení serveru</guimenu> se používá k určení způsobu identifikace hostitele (na základě názvu nebo IP). Zadejte název nebo adresu IP pomocí <guimenu>Změnit ID virtuálního hostitele</guimenu>
pt_br: Para adicionar um host, clique em <guimenu>Adicionar</guimenu> para abrir uma caixa de diálogo para inserir informações básicas sobre o host, como <guimenu>Nome do Servidor</guimenu>, <guimenu>Raiz do Conteúdo do Servidor</guimenu> (<systemitem>DocumentRoot</systemitem>) e o <guimenu>E-mail do administrador</guimenu>. <guimenu>Resolução do servidor</guimenu> é usado para determinar como um host é identificado (com base em nome ou com base em IP). Especifique o nome ou o endereço IP com <guimenu>Alterar ID do host virtual</guimenu>

source: Clicking <guimenu>Next</guimenu> advances to the second part of the virtual host configuration dialog.
cs: Kliknutím <guimenu>Next</guimenu> přejdete na druhou část konfiguračního dialogu virtuálního hostitele.
pt_br: Clicar em <guimenu>Avançar</guimenu> avança para a segunda parte da caixa de diálogo de configuração do host virtual.

source: In part two of the virtual host configuration you can specify whether to enable CGI scripts and which directory to use for these scripts. It is also possible to enable SSL. If you do so, you must specify the path to the certificate as well. See <xref linkend="sec.apache2.ssl.configuration"/> for details on SSL and certificates. With the <guimenu>Directory Index</guimenu> option, you can specify which file to display when the client requests a directory (by default, <filename>index.html</filename>). Add one or more file names (space-separated) to change this. With <guimenu>Enable Public HTML</guimenu>, the content of the users public directories (<filename>~<replaceable>USER</replaceable>/public_html/</filename>) is made available on the server under <literal>http://www.example.com/~<replaceable>USER</replaceable></literal>.
cs: V druhé části konfigurace virtuálního hostitele můžete určit, zda povolit skripty CGI a který adresář použít pro tyto skripty. Je také možné povolit SSL. Pokud tak učiníte, musíte také zadat cestu k certifikátu. Podrobnosti o SSL a certifikátech viz <xref linkend="sec.apache2.ssl.configuration"/>. Pomocí možnosti <guimenu>Rejstřík adresářů</guimenu> můžete určit, který soubor se má zobrazit, když klient požaduje adresář (ve výchozím nastavení <filename>index.html</filename>). Chcete-li to změnit, přidejte jeden nebo více názvů souborů (oddělených mezerami). V případě <guimenu>Povolit veřejný HTML</guimenu> je obsah veřejných adresářů uživatelů (<filename>~<replaceable>UŽIVATEL</replaceable>/public_html/</filename>) zpřístupněn na serveru pod <literal>http://www.example.com/~<replaceable>UŽIVATEL</replaceable></literal>.
pt_br: Na parte dois da configuração do host virtual, você pode especificar se deseja ativar scripts CGI e qual diretório usar para esses scripts. Também é possível ativar o SSL. Se você fizer isso, também deverá especificar o caminho para o certificado. Consulte <xref linkend="sec.apache2.ssl.configuration"/> para obter detalhes sobre SSL e certificados. Com a opção <guimenu>Índice de diretório</guimenu>, você pode especificar qual arquivo será exibido quando o cliente solicitar um diretório (por padrão, <filename>index.html</filename>). Adicione um ou mais nomes de arquivo (separados por espaço) para alterar isso. Com <guimenu>Habilitar HTML público</guimenu>, o conteúdo dos diretórios públicos dos usuários (<filename>~<replaceable>USER</replaceable>/public_html/</filename>) é disponibilizado no servidor em <literal>http://www.example.com/~<replaceable>USER</replaceable></literal>.

source: Creating Virtual Hosts
cs: Vytváření virttuálních hostitelů
pt_br: Criando hosts virtuais
