Repository: openSUSE/doc-sle-translations
Catalog: */po/apache2_yast_i.*.po
Languages: cs, pt_br

source: It is not possible to add virtual hosts at will. If using name-based virtual hosts, each host name must be resolved on the network. If using IP-based virtual hosts, you can assign only one host to each IP address available.
cs: Není možné libovolně přidávat virtuální počítače. Používáte-li virtuální hostitele založené na jménech, musí být každý název hostitele přeložen v síti (DNS). Pokud používáte virtuální hostitele založené na IP, můžete každé dostupné adrese IP přiřadit pouze jednoho hostitele.
pt_br: Não é possível adicionar hosts virtuais à vontade. Se estiver usando hosts virtuais baseados em nome, cada nome de host deverá ser resolvido na rede. Se você estiver usando hosts virtuais baseados em IP, poderá atribuir apenas um host a cada endereço IP disponível.

source: Summary
cs: Souhrn
pt_br: Resumo

source: This is the final step of the wizard. Here, determine how and when the Apache server is started: when booting or manually. Also see a short summary of the configuration made so far. If you are satisfied with your settings, click <guimenu>Finish</guimenu> to complete configuration. To change something, click <guimenu>Back</guimenu> until you have reached the desired dialog. Clicking <guimenu>HTTP Server Expert Configuration</guimenu> opens the dialog described in <xref linkend="sec.apache2.configuration.yast.server_configuration"/>.
cs: Toto je poslední krok průvodce. Zde určete, jak a kdy se spustí server Apache: při bootování nebo ručně. Zkontrolujte také krátké shrnutí dosud provedené konfigurace. Pokud jste s nastavením spokojeni, dokončete konfiguraci kliknutím na <guimenu>Dokončit</guimenu>. Chcete-li něco změnit, klikejte na <guimenu>Zpět</guimenu>, dokud nedojdete k žádanému dialogu. Kliknutím na <guimenu>Expertní konfigurace serveru HTTP</guimenu> se otevře dialog popsaný v <xref linkend="sec.apache2.configuration.yast.server_configuration"/>.
pt_br: Esta é a etapa final do assistente. Aqui, determine como e quando o servidor Apache é iniciado: ao inicializar ou manualmente. Veja também um breve resumo da configuração feita até o momento. Se você estiver satisfeito com suas configurações, clique em <guimenu>Concluir</guimenu> para concluir a configuração. Para alterar algo, clique em <guimenu>Voltar</guimenu> até chegar à caixa de diálogo desejada. Clicar em <guimenu>Configuração avançada do servidor HTTP</guimenu> abre a caixa de diálogo descrita em <xref linkend="sec.apache2.configuration.yast.server_configuration"/>.

source: HTTP Server Wizard: Summary
cs: Průvodce serverem HTTP: Souhrn
pt_br: Assistente para servidor HTTP: Resumo

source: HTTP Server Configuration
cs: Konfigurace serveru HTTP
pt_br: Configuração do servidor HTTP

source: The <guimenu>HTTP Server Configuration</guimenu> dialog also lets you make even more adjustments to the configuration than the wizard (which only runs if you configure your Web server for the first time). It consists of four tabs described in the following. No configuration option you change here is effective immediately—you always must confirm your changes with <guimenu>Finish</guimenu> to make them effective. Clicking <guimenu>Abort</guimenu> leaves the configuration module and discards your changes.
cs: Dialog <guimenu>Konfigurace serveru HTTP</guimenu> vám také umožňuje provést více úprav konfigurace než průvodce (který se spustí pouze v případě, že webový server konfigurujete poprvé). Skládá se ze čtyř karet popsaných dále. Žádná možnost konfigurace, kterou zde změníte, není účinná okamžitě - změny musíte vždy potvrdit pomocí <guimenu>Dokončit</guimenu>, aby byly účinné. Kliknutím na <guimenu>Přerušit</guimenu> opustíte konfigurační modul a zahodíte svoje případné změny.
pt_br: A caixa de diálogo <guimenu>Configuração do servidor HTTP</guimenu> também permite fazer ainda mais ajustes na configuração do que o assistente (que só é executado se você configurar o servidor da Web pela primeira vez). Consiste em quatro guias descritas a seguir. Nenhuma opção de configuração alterada aqui é efetiva imediatamente - você sempre deve confirmar suas alterações com <guimenu>Concluir</guimenu> para torná-las efetivas. Clicar em <guimenu>Abortar</guimenu> sai do módulo de configuração e descarta suas alterações.

source: Listen Ports and Addresses
cs: Příjem (naslouchání): Porty a adresy
pt_br: Ouvir portas e endereços

source: In <guimenu>HTTP Service</guimenu>, select whether Apache should be running (<guimenu>Enabled</guimenu>) or stopped (<guimenu>Disabled</guimenu>). In <guimenu>Listen on Ports</guimenu>, <guimenu>Add</guimenu>, <guimenu>Edit</guimenu>, or <guimenu>Delete</guimenu> addresses and ports on which the server should be available. The default is to listen on all interfaces on port <literal>80</literal>. You should always check <guimenu>Open Port In Firewall</guimenu>, because otherwise the Web server is not reachable from outside. Keeping the port closed is only useful in test situations where no external access to the Web server is necessary. If you have multiple network interfaces, click <guimenu>Firewall Details</guimenu> to specify on which interface(s) the port(s) should be opened.
cs: <guimenu>Služba HTTP</guimenu>: vyberte, zda má být Apache spuštěn (<guimenu>Povolen</guimenu>), nebo zastaven (<guimenu>Zakázán</guimenu>). Na <guimenu>Příjem na portech</guimenu> můžete <guimenu>Přidat</guimenu>, <guimenu>Upravit</guimenu> nebo <guimenu>Odstranit</guimenu> adresy a porty, na kterých by měl být server k dispozici. Výchozí nastavení je přijímat na všech rozhraních na portu <literal>80</literal>. Vždy byste měli zkontrolovat nastavení v <guimenu>Otevřít port v bráně firewall</guimenu>, protože není-li nikde povolen příjem, není webový server dosažitelný zvnějšku. Uzavřený port je užitečný pouze v testovacích situacích, kdy není nutný externí přístup k webovému serveru. Pokud máte více síťových rozhraní, klikněte na <guimenu>Podrobnosti o bráně firewall</guimenu> a určete, na jakém rozhraní má/mají být port(y) otevřen(y).
pt_br: No <guimenu>Serviço HTTP</guimenu>, selecione se o Apache deve estar em execução (<guimenu>Ativado</guimenu>) ou parado (<guimenu>Desativado</guimenu>). Em <guimenu>Ouça em portas</guimenu>, <guimenu>Adicione</guimenu>, <guimenu>Editar</guimenu> ou <guimenu>Exclua</guimenu> endereços e portas nas quais o servidor deve estar disponível. O padrão é escutar em todas as interfaces na porta <literal>80</literal>. Você deve sempre verificar <guimenu>Abrir porta no firewall</guimenu>, porque, caso contrário, o servidor da Web não poderá ser acessado de fora. Manter a porta fechada é útil apenas em situações de teste em que nenhum acesso externo ao servidor da Web é necessário. Se você tiver várias interfaces de rede, clique em <guimenu>Detalhes do firewall</guimenu> para especificar em quais interfaces as portas devem ser abertas.

source: With <guimenu>Log Files</guimenu>, watch either the access log file or the error log file. This is useful if you want to test your configuration. The log file opens in a separate window from which you can also restart or reload the Web server. For details, see <xref linkend="sec.apache2.start_stop"/>. These commands are effective immediately and their log messages are also displayed immediately.
cs: Se <guimenu>Soubory protokolu</guimenu> (žurnály) sledujete buď soubor protokolu přístupu, nebo soubor protokolu chyb. To je užitečné, když chcete otestovat svou konfiguraci. Soubor protokolu se otevře v samostatném okně, ze kterého můžete také restartovat nebo znovu načíst parametry pro webový server. Podrobnosti viz <xref linkend="sec.apache2.start_stop"/>. Tyto příkazy jsou účinné okamžitě a jejich žurnálové zprávy se také okamžitě zobrazí.
pt_br: Com <guimenu>Arquivos de log</guimenu>, observe o arquivo de log de acesso ou o arquivo de log de erros. Isso é útil se você quiser testar sua configuração. O arquivo de log é aberto em uma janela separada da qual você também pode reiniciar ou recarregar o servidor da Web. Para detalhes, consulte <xref linkend="sec.apache2.start_stop"/>. Esses comandos são efetivos imediatamente e suas mensagens de log também são exibidas imediatamente.

source: HTTP Server Configuration: Listen Ports and Addresses
cs: Konfigurace serveru HTTP: Porty a adresy pro příjem
pt_br: Configuração do servidor HTTP: ouvir portas e endereços

source: Server Modules
cs: Moduly serveru
pt_br: Módulos de servidor

source: You can change the status (enabled or disabled) of Apache2 modules by clicking <guimenu>Toggle Status</guimenu>. Click <guimenu>Add Module</guimenu> to add a new module that is already installed but not yet listed. Learn more about modules in <xref linkend="sec.apache2.modules"/>.
cs: Stav (povolených nebo zakázaných) modulů Apache2 můžete změnit kliknutím na <guimenu>Přepnout stav</guimenu>. Kliknutím na <guimenu>Přidat modul </guimenu>přidáte nový modul, který je již nainstalován, ale dosud není zaveden. Další informace o modulech naleznete v <xref linkend="sec.apache2.modules"/>.
pt_br: Você pode alterar o status (ativado ou desativado) dos módulos Apache2 clicando em <guimenu>Alternar status</guimenu>. Clique em <guimenu>Adicionar módulo</guimenu> para adicionar um novo módulo que já está instalado, mas ainda não está listado. Saiba mais sobre os módulos em <xref linkend="sec.apache2.modules"/>.

source: HTTP Server Configuration: Server Modules
cs: Konfigurace serveru HTTP: Moduly serveru
pt_br: Configuração do servidor HTTP: módulos de servidor

source: Main Host or Hosts
cs: Hlavní hostitel(é)
pt_br: Principal host ou hosts

source: These dialogs are identical to the ones already described. Refer to <xref linkend="sec.apache2.configuration.yast.wizard.default_host"/> and <xref linkend="sec.apache2.configuration.yast.wizard.virtual_hosts"/>.
cs: Tyto dialogy jsou shodné s dialogy, které již byly popsány. Odkazují na<xref linkend="sec.apache2.configuration.yast.wizard.default_host"/> a <xref linkend="sec.apache2.configuration.yast.wizard.virtual_hosts"/>.
pt_br: Essas caixas de diálogo são idênticas às já descritas. Confira <xref linkend="sec.apache2.configuration.yast.wizard.default_host"/> e <xref linkend="sec.apache2.configuration.yast.wizard.virtual_hosts"/>.

source: <systemitem>Directory</systemitem>
pt_br: <systemitem>Diretório</systemitem>
