Repository: openSUSE/doc-sle-translations
Catalog: */po/apparmor_profiles_yast.*.po
Languages: cs

# _
source: translator-credits
cs: překladatelské kredity alkas alkas@volny.cz, 2016, 2020

source: Building and Managing Profiles with YaST
cs: Vytváření a správa profilů pomocí YaST

source: YaST provides a basic way to build profiles and manage <phrase>AppArmor®</phrase> profiles. It provides two interfaces: a graphical one and a text-based one. The text-based interface consumes less resources and bandwidth, making it a better choice for remote administration, or for times when a local graphical environment is inconvenient. Although the interfaces have differing appearances, they offer the same functionality in similar ways. Another alternative is to use <phrase>AppArmor</phrase> commands, which can control <phrase>AppArmor</phrase> from a terminal window or through remote connections. The command line tools are described in <xref linkend="cha.apparmor.commandline"/>.
cs: YaST poskytuje základní způsob vytváření profilů a správu profilů <phrase>AppArmor®</phrase>. Poskytuje dvě rozhraní: grafické a textové. Textové rozhraní spotřebovává méně zdrojů a šířku pásma, což z něj činí lepší volbu pro vzdálenou správu nebo pro situace, kdy je místní grafické prostředí nevhodné. Ačkoli rozhraní mají odlišný vzhled, nabízejí stejnou funkčnost podobným způsobem. Další alternativou je použití příkazů <phrase>AppArmor</phrase>, které mohou ovládat <phrase>AppArmor</phrase> z okna terminálu nebo vzdáleným připojením. Nástroje příkazového řádku jsou popsány v <xref linkend="cha.apparmor.commandline"/>.

source: Start YaST from the main menu and enter your <systemitem class="username">root</systemitem> password when prompted for it. Alternatively, start YaST by opening a terminal window, logging in as <systemitem class="username">root</systemitem>, and entering <command>yast2</command> for the graphical mode or <command>yast</command> for the text-based mode.
cs: Spusťte YaST z hlavní nabídky a na výzvu zadejte heslo superuživatele <systemitem class="username">root</systemitem>. Případně spusťte YaST otevřením okna terminálu a přihlaste se jako <systemitem class="username">root</systemitem>. Zadejte příkaz <command>yast2</command> (grafický režim) nebo <command>yast</command> (textový režim).

source: In the <guimenu>Security and Users</guimenu> section, there is an <guimenu><phrase>AppArmor</phrase> Configuration</guimenu> icon. Click it to launch the <phrase>AppArmor</phrase> YaST module.
cs: V části <guimenu>Zabezpečení a uživatelé</guimenu> je ikona <guimenu><phrase>AppArmor</phrase>Konfigurace</guimenu>. Klepnutím na ni spustíte modul YaST <phrase>AppArmor</phrase>.

source: Manually Adding a Profile
cs: Manuální přidání profilu

source: <phrase>AppArmor</phrase> enables you to create an <phrase>AppArmor</phrase> profile by manually adding entries into the profile. Select the application for which to create a profile, then add entries.
cs: <phrase>AppArmor</phrase> vám umožní vytvořit profil <phrase>AppArmor</phrase> ručně, přidáním položek do profilu. Vyberte aplikaci, pro kterou chcete vytvořit profil, a poté přidejte položky.

source: Start YaST, select <guimenu><phrase>AppArmor</phrase> Configuration</guimenu>, and click <guimenu>Manually Add Profile</guimenu> in the main window.
cs: Spusťte YaST, vyberte <guimenu><phrase>AppArmor</phrase>Konfigurace</guimenu> a v hlavním okně klikněte na <guimenu>Přidat profil manuálně</guimenu>.

source: Browse your system to find the application for which to create a profile.
cs: Procházejte svůj systém a vyhledejte aplikaci, pro kterou chcete vytvořit profil.

source: When you find the application, select it and click <guimenu>Open</guimenu>. A basic, empty profile appears in the <guimenu><phrase>AppArmor</phrase> Profile Dialog</guimenu> window.
cs: Nalezenou aplikaci vyberte a klikněte na <guimenu>Otevřít</guimenu>. V okně <guimenu><phrase>AppArmor</phrase>Dialogové okno</guimenu> se zobrazí základní prázdný profil.

source: In <guimenu><phrase>AppArmor</phrase> Profile Dialog</guimenu>, add, edit, or delete <phrase>AppArmor</phrase> profile entries by clicking the corresponding buttons and referring to <xref xrefstyle="HeadingOnPage" linkend="sec.apparmor.yast.edit.add"/>, <xref xrefstyle="HeadingOnPage" linkend="sec.apparmor.yast.edit.edit"/>, or <xref xrefstyle="HeadingOnPage" linkend="sec.apparmor.yast.edit.del"/>.
cs: V <guimenu><phrase>AppArmor</phrase> Dialogu profilu</guimenu>, přidáváte, upravujete nebo odstraňujete položky profilů <phrase>AppArmor</phrase> kliknutím odpovídajících tlačítek a postupem podle odkazů <xref xrefstyle="HeadingOnPage" linkend="sec.apparmor.yast.edit.add"/>, <xref xrefstyle="HeadingOnPage" linkend="sec.apparmor.yast.edit.edit"/> nebo <xref xrefstyle="HeadingOnPage" linkend="sec.apparmor.yast.edit.del"/>.

source: When finished, click <guimenu>Done</guimenu>.
cs: Když skončíte, klikněte <guimenu>Hotovo</guimenu>.

source: Editing Profiles
cs: Úprava profilů

source: YaST offers basic manipulation for <phrase>AppArmor</phrase> profiles, such as creating or editing. However, the most straightforward way to edit an <phrase>AppArmor</phrase> profile is to use a text editor such as <command>vi</command>:
cs: YaST nabízí základní manipulaci s profily <phrase>AppArmor</phrase>, například vytváření nebo úpravy. Nejjednodušším způsobem úpravy profilu <phrase>AppArmor</phrase> je však použití textového editoru, jako je <command>vi</command>:

source: The <command>vi</command> editor also includes syntax (error) highlighting and syntax error highlighting, which visually warns you when the syntax of the edited <phrase>AppArmor</phrase> profile is wrong.
cs: Editor <command>vi</command> obsahuje také zvýraznění syntaxe a chyby syntaxe, které vás vizuálně upozorní, když je syntaxe upraveného profilu <phrase>AppArmor</phrase> nesprávná.

source: <phrase>AppArmor</phrase> enables you to edit <phrase>AppArmor</phrase> profiles manually by adding, editing, or deleting entries. To edit a profile, proceed as follows:
cs: <phrase>AppArmor</phrase> umožňuje manuálně upravovat profily <phrase>AppArmor</phrase> přidáním, úpravou nebo odstraněním položek. Chcete-li upravit profil, postupujte takto:

source: Start YaST, select <guimenu><phrase>AppArmor</phrase> Configuration</guimenu>, and click <guimenu>Manage Existing Profiles</guimenu> in the main window.
cs: Spusťte YaST, vyberte <guimenu><phrase>AppArmor</phrase> Konfigurace</guimenu> a v hlavním okně klikněte na <guimenu>Spravovat existující profily</guimenu>.

source: <textobject role="description"><phrase>Choose the profile to edit</phrase> </textobject> <imageobject role="fo"> <imagedata format="PNG" fileref="edit_1.png" width="75%"/> </imageobject> <imageobject role="html"> <imagedata format="PNG" fileref="edit_1.png"/> </imageobject>
cs: <textobject role="description"><phrase>Vyberte profil k úpravě</phrase> </textobject> <imageobject role="fo"> <imagedata format="PNG" fileref="edit_1.png" width="75%"/> </imageobject> <imageobject role="html"> <imagedata format="PNG" fileref="edit_1.png"/> </imageobject>

source: From the list of profiled applications, select the profile to edit.
cs: Ze seznamu profilovaných aplikací vyberte profil, který chcete upravit.

source: Click <guimenu>Edit</guimenu>. The <guimenu><phrase>AppArmor</phrase> Profile Dialog</guimenu> window displays the profile.
cs: Klikněte <guimenu>Úpravy</guimenu>. Okno <guimenu><phrase>AppArmor</phrase> Dialog profilu </guimenu> zobrazí profil.

source: <textobject role="description"><phrase><phrase>AppArmor</phrase> profile dialog</phrase> </textobject> <imageobject role="fo"> <imagedata format="PNG" fileref="edit_2.png" width="75%"/> </imageobject> <imageobject role="html"> <imagedata format="PNG" fileref="edit_2.png"/> </imageobject>
cs: <textobject role="description"><phrase><phrase>AppArmor</phrase> dialog profilu</phrase> </textobject> <imageobject role="fo"> <imagedata format="PNG" fileref="edit_2.png" width="75%"/> </imageobject> <imageobject role="html"> <imagedata format="PNG" fileref="edit_2.png"/> </imageobject>

source: In the <guimenu><phrase>AppArmor</phrase> Profile Dialog</guimenu> window, add, edit, or delete <phrase>AppArmor</phrase> profile entries by clicking the corresponding buttons and referring to <xref xrefstyle="HeadingOnPage" linkend="sec.apparmor.yast.edit.add"/>, <xref xrefstyle="HeadingOnPage" linkend="sec.apparmor.yast.edit.edit"/>, or <xref xrefstyle="HeadingOnPage" linkend="sec.apparmor.yast.edit.del"/>.
cs: V okně <guimenu><phrase>AppArmor</phrase> Dialog profilu</guimenu> přidáváte, upravujete nebo odstraňujete položky profilů <phrase>AppArmor</phrase> kliknutím odpovídajících tlačítek a podle odkazů <xref xrefstyle="HeadingOnPage" linkend="sec.apparmor.yast.edit.add"/>, <xref xrefstyle="HeadingOnPage" linkend="sec.apparmor.yast.edit.edit"/> nebo <xref xrefstyle="HeadingOnPage" linkend="sec.apparmor.yast.edit.del"/>.

source: When you are finished, click <guimenu>Done</guimenu>.
cs: Když skončíte, klikněte <guimenu>Hotovo</guimenu>.

source: In the pop-up that appears, click <guimenu>Yes</guimenu> to confirm your changes to the profile and reload the <phrase>AppArmor</phrase> profile set.
cs: V okně, které se objeví, klikněte <guimenu>Ano</guimenu>, čímž potvrdíte změny profilu a znovu zavedete sadu profilů <phrase>AppArmor</phrase>.

source: Syntax Checking in <phrase>AppArmor</phrase>
cs: Kontrola syntaxe v <phrase>AppArmor</phrase>

source: <phrase>AppArmor</phrase> contains a syntax check that notifies you of any syntax errors in profiles you are trying to process with the YaST <phrase>AppArmor</phrase> tools. If an error occurs, edit the profile manually as <systemitem class="username">root</systemitem> and reload the profile set with <command>systemctl reload apparmor</command>.
cs: <phrase>AppArmor</phrase> obsahuje kontrolu syntaxe, která vás upozorní na syntaktické chyby v profilech, které chcete zpracovat nástroji YaST <phrase>AppArmor</phrase>. Najde-li se chyba, upravte profil manuálně jako uživatel <systemitem class="username">root</systemitem> a znovu zaveďte sadu profilů: <command>systemctl reload apparmor</command>.

source: Adding an Entry
cs: Přidání položky

source: The <guimenu>Add Entry</guimenu> button in the <guimenu><phrase>AppArmor</phrase> Profile Window</guimenu> lists types of entries you can add to the <phrase>AppArmor</phrase> profile.
cs: Tlačítko <guimenu>Přidat položku</guimenu> v okně <guimenu><phrase>AppArmor</phrase> Okno profilu</guimenu> vypíše typy položek, které můžete přidat k profilu <phrase>AppArmor</phrase>.

source: From the list, select one of the following:
cs: Ze seznamu vyberte:

source: File
cs: Soubor

source: In the pop-up window, specify the absolute path of a file, including the type of access permitted. When finished, click <guimenu>OK</guimenu>.
cs: V rozbalovacím okně zadejte absolutní cestu k souboru, včetně typu povoleného přístupu. Po dokončení klikněte na <guimenu>OK</guimenu>.

source: You can use globbing if necessary. For globbing information, refer to <xref xrefstyle="SectTitleOnPage" linkend="sec.apparmor.profiles.glob"/>. For file access permission information, refer to <xref xrefstyle="SectTitleOnPage" linkend="sec.apparmor.profiles.perm"/>.
cs: Je-li třeba, použijte globbing. Co to je globbing, zjistíte na <xref xrefstyle="SectTitleOnPage" linkend="sec.apparmor.profiles.glob"/>. O přístupových právech souborů čtěte na <xref xrefstyle="SectTitleOnPage" linkend="sec.apparmor.profiles.perm"/>.

source: <textobject role="description"><phrase>Select a file to add</phrase> </textobject> <imageobject role="fo"> <imagedata format="PNG" fileref="add_2_addentry_file.png" width="60%"/> </imageobject> <imageobject role="html"> <imagedata fileref="add_2_addentry_file.png" width="35%" format="PNG"/> </imageobject>
cs: <textobject role="description"><phrase>Zvolte soubor k přidání</phrase> </textobject> <imageobject role="fo"> <imagedata format="PNG" fileref="add_2_addentry_file.png" width="60%"/> </imageobject> <imageobject role="html"> <imagedata fileref="add_2_addentry_file.png" width="35%" format="PNG"/> </imageobject>

source: Directory
cs: Adresář

source: In the pop-up window, specify the absolute path of a directory, including the type of access permitted. You can use globbing if necessary. When finished, click <guimenu>OK</guimenu>.
cs: V rozbalovacím okně zadejte absolutní cestu k adresáři a typ povoleného přístupu. V případě potřeby můžete použít globbing. Po dokončení klikněte <guimenu>OK</guimenu>.

source: For globbing information, refer to <xref xrefstyle="SectTitleOnPage" linkend="sec.apparmor.profiles.glob"/>. For file access permission information, refer to <xref xrefstyle="SectTitleOnPage" linkend="sec.apparmor.profiles.perm"/>.
cs: Co je to globbing: <xref xrefstyle="SectTitleOnPage" linkend="sec.apparmor.profiles.glob"/>. Přístupová práva k souborům: <xref xrefstyle="SectTitleOnPage" linkend="sec.apparmor.profiles.perm"/>.

source: <textobject role="description"><phrase>Select a directory to add</phrase> </textobject> <imageobject role="fo"> <imagedata format="PNG" fileref="add_2_addentry_file.png" width="60%"/> </imageobject> <imageobject role="html"> <imagedata fileref="add_2_addentry_file.png" width="35%" format="PNG"/> </imageobject>
cs: <textobject role="description"><phrase>Zvolte adresář k přidání</phrase> </textobject> <imageobject role="fo"> <imagedata format="PNG" fileref="add_2_addentry_file.png" width="60%"/> </imageobject> <imageobject role="html"> <imagedata fileref="add_2_addentry_file.png" width="35%" format="PNG"/> </imageobject>

source: Network Rule
cs: Pravidlo pro síť

source: In the pop-up window, select the appropriate network family and the socket type. For more information, refer to <xref xrefstyle="SectTitleOnPage" linkend="sec.apparmor.profiles.nac"/>.
cs: V rozbalovacím okně vyberte patřičnou rodinu sítí a typ soketu. Další informace viz <xref xrefstyle="SectTitleOnPage" linkend="sec.apparmor.profiles.nac"/>.

source: <textobject role="description"><phrase>Select capabilities</phrase> </textobject> <imageobject role="fo"> <imagedata format="PNG" fileref="add_2_addentry_network.png" width="50%"/> </imageobject> <imageobject role="html"> <imagedata format="PNG" fileref="add_2_addentry_network.png" width="35%"/> </imageobject>
cs: <textobject role="description"><phrase>Vyberte možnosti</phrase> </textobject> <imageobject role="fo"> <imagedata format="PNG" fileref="add_2_addentry_network.png" width="50%"/> </imageobject> <imageobject role="html"> <imagedata format="PNG" fileref="add_2_addentry_network.png" width="35%"/> </imageobject>

source: Capability
cs: Možnost

source: In the pop-up window, select the appropriate capabilities. These are statements that enable each of the 32 POSIX.1e capabilities. Refer to <xref xrefstyle="SectTitleOnPage" linkend="sec.apparmor.profiles.capabilities"/> for more information about capabilities. When finished making your selections, click <guimenu>OK</guimenu>.
cs: V rozbalovacím okně vyberte patřičné možnosti. Zde jsou příkazy, které uvádějí každou z 32 možností POSIX.1e. Více informací o možnostech viz <xref xrefstyle="SectTitleOnPage" linkend="sec.apparmor.profiles.capabilities"/>. Po dokončení výběru klikněte <guimenu>OK</guimenu>.

source: <textobject role="description"><phrase>Select capabilities</phrase> </textobject> <imageobject role="fo"> <imagedata format="PNG" fileref="add_2_addentry_capability.png" width="75%"/> </imageobject> <imageobject role="html"> <imagedata format="PNG" fileref="add_2_addentry_capability.png"/> </imageobject>
cs: <textobject role="description"><phrase>Zvolte možnosti</phrase> </textobject> <imageobject role="fo"> <imagedata format="PNG" fileref="add_2_addentry_capability.png" width="75%"/> </imageobject> <imageobject role="html"> <imagedata format="PNG" fileref="add_2_addentry_capability.png"/> </imageobject>

source: Include File
cs: Vložit soubor

source: In the pop-up window, browse to the files to use as includes. Includes are directives that pull in components of other <phrase>AppArmor</phrase> profiles to simplify profiles. For more information, refer to <xref xrefstyle="SectTitleOnPage" linkend="sec.apparmor.profiles.includes"/>.
cs: V rozbalovacím okně vyhledejte soubory, které chcete použít jako vložené. Jsou to směrnice, které vřazují komponenty jiných profilů <phrase>AppArmor</phrase> pro zjednodušení skladby vytvářeného profilu. Více informací najdete na <xref xrefstyle="SectTitleOnPage" linkend="sec.apparmor.profiles.includes"/>.

source: Hat
cs: Klobouk

source: In the pop-up window, specify the name of the subprofile (<emphasis>hat</emphasis>) to add to your current profile and click <guimenu>Create Hat</guimenu>. For more information, refer to <xref linkend="cha.apparmor.hat"/>.
cs: V rozbalovacím okně zadejte název podprofilu (<emphasis>"klobouku"</emphasis>) přidejte ho tím ke svému aktuálnímu profilu a klikněte <guimenu>Vytvořit klobouk</guimenu>. Podrobněji viz <xref linkend="cha.apparmor.hat"/>.

source: Editing an Entry
cs: Úprava položky

source: When you select <guimenu>Edit Entry</guimenu>, a pop-up window opens. From here, edit the selected entry.
cs: Když vyberete možnost <guimenu>Upravit položku</guimenu>, otevře se vyskakovací okno. V něm vybranou položku upravte.

source: In the pop-up window, edit the entry you need to modify. You can use globbing if necessary. When finished, click <guimenu>OK</guimenu>.
cs: V rozbalovacím okně upravte položku, kterou chcete změnit. V případě potřeby můžete použít globbing. Po dokončení klikněte na <guimenu>OK</guimenu>.

source: For globbing information, refer to <xref linkend="sec.apparmor.profiles.glob"/>. For access permission information, refer to <xref linkend="sec.apparmor.profiles.perm"/>.
cs: Globbing: <xref linkend="sec.apparmor.profiles.glob"/>. Přístupová práva: <xref linkend="sec.apparmor.profiles.perm"/>.

source: Deleting an Entry
cs: Odstranění položky

source: To delete an entry in a given profile, select <guimenu>Delete Entry</guimenu>. <phrase>AppArmor</phrase> removes the selected profile entry.
cs: Chcete-li odstranit položku v daném profilu, vyberte <guimenu>Odstranit položku</guimenu>. <phrase>AppArmor</phrase> odstraní vybranou položku profilu.

source: Deleting a Profile
cs: Odstranění profilu

source: <phrase>AppArmor</phrase> enables you to delete an <phrase>AppArmor</phrase> profile manually. Simply select the application for which to delete a profile then delete it as follows:
cs: <phrase>AppArmor</phrase> umožňuje manuálně odstranit profil <phrase>AppArmor</phrase>. Zvolte aplikaci, jejíž profil chcete odstranit, a potom ho vymažte:

source: Select the profile to delete.
cs: Zvolte profil k odstranění.

source: Click <guimenu>Delete</guimenu>.
cs: Klikněte <guimenu>Výmaz</guimenu>.

source: In the pop-up that opens, click <guimenu>Yes</guimenu> to delete the profile and reload the <phrase>AppArmor</phrase> profile set.
cs: V rozevíracím okně, které se otevře, klikněte na <guimenu>Ano</guimenu>, tím smažete profil a znovu načtete sadu profilů <phrase>AppArmor</phrase>.

source: Managing <phrase>AppArmor</phrase>
cs: Správa <phrase>AppArmor</phrase>

source: You can change the status of <phrase>AppArmor</phrase> by enabling or disabling it. Enabling <phrase>AppArmor</phrase> protects your system from potential program exploitation. Disabling <phrase>AppArmor</phrase>, even if your profiles have been set up, removes protection from your system. To change the status of <phrase>AppArmor</phrase>, start YaST, select <guimenu><phrase>AppArmor</phrase> Configuration</guimenu>, and click <guimenu>Settings</guimenu> in the main window.
cs: Stav aplikace <phrase>AppArmor</phrase> můžete změnit jejím povolením nebo zakázáním. Povolení aplikace <phrase>AppArmor</phrase> chrání váš systém před možným zneužitím programů. Zakázání aplikace <phrase>AppArmor</phrase>, i když už byly nastaveny Vaše profily, odstraní z Vašeho systému ochranu. Chcete-li změnit stav aplikace <phrase>AppArmor</phrase>, spusťte YaST, vyberte <guimenu><phrase>AppArmor</phrase> Konfigurace</guimenu> a v hlavním okně klikněte na <guimenu>Nastavení</guimenu>.

source: <textobject role="description"><phrase>The <phrase>AppArmor</phrase> control panel</phrase> </textobject> <imageobject role="fo"> <imagedata format="PNG" fileref="sd_controlpanel_1.png" width="75%"/> </imageobject> <imageobject role="html"> <imagedata format="PNG" fileref="sd_controlpanel_1.png"/> </imageobject>
cs: <textobject role="description"><phrase>Ovládací panel <phrase>AppArmor</phrase></phrase> </textobject> <imageobject role="fo"> <imagedata format="PNG" fileref="sd_controlpanel_1.png" width="75%"/> </imageobject> <imageobject role="html"> <imagedata format="PNG" fileref="sd_controlpanel_1.png"/> </imageobject>

source: To change the status of <phrase>AppArmor</phrase>, continue as described in <xref xrefstyle="HeadingOnPage" linkend="sec.apparmor.yast.manage.status"/>. To change the mode of individual profiles, continue as described in <xref linkend="sec.apparmor.yast.manage.profmodes"/>.
cs: Chcete-li změnit stav aplikace <phrase>AppArmor</phrase>, pokračujte podle popisu v <xref xrefstyle="HeadingOnPage" linkend="sec.apparmor.yast.manage.status"/>. Chcete-li změnit režim jednotlivých profilů, pokračujte podle popisu v <xref linkend="sec.apparmor.yast.manage.profmodes"/>.

source: Changing <phrase>AppArmor</phrase> Status
cs: Změna stavu <phrase>AppArmor</phrase>

source: When you change the status of <phrase>AppArmor</phrase>, set it to enabled or disabled. When <phrase>AppArmor</phrase> is enabled, it is installed, running, and enforcing the <phrase>AppArmor</phrase> security policies.
cs: Změníte-li stav aplikace <phrase>AppArmor</phrase>, nastavte ji na povolenou nebo zakázanou. Pokud je aplikace <phrase>AppArmor</phrase> povolena, je nainstalována, spuštěna a jsou vynuceny bezpečnostní zásady <phrase>AppArmor</phrase>.

source: Start YaST, select <guimenu><phrase>AppArmor</phrase> Configuration</guimenu>, and click <guimenu>Settings</guimenu> in the main window.
cs: Spusťte YaST, vyberte <guimenu><phrase>AppArmor</phrase> Konfigurace</guimenu> a v hlavním okně klikněte na <guimenu>Nastavení</guimenu>.

source: Enable <phrase>AppArmor</phrase> by checking <guimenu>Enable <phrase>AppArmor</phrase></guimenu> or disable <phrase>AppArmor</phrase> by deselecting it.
cs: Povolte <phrase>AppArmor</phrase> zaškrtnutím <guimenu>Povolte <phrase>AppArmor</phrase></guimenu> nebo deaktivujte <phrase>AppArmor</phrase> zrušením jeho výběru.

source: Click <guimenu>Done</guimenu> in the <guimenu><phrase>AppArmor</phrase> Configuration</guimenu> window.
cs: V okně <guimenu>Konfigurace</guimenu> <phrase>AppArmor</phrase> klikněte <guimenu>Hotovo</guimenu>.

source: You always need to restart running programs to apply the profiles to them.
cs: Vždy je třeba restartovat spuštěné programy, aby se na ně aplikovaly profily.

source: Changing the Mode of Individual Profiles
cs: Změna režimu jednotlivých profilů
