Repository: openSUSE/doc-sle-translations
Catalog: */po/apparmor_profiles_man.*.po
Languages: cs

# _
source: translator-credits
cs: překladatelské kredity alkas alkas@volny.cz, 2016, 2020

source: Building Profiles from the Command Line
cs: Vytváření profilů z příkazového řádku

source: <phrase>AppArmor®</phrase> provides the user the ability to use a command line interface rather than a graphical interface to manage and configure the system security. Track the status of <phrase>AppArmor</phrase> and create, delete, or modify <phrase>AppArmor</phrase> profiles using the <phrase>AppArmor</phrase> command line tools.
cs: <phrase>AppArmor®</phrase> umožňuje uživateli použít ke správě a konfiguraci zabezpečení systému rozhraní příkazového řádku alternativně místo grafického rozhraní. Sledujte stav <phrase>AppArmor</phrase> a nástroji příkazového řádku <phrase>AppArmor</phrase> vytvářejte, odstraňujte nebo upravujte profily <phrase>AppArmor</phrase>.

source: Background Information
cs: Základní údaje

source: Before starting to manage your profiles using the <phrase>AppArmor</phrase> command line tools, check out the general introduction to <phrase>AppArmor</phrase> given in <xref linkend="cha.apparmor.concept"/> and <xref linkend="cha.apparmor.profiles"/>.
cs: Než začnete spravovat své profily nástroji příkazového řádku <phrase>AppArmor</phrase>, čtěte všeobecný úvod do <phrase>AppArmor</phrase> v <xref linkend="cha.apparmor.concept"/> a <xref linkend="cha.apparmor.profiles"/>.

source: Checking the <phrase>AppArmor</phrase> Status
cs: Kontrola stavu <phrase>AppArmor</phrase>

source: <phrase>AppArmor</phrase> can be in any one of three states:
cs: <phrase>AppArmor</phrase> může být v jednom ze tří stavů:

source: Unloaded
cs: Nezaveden

source: <phrase>AppArmor</phrase> is not activated in the kernel.
cs: <phrase>AppArmor</phrase> není v jádru systému aktivován.

source: Running
cs: Běžící

source: <phrase>AppArmor</phrase> is activated in the kernel and is enforcing <phrase>AppArmor</phrase> program policies.
cs: <phrase>AppArmor</phrase> je v jádru systému aktivován a vynucuje <phrase>AppArmor</phrase> zásady programů.

source: Stopped
cs: Pozastaven

source: <phrase>AppArmor</phrase> is activated in the kernel, but no policies are enforced.
cs: <phrase>AppArmor</phrase> je v jádru systému aktivován, ale nevynucuje žádné zásady.

source: Detect the state of <phrase>AppArmor</phrase> by inspecting <filename>/sys/kernel/security/apparmor/profiles</filename>. If <command>cat /sys/kernel/security/apparmor/profiles</command> reports a list of profiles, <phrase>AppArmor</phrase> is running. If it is empty and returns nothing, <phrase>AppArmor</phrase> is stopped. If the file does not exist, <phrase>AppArmor</phrase> is unloaded.
cs: Stav <phrase>AppArmoru</phrase> zjistíte prohlídkou souboru <filename>/sys/kernel/security/apparmor/profiles</filename>. Jastliže příkaz <command>cat /sys/kernel/security/apparmor/profiles</command> vypíše seznam profilů, pak <phrase>AppArmor</phrase> běží. Je-li seznam prázdný a nevypíše nic, pak je <phrase>AppArmor</phrase> zastaven. Neexistuje-li uvedený soubor, není <phrase>AppArmor</phrase> zaveden.

source: Manage <phrase>AppArmor</phrase> with <command>systemctl</command>. It lets you perform the following operations:
cs: Spravujte <phrase>AppArmor</phrase> příkazem <command>systemctl</command>. Může provádět tyto operace:

source: Behavior depends on the state of <phrase>AppArmor</phrase>. If it is not activated, <option>start</option> activates and starts it, putting it in the running state. If it is stopped, <option>start</option> causes the re-scan of <phrase>AppArmor</phrase> profiles usually found in <filename>/etc/apparmor.d</filename> and puts <phrase>AppArmor</phrase> in the running state. If <phrase>AppArmor</phrase> is already running, <option>start</option> reports a warning and takes no action.
cs: Chování závisí na stavu aplikace <phrase>AppArmor</phrase>. Pokud není aktivována, aktivuje se <option>start</option> a spustí ji, čímž se uvede do provozního stavu. Pokud je zastavena, způsobí <option>start</option> opětovné skenování profilů <phrase>AppArmor</phrase>, (které jsou obvykle v <filename>/etc/apparmor.d</filename>) a dá <phrase>AppArmor</phrase> do běžícího stavu. Pokud již aplikace <phrase>AppArmor</phrase> běží, ohlásí <option>start</option> výstrahu a neprovede žádnou akci.

source: Already Running Processes
cs: Procesy již běžící

source: Already running processes need to be restarted to apply the <phrase>AppArmor</phrase> profiles on them.
cs: Procesy, které už běžely, je třeba restartovat, aby se na ně profily <phrase>AppArmor</phrase> aplikovaly.

source: Stops <phrase>AppArmor</phrase> if it is running by removing all profiles from kernel memory, effectively disabling all access controls, and putting <phrase>AppArmor</phrase> into the stopped state. If the <phrase>AppArmor</phrase> is already stopped, <option>stop</option> tries to unload the profiles again, but nothing happens.
cs: Zastaví aplikaci <phrase>AppArmor</phrase>, pokud je spuštěna, odebráním všech profilů z paměti jádra (tedy deaktivací všech kontrol přístupu) a uvedením aplikace <phrase>AppArmor</phrase> do stop stavu. Pokud je již aplikace <phrase>AppArmor</phrase> zastavena, <option>stop</option> se pokusí profily znovu uvolnit, ale nic se nestane.

source: Causes the <phrase>AppArmor</phrase> module to re-scan the profiles in <filename>/etc/apparmor.d</filename> without unconfining running processes. Freshly created profiles are enforced and recently deleted ones are removed from the <filename>/etc/apparmor.d</filename> directory.
cs: Způsobí, že modul <phrase>AppArmor</phrase> znovu prohledá profily v <filename>/etc/apparmor.d</filename>, ale nezruší platná omezení běžících procesů. Nově vytvořené profily jsou vynuceny a mezitím zrušené profily jsou odstraněny z adresáře <filename>/etc/apparmor.d</filename>.

source: Building <phrase>AppArmor</phrase> Profiles
cs: Vytváření profilů <phrase>AppArmor</phrase>

source: The <phrase>AppArmor</phrase> module profile definitions are stored in the <filename>/etc/apparmor.d</filename> directory as plain text files. For a detailed description of the syntax of these files, refer to <xref linkend="cha.apparmor.profiles"/>.
cs: Definice profilů pro aplikaci <phrase>AppArmor</phrase> jsou uloženy v adresáři <filename>/etc/apparmor.d</filename> jako soubory v prostém textu. Detailní popis syntaxe těchto souborů je v <xref linkend="cha.apparmor.profiles"/>.

source: All files in the <filename>/etc/apparmor.d</filename> directory are interpreted as profiles and are loaded as such. Renaming files in that directory is not an effective way of preventing profiles from being loaded. You must remove profiles from this directory to prevent them from being read and evaluated effectively, or call <command>aa-disable</command> on the profile, which will create a symbolic link in <filename>/etc/apparmor.d/disabled/</filename>.
cs: Všechny soubory v adresáři <filename>/etc/apparmor.d</filename> jsou interpretovány jako profily a jako takové jsou načteny. Přejmenování souborů v tomto adresáři nezabrání načítání profilů. Profily musíte z tohoto adresáře odebrat, abyste zabránili jejich čtení a vyhodnocení, nebo volejte <command>aa-disable</command> pro profil, čímž ve <filename>/etc/apparmor.d/disabled/</filename> vytvoříte symbol zákazu aktivace profilů.

source: You can use a text editor, such as <command>vi</command>, to access and make changes to these profiles. The following sections contain detailed steps for building profiles:
cs: K přístupu k těmto profilům a provádění změn v nich můžete použít textový editor, například <command>vi</command>. Následující sekce obsahují podrobné kroky pro vytváření profilů:

source: Adding or Creating <phrase>AppArmor</phrase> Profiles
cs: Přidání nebo vytvoření profilů <phrase>AppArmor</phrase>

source: Refer to <xref linkend="sec.apparmor.commandline.add"/>
cs: Viz <xref linkend="sec.apparmor.commandline.add"/>

source: Editing <phrase>AppArmor</phrase> Profiles
cs: Úpravy profilů <phrase>AppArmor</phrase>

source: Refer to <xref linkend="sec.apparmor.commandline.edit"/>
cs: Viz <xref linkend="sec.apparmor.commandline.edit"/>

source: Deleting <phrase>AppArmor</phrase> Profiles
cs: Odstranění profilů <phrase>AppArmor</phrase>

source: Refer to <xref xrefstyle="SectTitleOnPage" linkend="sec.apparmor.commandline.del"/>
cs: Viz <xref xrefstyle="SectTitleOnPage" linkend="sec.apparmor.commandline.del"/>

source: Adding or Creating an <phrase>AppArmor</phrase> Profile
cs: Přidání či vytvoření profilu <phrase>AppArmor</phrase>

source: To add or create an <phrase>AppArmor</phrase> profile for an application, you can use a systemic or stand-alone profiling method, depending on your needs. Learn more about these two approaches in <xref linkend="sec.apparmor.commandline.profiling"/>.
cs: Chcete-li přidat nebo vytvořit profil aplikace <phrase>AppArmor</phrase> pro aplikaci, můžete použít systémovou nebo samostatnou metodu profilování v závislosti na vašich potřebách. Další informace o těchto dvou přístupech najdete v <xref linkend="sec.apparmor.commandline.profiling"/>.

source: Editing an <phrase>AppArmor</phrase> Profile
cs: Úprava profilu <phrase>AppArmor</phrase>

source: The following steps describe the procedure for editing an <phrase>AppArmor</phrase> profile:
cs: Následující kroky popisují postup úpravy profilu <phrase>AppArmor</phrase>:

source: If you are not currently logged in as <systemitem class="username">root</systemitem>, enter <command>su</command> in a terminal window.
cs: Pokud nejste momentálně přihlášeni jako <systemitem class="username">root</systemitem>, zadejte do okna terminálu příkaz <command>su</command>.

source: Enter the <systemitem class="username">root</systemitem> password when prompted.
cs: Po výzvě zadejte heslo uživatele <systemitem class="username">root</systemitem>.

source: Go to the profile directory with <command>cd /etc/apparmor.d/</command>.
cs: Přejděte do adresáře profilu příkazem <command>cd /etc/apparmor.d/</command>.

source: Enter <command>ls</command> to view all profiles currently installed.
cs: Chcete-li zobrazit všechny aktuálně nainstalované profily, zadejte <command>ls</command>.

source: Open the profile to edit in a text editor, such as vim.
cs: Otevřete profil a upravte jej v textovém editoru, například vim.

source: Make the necessary changes, then save the profile.
cs: Proveďte potřebné změny a poté profil uložte.

source: Restart <phrase>AppArmor</phrase> by entering <command>systemctl reload apparmor</command> in a terminal window.
cs: Restartujte <phrase>AppArmor</phrase> příkazem <command>systemctl reload apparmor</command> v terminálovém okně.

source: Unloading Unknown <phrase>AppArmor</phrase> Profiles
cs: Uvolnění neznámých profilů <phrase>AppArmor</phrase>

source: Danger of Unloading Wanted Profiles
cs: Nebezpečí uvolnění hledaných profilů

source: <command>aa-remove-unknown</command> will unload all profiles that are not stored in <filename>/etc/apparmor.d</filename>, for example automatically generated LXD profiles. This may compromise the security of the system. Use the <option>-n</option> parameter to list all profiles that will be unloaded.
cs: <command>aa-remove-unknown</command> uvolní všechny profily, které nejsou uloženy v <filename>/etc/apparmor.d</filename>, například automaticky generované profily LXD. To může ohrozit bezpečnost systému. Pomocí parametru <option>-n</option> vypište všechny profily, které budou uvolněny.

source: To unload all profiles that are no longer in <filename>/etc/apparmor.d/</filename> <phrase>AppArmor</phrase> profiles, run:
cs: Chcete-li uvolnit všechny profily, které již nejsou uloženy v <filename>/etc/apparmor.d/</filename> <phrase>AppArmor</phrase>, spusťte:

source: You can print a list of profiles that will be removed:
cs: Můžete vytisknout seznam profilů, které budou odstraněny:

source: Deleting an <phrase>AppArmor</phrase> Profile
cs: Smazání profilu <phrase>AppArmor</phrase>

source: The following steps describe the procedure for deleting an <phrase>AppArmor</phrase> profile.
cs: Následující kroky popisují postup pro odstranění profilu <phrase>AppArmor</phrase>.

source: Remove the <phrase>AppArmor</phrase> definition from the kernel:
cs: Odeberte z jádra definici <phrase>AppArmor</phrase>:

source: <prompt>tux &gt; </prompt><command>sudo</command> <command>apparmor_parser -R /etc/apparmor.d/<replaceable>PROFILE</replaceable></command>
cs: <prompt>tux &gt; </prompt><command>sudo</command> <command>apparmor_parser -R /etc/apparmor.d/<replaceable>PROFIL</replaceable></command>

source: Remove the definition file:
cs: Odebrat definiční soubor:

source: <prompt>tux &gt; </prompt><command>sudo</command> <command>rm /etc/apparmor.d/<replaceable>PROFILE</replaceable></command> <prompt>tux &gt; </prompt><command>sudo</command> <command>rm /var/lib/apparmor/cache/<replaceable>PROFILE</replaceable></command>
cs: <prompt>tux &gt; </prompt><command>sudo</command> <command>rm /etc/apparmor.d/<replaceable>PROFIL</replaceable></command> <prompt>tux &gt; </prompt><command>sudo</command> <command>rm /var/lib/apparmor/cache/<replaceable>PROFIL</replaceable></command>

source: Two Methods of Profiling
cs: Dvě metody profilování

source: Given the syntax for <phrase>AppArmor</phrase> profiles in <xref xrefstyle="SectTitleOnPage" linkend="cha.apparmor.profiles"/>, you could create profiles without using the tools. However, the effort involved would be substantial. To avoid such a situation, use the <phrase>AppArmor</phrase> tools to automate the creation and refinement of profiles.
cs: Vzhledem k syntaxi profilů <phrase>AppArmor</phrase> v <xref xrefstyle="SectTitleOnPage" linkend="cha.apparmor.profiles"/> můžete vytvořit profily bez použití nástrojů. Toto úsilí by však bylo značné. Chcete-li takové situaci předejít, použijte nástroje <phrase>AppArmor</phrase> k automatizaci vytváření a zdokonalování profilů.

source: There are two ways to approach <phrase>AppArmor</phrase> profile creation. Tools are available for both methods.
cs: Existují dva způsoby, jak přistupovat k vytváření profilů <phrase>AppArmor</phrase>. Jsou k dispozici nástroje pro obě metody.

source: Stand-Alone Profiling
cs: Samostatné profilování

source: A method suitable for profiling small applications that have a finite runtime, such as user client applications like mail clients. For more information, refer to <xref linkend="sec.apparmor.commandline.profiling.stand-alone"/>.
cs: Je to metoda vhodná pro profilování malých aplikací, které mají omezenou dobu běhu, například uživatelské klientské aplikace jako jsou poštovní klienty. Další informace najdete v <xref linkend="sec.apparmor.commandline.profiling.stand-alone"/>.

source: Systemic Profiling
cs: Systémové profilování

source: A method suitable for profiling many programs at once and for profiling applications that may run for days, weeks, or continuously across reboots, such as network server applications like Web servers and mail servers. For more information, refer to <xref linkend="sec.apparmor.commandline.profiling.systemic"/>.
cs: Metoda vhodná pro profilování mnoha programů najednou a pro profilování aplikací, které mohou běžet dny, týdny nebo nepřetržitě i přes restartování, jako jsou například aplikace síťových serverů, jako jsou webové servery a poštovní servery. Další informace naleznete v <xref linkend="sec.apparmor.commandline.profiling.systemic"/>.

source: Automated profile development becomes more manageable with the <phrase>AppArmor</phrase> tools:
cs: Automatizovaný návrh profilu je lépe zvládnutelný pomocí nástrojů <phrase>AppArmor</phrase>:

source: Decide which profiling method suits your needs.
cs: Rozhodněte se, která metoda profilování vyhovuje vašim potřebám.

source: Perform a static analysis. Run either <command>aa-genprof</command> or <command>aa-autodep</command>, depending on the profiling method chosen.
cs: Proveďte statickou analýzu. Spusťte buď <command>aa-genprof</command> nebo <command>aa-autodep</command> v závislosti na zvolené metodě profilování.

source: Enable dynamic learning. Activate learning mode for all profiled programs.
cs: Povolit dynamické učení. Aktivujte režim učení pro všechny profilované programy.

source: Stand-alone profile generation and improvement is managed by a program called <command>aa-genprof</command>. This method is easy because <command>aa-genprof</command> takes care of everything, but is limited because it requires <command>aa-genprof</command> to run for the entire duration of the test run of your program (you cannot reboot the machine while you are still developing your profile).
cs: Samostatné vytváření a zlepšování profilu je řízeno programem s názvem <command>aa-genprof</command>. Tato metoda je snadná, protože <command>aa-genprof</command> se stará o všechno, ale je omezená, protože vyžaduje, aby program <command>aa-genprof</command> běžel po celou dobu zkušebního běhu vašeho programu (nemůžete restartovat počítač, dokud stále vyvíjíte svůj profil).

source: To use <command>aa-genprof</command> for the stand-alone method of profiling, refer to <xref linkend="sec.apparmor.commandline.profiling.summary.genprof"/>.
cs: Chcete-li použít <command>aa-genprof</command> pro samostatnou metodu profilování, vizte <xref linkend="sec.apparmor.commandline.profiling.summary.genprof"/>.

source: This method is called <emphasis>systemic profiling</emphasis> because it updates all of the profiles on the system at once, rather than focusing on the one or few targeted by <command>aa-genprof</command> or stand-alone profiling. With systemic profiling, profile construction and improvement are somewhat less automated, but more flexible. This method is suitable for profiling long-running applications whose behavior continues after rebooting, or many programs at once.
cs: Tato metoda se nazývá <emphasis>systémové profilování</emphasis>, protože aktualizuje všechny profily v systému najednou, nezaměřuje se na jeden nebo několik cílených <command>aa-genprof</command> nebo samostatné profilování. Při systémovém profilování je konstrukce a zlepšování profilů poněkud méně automatizované, ale flexibilnější. Tato metoda je vhodná pro profilování dlouho běžících aplikací, jejichž činnost pokračuje i po restartu, nebo pro mnoho programů najednou.

source: Build an <phrase>AppArmor</phrase> profile for a group of applications as follows:
cs: Profil <phrase>AppArmor</phrase> pro skupinu aplikací vytvořte takto:

source: Create profiles for the individual programs that make up your application.
cs: Vytvořte profily pro jednotlivé programy, které tvoří vaši aplikaci.

source: Although this approach is systemic, <phrase>AppArmor</phrase> only monitors those programs with profiles and their children. To get <phrase>AppArmor</phrase> to consider a program, you must at least have <command>aa-autodep</command> create an approximate profile for it. To create this approximate profile, refer to <xref linkend="sec.apparmor.commandline.profiling.summary.autodep"/>.
cs: Přestože je tento přístup systémový, <phrase>AppArmor</phrase> sleduje pouze programy s profily a programy jimi spuštěné. Chcete-li, aby aplikace <phrase>AppArmor</phrase> uvažovala o programu, musíte pro ni vytvořit alespoň přibližný profil programem <command>aa-autodep</command>. Chcete-li vytvořit tento přibližný profil, vizte <xref linkend="sec.apparmor.commandline.profiling.summary.autodep"/>.

source: Put relevant profiles into learning or complain mode.
cs: Přepněte příslušné profily do režimu učení nebo stěžování.

source: Activate learning or complain mode for all profiled programs by entering
cs: Aktivujte režim učení nebo stěžování pro všechny profilované programy zadáním

source: in a terminal window while logged in as <systemitem class="username">root</systemitem>. This functionality is also available through the YaST Profile Mode module, described in <xref linkend="sec.apparmor.yast.manage.profmodes"/>.
cs: do okna terminálu při přihlášení jako <systemitem class="username">root</systemitem>. Tato funkce je k dispozici také prostřednictvím modulu YaST Profile Mode, popsaného v <xref linkend="sec.apparmor.yast.manage.profmodes"/>.

source: When in learning mode, access requests are not blocked, even if the profile dictates that they should be. This enables you to run through several tests (as shown in <xref linkend="st.apparmor.commandline.profiling.systemic.exec"/>) and learn the access needs of the program so it runs properly. With this information, you can decide how secure to make the profile.
cs: V režimu učení nejsou požadavky na přístup blokovány, i když profil diktuje, že by měly být. To vám umožní absolvovat několik testů (jak je uvedeno v <xref linkend="st.apparmor.commandline.profiling.systemic.exec"/>) a naučit se přístupové potřeby programu, takže běží správně. Na základě těchto informací se můžete rozhodnout, jak bezpečný profil vytvořit.

source: Refer to <xref linkend="sec.apparmor.commandline.profiling.summary.complain"/> for more detailed instructions for using learning or complain mode.
cs: Podrobnější pokyny pro používání režimu učení nebo stěžování najdete v <xref linkend="sec.apparmor.commandline.profiling.summary.complain"/>.

source: Exercise your application.
cs: Vyzkoušejte svou aplikaci.

source: Run your application and exercise its functionality. How much to exercise the program is up to you, but you need the program to access each file representing its access needs. Because the execution is not being supervised by <command>aa-genprof</command>, this step can go on for days or weeks and can span complete system reboots.
cs: Spusťte aplikaci a vyzkoušejte její funkčnost. Kolik zkoušek programu, to záleží na vás, ale potřebujete, aby program zkusil přístup ke každému souboru, který potřebuje. Protože provádění není pod dohledem <command>aa-genprof</command>, může tento krok trvat několik dní nebo týdnů a může přetrvat i po úplném restartu systému.

source: Analyze the log.
cs: Analyzujte záznam.

source: In systemic profiling, run <command>aa-logprof</command> directly instead of letting <command>aa-genprof</command> run it (as in stand-alone profiling). The general form of <command>aa-logprof</command> is:
cs: V systémovém profilování spusťte <command>aa-logprof</command> přímo místo toho, abyste jej nechali spustit programem <command>aa-genprof</command> (jako v samostatném profilování). Obecná forma <command>aa-logprof</command> je:

source: <prompt>tux &gt; </prompt><command>sudo</command> aa-logprof [ -d <replaceable>/path/to/profiles</replaceable> ] [ -f <replaceable>/path/to/logfile</replaceable> ]
cs: <prompt>tux &gt; </prompt><command>sudo</command> aa-logprof [ -d <replaceable>/cesta/k/profilům</replaceable> ] [ -f <replaceable>/cesta/k/souboru_záznamu</replaceable> ]

source: Refer to <xref linkend="sec.apparmor.commandline.profiling.summary.logprof"/> for more information about using <command>aa-logprof</command>.
cs: Více údajů o používání <command>aa-logprof</command> viz <xref linkend="sec.apparmor.commandline.profiling.summary.logprof"/>.

source: Repeat <xref linkend="st.apparmor.commandline.profiling.systemic.exec"/> and <xref linkend="st.apparmor.commandline.profiling.systemic.log"/>.
cs: Opakujte <xref linkend="st.apparmor.commandline.profiling.systemic.exec"/> a <xref linkend="st.apparmor.commandline.profiling.systemic.log"/>.

source: This generates optimal profiles. An iterative approach captures smaller data sets that can be trained and reloaded into the policy engine. Subsequent iterations generate fewer messages and run faster.
cs: Tak vytváříte optimální profily. Iterativní přístup zachycuje menší soubory dat, které lze bezpečnostně upravit a znovu načíst do modulu zásad. Další iterace generují méně zpráv a běží rychleji.

source: Edit the profiles.
cs: Úprava profilů.
