Repository: openSUSE/doc-sle-translations
Catalog: */po/apparmor_start.*.po
Languages: cs

# _
source: translator-credits
cs: překladatelské kredity alkas alkas@volny.cz, 2016, 2020

source: Getting Started
cs: Začínáme

source: Prepare a successful deployment of <phrase>AppArmor</phrase> on your system by carefully considering the following items:
cs: Připravte úspěšné nasazení aplikace <phrase>AppArmor</phrase> do vašeho systému pečlivým zvážením těchto položek:

source: Determine the applications to profile. Read more on this in <xref linkend="sec.apparmor.start.choose"/>.
cs: Určete aplikace, jimž vytvoříte profil. Více k tomu najdete na <xref linkend="sec.apparmor.start.choose"/>.

source: Build the needed profiles as roughly outlined in <xref linkend="sec.apparmor.start.build"/>. Check the results and adjust the profiles when necessary.
cs: Vytvořte potřebné profily, jak je načrtnuto v <xref linkend="sec.apparmor.start.build"/>. Zkontrolujte výsledky a podle potřeby upravte profily.

source: Update your profiles whenever your environment changes or you need to react to security events logged by the reporting tool of <phrase>AppArmor</phrase>. Refer to <xref linkend="sec.apparmor.start.update"/>.
cs: Aktualizujte profily, kdykoli se změní prostředí nebo musíte reagovat na bezpečnostní události zapsané nástrojem ohlašování <phrase>AppArmor</phrase>. Viz <xref linkend="sec.apparmor.start.update"/>.

source: Installing <phrase>AppArmor</phrase>
cs: Instalace <phrase>AppArmor</phrase>

source: <phrase>AppArmor</phrase> is installed and running on any installation of <phrase role="productname"><phrase os="osuse">openSUSE® Leap</phrase><phrase os="sles">SUSE® Linux Enterprise Server</phrase><phrase os="sled">SUSE® Linux Enterprise Desktop</phrase></phrase> by default, regardless of what patterns are installed. The packages listed below are needed for a fully-functional instance of <phrase>AppArmor</phrase>:
cs: <phrase>AppArmor</phrase> je instalován a standardně běží na kterékoli instalaci <phrase role="productname"><phrase os="osuse">openSUSE® Leap</phrase><phrase os="sles">SUSE® Linux Enterprise Server</phrase><phrase os="sled">SUSE® Linux Enterprise Desktop</phrase></phrase>, ať jsou instalační šablony jakékoli. Pro plně funkční instanci <phrase>AppArmor</phrase> jsou potřebné tyto balíčky:

source: If <phrase>AppArmor</phrase> is not installed on your system, install the pattern <systemitem class="resource">apparmor</systemitem> for a complete <phrase>AppArmor</phrase> installation. Either use the YaST Software Management module for installation, or use Zypper on the command line:
cs: Není-li <phrase>AppArmor</phrase> na Vašem systému instalován, instalujte úplnou sestavu <phrase>AppArmor</phrase> dle šablony <systemitem class="resource">apparmor</systemitem>. Použijte buď modul YaST Software Management (správa softwaru YaST), nebo Zypper z příkazového řádku:

source: Enabling and Disabling <phrase>AppArmor</phrase>
cs: Zapnutí a vypnutí <phrase>AppArmor</phrase>

source: <phrase>AppArmor</phrase> is configured to run by default on any fresh installation of <phrase role="productname"><phrase os="osuse">openSUSE Leap</phrase><phrase os="sles">SUSE Linux Enterprise Server</phrase><phrase os="sled">SUSE Linux Enterprise Desktop</phrase></phrase>. There are two ways of toggling the status of <phrase>AppArmor</phrase>:
cs: <phrase>AppArmor</phrase> je standardně konfigurován, aby běžel na jakékoli čerstvé instalaci <phrase role="productname"><phrase os="osuse">openSUSE Leap</phrase><phrase os="sles">SUSE Linux Enterprise Server</phrase><phrase os="sled">SUSE Linux Enterprise Desktop</phrase></phrase>. Přepnout stav <phrase>AppArmor</phrase> lze dvěma způsoby:

source: Using YaST Services Manager
cs: Použít Správce služeb YaST

source: Disable or enable <phrase>AppArmor</phrase> by removing or adding its boot script to the sequence of scripts executed on system boot. Status changes are applied on reboot.
cs: Zakažte nebo povolte <phrase>AppArmor</phrase> odebráním nebo přidáním spouštěcího skriptu do sekvence skriptů prováděných při spouštění systému. Změny stavu se použijí při restartu.

source: Using <phrase>AppArmor</phrase> Configuration Window
cs: Použití konfiguračního okna <phrase>AppArmor</phrase>

source: Toggle the status of <phrase>AppArmor</phrase> in a running system by switching it off or on using the YaST <phrase>AppArmor</phrase> Control Panel. Changes made here are applied instantaneously. The Control Panel triggers a stop or start event for <phrase>AppArmor</phrase> and removes or adds its boot script in the system's boot sequence.
cs: Změňte stav <phrase>AppArmor</phrase> v běžícím systému jeho vypnutím nebo zapnutím na ovládacím panelu YaST <phrase>AppArmor</phrase>. Změny provedené zde se projeví okamžitě. Ovládací panel spustí událost zastavení nebo spuštění aplikace <phrase>AppArmor</phrase> a odebere nebo přidá jeho spouštěcí skript do spouštěcí sekvence systému.

source: To disable <phrase>AppArmor</phrase> permanently (by removing it from the sequence of scripts executed on system boot) proceed as follows:
cs: Chcete-li trvale zakázat aplikaci <phrase>AppArmor</phrase> (odstraněním ze sekvence skriptů provedených při spuštění systému), postupujte takto:

source: Start YaST.
cs: Spusťte YaST.

source: Select <menuchoice> <guimenu>System</guimenu> <guimenu>Services Manager</guimenu> </menuchoice>.
cs: Zvolte <menuchoice> <guimenu>Systém</guimenu> <guimenu>Správce služeb</guimenu> </menuchoice>.

source: Mark <literal>apparmor</literal> by clicking its row in the list of services, then click <guimenu>Enable/Disable</guimenu> in the lower part of the window. Check that <guimenu>Enabled</guimenu> changed to <guimenu>Disabled</guimenu> in the <literal>apparmor</literal> row.
cs: Označte <literal>apparmor</literal> kliknutím na jeho řádek v seznamu služeb a poté v dolní části okna klikněte na <guimenu>Povolit|Zakázat</guimenu>. Zkontrolujte, zda se v řádku <literal>apparmor</literal> změnil parametr <guimenu>Povoleno</guimenu> na <guimenu>Zakázáno</guimenu>.

source: Confirm with <guimenu>OK</guimenu>.
cs: Potvrďte kliknutím <guimenu>OK</guimenu>.

source: <phrase>AppArmor</phrase> will not be initialized on reboot, and stays inactive until you re-enable it. Re-enabling a service using the YaST <guimenu>Services Manager</guimenu> tool is similar to disabling it.
cs: <phrase>AppArmor</phrase> nebude při restartu inicializován a zůstane neaktivní, dokud ho znovu neaktivujete. Opětovné povolení služby pomocí nástroje YaST <guimenu>Správce služeb</guimenu> je podobné deaktivaci.

source: Toggle the status of <phrase>AppArmor</phrase> in a running system by using the <phrase>AppArmor</phrase> Configuration window. These changes take effect when you apply them and survive a reboot of the system. To toggle the status of <phrase>AppArmor</phrase>, proceed as follows:
cs: Pomocí konfiguračního okna <phrase>AppArmor</phrase> v běžícím systému přepněte stav aplikace <phrase>AppArmor</phrase>. Tyto změny se projeví, když je použijete a přežijete restartování systému. Chcete-li přepnout stav aplikace <phrase>AppArmor</phrase>, postupujte takto:

source: Start YaST, select <guimenu><phrase>AppArmor</phrase> Configuration</guimenu>, and click <guimenu>Settings</guimenu> in the main window.
cs: Spusťte YaST, vyberte <guimenu><phrase>AppArmor</phrase> Konfigurace</guimenu> a v hlavním okně klikněte na <guimenu>Nastavení</guimenu>.

source: Enable <phrase>AppArmor</phrase> by checking <guimenu>Enable <phrase>AppArmor</phrase></guimenu> or disable <phrase>AppArmor</phrase> by deselecting it.
cs: Povolte <phrase>AppArmor</phrase> zaškrtnutím <guimenu>Povolte <phrase>AppArmor</phrase></guimenu> nebo deaktivujte <phrase>AppArmor</phrase> zrušením jeho výběru.

source: Click <guimenu>Done</guimenu> in the <guimenu><phrase>AppArmor</phrase> Configuration</guimenu> window.
cs: V okně <guimenu>Konfigurace</guimenu> <phrase>AppArmor</phrase> klikněte <guimenu>Hotovo</guimenu>.

source: Choosing Applications to Profile
cs: Volba aplikací pro profil

source: You only need to protect the programs that are exposed to attacks in your particular setup, so only use profiles for those applications you actually run. Use the following list to determine the most likely candidates:
cs: Potřebujete chránit jen ty programy, které jsou vystaveny útokům při Vašem konkrétním nastavení, takže profily používejte pouze pro ty aplikace, které skutečně spouštíte. K určení nejpravděpodobnějších kandidátů použijte seznam:

source: Network Agents
cs: Síťové agenty

source: Web Applications
cs: Webové aplikace

source: Cron Jobs
cs: Úlohy spouštěné přes Cron

source: To find out which processes are currently running with open network ports and might need a profile to confine them, run <command>aa-unconfined</command> as <systemitem class="username">root</systemitem>.
cs: Chcete-li zjistit, které procesy jsou právě spuštěny s otevřenými síťovými porty a mohou potřebovat profil, který je omezuje, spusťte <command>aa-unconfined</command> jako uživatel <systemitem class="username">root</systemitem>.

source: Output of <command>aa-unconfined</command>
cs: Příklad výstupu příkazu <command>aa-unconfined</command>

source: 19848 /usr/sbin/cupsd not confined 19887 /usr/sbin/sshd not confined 19947 /usr/lib/postfix/master not confined 1328 /usr/sbin/smbd confined by '/usr/sbin/smbd (enforce)'
cs: 19848 /usr/sbin/cupsd not confined [neomezen] 19887 /usr/sbin/sshd not confined [neomezen] 19947 /usr/lib/postfix/master not confined [neomezen] 1328 /usr/sbin/smbd confined [omezen] by '/usr/sbin/smbd (enforce) [vynuceno]

source: Each of the processes in the above example labeled <literal>not confined</literal> might need a custom profile to confine it. Those labeled <literal>confined by</literal> are already protected by <phrase>AppArmor</phrase>.
cs: Každý z procesů ve výše uvedeném příkladu, označený <literal>neomezen</literal>, může vyžadovat uživatelský profil, aby jej omezil. Ty, které jsou označeny <literal>omezen</literal>, jsou již chráněny programem <phrase>AppArmor</phrase>.

source: For More Information
cs: Další informace

source: For more information about choosing the right applications to profile, refer to <xref linkend="sec.apparmor.concept.determine"/>.
cs: Další informace o správné volbě aplikace pro profil najdete na <xref linkend="sec.apparmor.concept.determine"/>.

source: Building and Modifying Profiles
cs: Vytváření a úpravy profilů

source: <phrase>AppArmor</phrase> on <phrase role="productname"><phrase os="osuse">openSUSE Leap</phrase><phrase os="sles">SUSE Linux Enterprise Server</phrase><phrase os="sled">SUSE Linux Enterprise Desktop</phrase></phrase> ships with a preconfigured set of profiles for the most important applications. In addition, you can use <phrase>AppArmor</phrase> to create your own profiles for any application you want.
cs: <phrase>AppArmor</phrase> na <phrase role="productname"><phrase os="osuse">openSUSE Leap</phrase><phrase os="sles">SUSE Linux Enterprise Server</phrase><phrase os="sled">SUSE Linux Enterprise Desktop</phrase></phrase> se dodává s předkonfigurovanou sadou profilů pro nejdůležitější aplikace. Kromě toho můžete pomocí aplikace <phrase>AppArmor</phrase> vytvořit své vlastní profily pro jakoukoli aplikaci, kterou chcete omezit.

source: There are two ways of managing profiles. One is to use the graphical front-end provided by the YaST <phrase>AppArmor</phrase> modules and the other is to use the command line tools provided by the <phrase>AppArmor</phrase> suite itself. The main difference is that YaST supports only basic functionality for <phrase>AppArmor</phrase> profiles, while the command line tools let you update/tune the profiles in a more fine-grained way.
cs: Existují dva způsoby správy profilů. První je použití grafického rozhraní poskytovaného moduly YaST <phrase>AppArmor</phrase> a druhý je použití nástrojů příkazového řádku poskytovaných samotnou sadou <phrase>AppArmor</phrase>. Hlavní rozdíl spočívá v tom, že YaST podporuje pouze základní funkce profilů <phrase>AppArmor</phrase>, zatímco nástroje příkazového řádku umožňují aktualizovat či vyladit profily jemnějším způsobem.

source: For each application, perform the following steps to create a profile:
cs: Pro každou aplikaci vytvořte profil tímto postupem:

source: As <systemitem class="username">root</systemitem>, let <phrase>AppArmor</phrase> create a rough outline of the application's profile by running <command>aa-genprof</command> <replaceable>PROGRAM_NAME</replaceable>.
cs: Jako uživatel <systemitem class="username">root</systemitem> nechte <phrase>AppArmor</phrase> vytvořit první nárys profilu aplikace příkazem <command>aa-genprof</command> <replaceable>NÁZEV_PROGRAMU</replaceable>.

source: <emphasis>or</emphasis>
cs: <emphasis>nebo</emphasis>

source: Outline the basic profile by running <menuchoice> <guimenu>YaST</guimenu> <guimenu>Security and Users</guimenu> <guimenu><phrase>AppArmor</phrase> Configuration</guimenu> <guimenu>Manually Add Profile</guimenu> </menuchoice> and specifying the complete path to the application you want to profile.
cs: Navrhněte základ profilu pomocí <menuchoice> <guimenu>YaST</guimenu> <guimenu>Security and Users</guimenu> <guimenu><phrase>AppArmor</phrase> Konfigurace</guimenu> <guimenu>Přidat profil ručně</guimenu> </menuchoice> a zadat úplnou cestu k aplikaci, k níž chcete profil vytvořit.

source: A new basic profile is outlined and put into learning mode, which means that it logs any activity of the program you are executing, but does not yet restrict it.
cs: Tím je nový základní profil připraven a spuštěn v režimu učení, což znamená, že zaznamenává jakoukoli aktivitu programu, který provádíte, ale ještě jej neomezuje.

source: Run the full range of the application's actions to let <phrase>AppArmor</phrase> get a very specific picture of its activities.
cs: Spusťte úplný sortiment akcí aplikace a nechte program <phrase>AppArmor</phrase> získat velmi konkrétní obrázek o jejích činnostech.

source: Let <phrase>AppArmor</phrase> analyze the log files generated in <xref linkend="st.genprof2"/> by typing <keycap>S</keycap> in aa-genprof.
cs: Nechte <phrase>AppArmor</phrase> analyzovat soubory protokolů vytvořené v <xref linkend="st.genprof2"/> zadáním <keycap>S</keycap> do aa-genprof.

source: <phrase>AppArmor</phrase> scans the logs it recorded during the application's run and asks you to set the access rights for each event that was logged. Either set them for each file or use globbing.
cs: <phrase>AppArmor</phrase> prohledá protokoly zaznamenané při běhu aplikace a požádá vás o nastavení přístupových práv pro každou zaznamenanou událost. Buď práva nastavte pro každý soubor, nebo použijte globbing.

source: Depending on the complexity of your application, it might be necessary to repeat <xref linkend="st.genprof2"/> and <xref linkend="st.genprof3"/>. Confine the application, exercise it under the confined conditions, and process any new log events. To properly confine the full range of an application's capabilities, you might be required to repeat this procedure often.
cs: V závislosti na složitosti vaší aplikace může být nutné opakovat <xref linkend="st.genprof2"/> a <xref linkend="st.genprof3"/>. Omezte aplikaci, spusťte ji za omezujících podmínek a zpracujte všechny nové události protokolu. Chcete-li správně omezit celý sortiment možností aplikace, může být potřebné tento postup často opakovat.

source: When you finish <command>aa-genprof</command>, your profile is set to enforce mode. The profile is applied and <phrase>AppArmor</phrase> restricts the application according to it.
cs: Po dokončení <command>aa-genprof</command> je váš profil nastaven na vynucený režim. Profil je použit a aplikace <phrase>AppArmor</phrase> omezuje aplikaci podle něj.

source: If you started <command>aa-genprof</command> on an application that had an existing profile that was in complain mode, this profile remains in learning mode upon exit of this learning cycle. For more information about changing the mode of a profile, refer to <xref linkend="sec.apparmor.commandline.profiling.summary.complain"/> and <xref linkend="sec.apparmor.commandline.profiling.summary.enforce"/>.
cs: Spustíte-li <command>aa-genprof</command> na aplikaci, která měla existující profil, který byl v režimu stížnosti, zůstává tento profil v režimu učení až do konce tohoto cyklu učení. Další informace o změně režimu profilu naleznete na stránkách <xref linkend="sec.apparmor.commandline.profiling.summary.complain"/> a <xref linkend="sec.apparmor.commandline.profiling.summary.enforce"/>.

source: Test your profile settings by performing every task you need with the application you confined. Normally, the confined program runs smoothly and you do not notice <phrase>AppArmor</phrase> activities. However, if you notice certain misbehavior with your application, check the system logs and see if <phrase>AppArmor</phrase> is too tightly confining your application. Depending on the log mechanism used on your system, there are several places to look for <phrase>AppArmor</phrase> log entries:
cs: Otestujte nastavení svého profilu provedením všech úkolů, které potřebujete, s aplikací, kterou jste omezili. Normálně je omezený program spuštěn hladce a aktivit <phrase>AppArmor</phrase> si ani nevšimnete. Pokud si však v aplikaci všimnete určitého nesprávného chování, zkontrolujte systémové protokoly a zjistěte, zda aplikace <phrase>AppArmor</phrase> vaši aplikaci příliš neomezuje. V závislosti na mechanismu protokolování, používaném ve vašem systému, existuje několik míst, kde můžete vyhledat položky protokolu <phrase>AppArmor</phrase>:

source: The command <command>journalctl | grep -i apparmor</command>
cs: Příkaz <command>journalctl | grep -i apparmor</command>

source: The command <command>dmesg -T</command>
cs: Příkaz <command>dmesg -T</command>

source: To adjust the profile, analyze the log messages relating to this application again as described in <xref linkend="sec.apparmor.commandline.profiling.summary.logprof"/>. Determine the access rights or restrictions when prompted.
cs: Chcete-li upravit profil, analyzujte zprávy protokolu týkajícího se této aplikace znovu, jak je popsáno v <xref linkend="sec.apparmor.commandline.profiling.summary.logprof"/>. Po vyzvání určete přístupová práva nebo omezení.

source: For more information about profile building and modification, refer to <xref linkend="cha.apparmor.profiles"/>, <xref linkend="cha.apparmor.yast"/>, and <xref linkend="cha.apparmor.commandline"/>.
cs: Více informací o tvorbě a úpravách profilu najdete na <xref linkend="cha.apparmor.profiles"/>, <xref linkend="cha.apparmor.yast"/> a <xref linkend="cha.apparmor.commandline"/>.

source: Updating Your Profiles
cs: Úpravy Vašich profilů

source: Software and system configurations change over time. As a result, your profile setup for <phrase>AppArmor</phrase> might need some fine-tuning from time to time. <phrase>AppArmor</phrase> checks your system log for policy violations or other <phrase>AppArmor</phrase> events and lets you adjust your profile set accordingly. Any application behavior that is outside of any profile definition can be addressed by <command>aa-logprof</command>. For more information, see <xref linkend="sec.apparmor.commandline.profiling.summary.logprof"/>.
cs: Konfigurace softwaru a systému se v průběhu času mění. Výsledkem je, že nastavení vašeho profilu pro <phrase>AppArmor</phrase> bude občas vyžadovat jemné doladění. <phrase>AppArmor</phrase> zkontroluje, zda v systémovém protokolu není porušení zásad nebo jiné události <phrase>AppArmor</phrase> a umožní odpovídajícím způsobem upravit nastavení vašeho profilu. Každé chování aplikace, které je mimo definici profilu, lze vyřešit pomocí <command>aa-logprof</command>. Další informace viz<xref linkend="sec.apparmor.commandline.profiling.summary.logprof"/>.
