Repository: openSUSE/doc-sle-translations
Catalog: */po/apparmor_profiles_man.*.po
Languages: cs

source: To ignore the existing profile, press <keycap>C</keycap> (<guimenu>Create New Profile</guimenu>) and follow the profile generation procedure outlined above to create the profile from scratch.
cs: Chcete-li ignorovat existující profil, stiskněte klávesu <keycap>C</keycap> (<guimenu>Create New Profile</guimenu>) a podle výše uvedeného postupu vytváření profilu vytvořte profil od začátku.

source: Leave <command>aa-genprof</command> by pressing <keycap>F</keycap> (<guimenu>Finish</guimenu>) when you are done and save your changes.
cs: Po dokončení opusťte <command>aa-genprof</command> stisknutím <keycap>F</keycap> (<guimenu>Finish</guimenu>) a uložte změny.

source: aa-logprof—Scanning the System Log
cs: aa-logprof — Skenování systémového žurnálu

source: <command>aa-logprof</command> is an interactive tool used to review the complain and enforce mode events found in the log entries in <filename>/var/log/audit/audit.log</filename>, or directly in the <systemitem class="daemon">systemd</systemitem> journal (see <xref linkend="cha.journalctl"/>), and generate new entries in <phrase>AppArmor</phrase> security profiles.
cs: <command>aa-logprof</command> je interaktivní nástroj používaný k prohlížení událostí, vzniklých v režimech stížností a vynucování, nalezených v položkách protokolu ve <filename>/var/log/audit/audit.log</filename> nebo přímo v žurnálu <systemitem class="daemon">systemd</systemitem> (viz <xref linkend="cha.journalctl"/>). Generuje nové položky v bezpečnostních profilech <phrase>AppArmor</phrase>.

source: When you run <command>aa-logprof</command>, it begins to scan the log files produced in complain and enforce mode and, if there are new security events that are not covered by the existing profile set, it gives suggestions for modifying the profile. <command>aa-logprof</command> uses this information to observe program behavior.
cs: Když spustíte příkaz <command>aa-logprof</command>, začne skenovat soubory protokolu, vytvořené v režimech stěžování a vynucení, a pokud existují nové bezpečnostní události, které nejsou pokryty existující sadou profilů, dává návrhy na úpravu profilu. <command>aa-logprof</command> používá tyto informace ke sledování chování programu.

source: If a confined program forks and executes another program, <command>aa-logprof</command> sees this and asks the user which execution mode should be used when launching the child process. The execution modes <emphasis>ix</emphasis>, <emphasis>px</emphasis>, <emphasis>Px</emphasis>, <emphasis>ux</emphasis>, <emphasis>Ux</emphasis>, <emphasis>cx</emphasis>, <emphasis>Cx</emphasis>, and named profiles, are options for starting the child process. If a separate profile exists for the child process, the default selection is <emphasis>Px</emphasis>. If one does not exist, the profile defaults to <emphasis>ix</emphasis>. Child processes with separate profiles have <command>aa-autodep</command> run on them and are loaded into <phrase>AppArmor</phrase>, if it is running.
cs: Rozvětvuje-li se program, omezený profilem, a spouští jiný program, <command>aa-logprof</command> to zjistí a zeptá se uživatele, který režim provedení by měl být použit při spuštění podřízeného procesu. Možnosti pro zahájení podřízeného procesu (režimy jeho provádění) jsou: <emphasis>ix</emphasis>, <emphasis>px</emphasis>, <emphasis>Px</emphasis>, <emphasis>ux</emphasis>, <emphasis>Ux</emphasis>, <emphasis>cx</emphasis>, <emphasis>Cx</emphasis> a pojmenované profily. Pokud pro podřízený proces existuje samostatný profil, výchozí výběr je <emphasis>Px</emphasis>. Pokud neexistuje, bude výchozí možnost <emphasis>ix</emphasis>. Podřízené procesy se samostatnými profily mají pro sebe spuštěn <command>aa-autodep</command> a pokud běží, jsou načteny do <phrase>AppArmor</phrase>.

source: When <command>aa-logprof</command> exits, profiles are updated with the changes. If <phrase>AppArmor</phrase> is active, the updated profiles are reloaded and, if any processes that generated security events are still running in the null-XXXX profiles (unique profiles temporarily created in complain mode), those processes are set to run under their proper profiles.
cs: Když <command>aa-logprof</command> skončí, profily se aktualizují změnami. Je-li aktivní <phrase>AppArmor</phrase>, aktualizované profily jsou znovu načteny a pokud všechny procesy, které generovaly bezpečnostní události, stále běží v profilech null-XXXX (jedinečné profily dočasně vytvořené v režimu stížnosti), jsou tyto procesy nastaveny tak, aby běžely pod svými správnými profily.

source: To run <command>aa-logprof</command>, enter <command>aa-logprof</command> into a terminal window while logged in as <systemitem class="username">root</systemitem>. The following options can be used for <command>aa-logprof</command>:
cs: Chcete-li spustit příkaz <command>aa-logprof</command>, zadejte do příkazového řádku <command>aa-logprof</command> a přihlaste se jako <systemitem class="username">root</systemitem>. Pro <command>aa-logprof</command> lze použít následující možnosti:

source: <command>aa-logprof -d</command><replaceable>/path/to/profile/directory/</replaceable>
cs: <command>aa-logprof -d</command><replaceable>/cesta/k/adresáři/profilů/</replaceable>

source: Specifies the full path to the location of the profiles if the profiles are not located in the standard directory, <filename>/etc/apparmor.d/</filename>.
cs: Určuje úplnou cestu k umístění profilů, pokud nejsou umístěny ve standardním adresáři <filename>/etc/apparmor.d/</filename>.

source: <command>aa-logprof -f</command><replaceable>/path/to/logfile/</replaceable>
cs: <command>aa-logprof -f</command><replaceable>/cesta/k/souboru_žurnálu/</replaceable>

source: Specifies the full path to the location of the log file if the log file is not located in the default directory or <filename>/var/log/audit/audit.log</filename>.
cs: Určuje úplnou cestu k umístění souboru protokolu, není-li soubor protokolu umístěn ve výchozím adresáři, tj. <filename>/var/log/audit/audit.log</filename>.

source: <command>aa-logprof -m "string marker in logfile"</command>
cs: <command>aa-logprof -m "řetězec značky v žurnálovém souboru"</command>

source: Marks the starting point for <command>aa-logprof</command> to look in the system log. <command>aa-logprof</command> ignores all events in the system log before the specified mark. If the mark contains spaces, it must be surrounded by quotes to work correctly. For example:
cs: Označuje počáteční bod, značku, kam se má <command>aa-logprof</command> do systémového protokolu podívat. <command>aa-logprof</command> ignoruje všechny události v systémovém protokolu před určenou značkou. Pokud značka obsahuje mezery, musí být uzavřena uvozovkami, aby správně fungovala. Například:

source: or
cs: nebo

source: <command>aa-logprof</command> scans the log, asking you how to handle each logged event. Each question presents a numbered list of <phrase>AppArmor</phrase> rules that can be added by pressing the number of the item on the list.
cs: <command>aa-logprof</command> prohledává žurnál (protokol) a ptá se, jak zpracovat každou zaznamenanou událost. Každá otázka představuje číslovaný seznam pravidel <phrase>AppArmor</phrase>, která lze přidat stisknutím čísla položky v seznamu.

source: By default, <command>aa-logprof</command> looks for profiles in <filename>/etc/apparmor.d/</filename>. Often running <command>aa-logprof</command> as <systemitem class="username">root</systemitem> is enough to update the profile. However, there might be times when you need to search archived log files, such as if the program exercise period exceeds the log rotation window (when the log file is archived and a new log file is started). If this is the case, you can enter <command>zcat -f `ls -1tr</command> <replaceable>/path/to/logfile*</replaceable>` | aa-logprof -f -.
cs: Ve výchozím nastavení <command>aa-logprof</command> hledá profily ve <filename>/etc/apparmor.d/</filename>. Pro aktualizaci profilu často stačí spustit <command>aa-logprof</command> jako <systemitem class="username">root</systemitem>. Mohou se však vyskytnout případy, kdy je třeba prohledávat archivované soubory protokolu, například pokud doba provádění programu překračuje okno rotace protokolu (když je soubor protokolu archivován a je spuštěn nový soubor protokolu). V takovém případě můžete zadat <command>zcat -f `ls -1tr</command> <replaceable>/cesta/k/žurnálu*</replaceable>` | aa-logprof -f -.

source: aa-logprof Example 1
cs: aa-logprof Příklad 1

source: The following is an example of how <command>aa-logprof</command> addresses httpd2-prefork accessing the file <filename>/etc/group</filename>. <literal>[]</literal> indicates the default option.
cs: Následuje příklad, jak <command>aa-logprof</command> adresuje httpd2-prefork přistupující k souboru <filename>/etc/group</filename>. <literal>[]</literal> označuje výchozí možnost.

source: In this example, the access to <command>/etc/group</command> is part of httpd2-prefork accessing name services. The appropriate response is <literal>1</literal>, which includes a predefined set of <phrase>AppArmor</phrase> rules. Selecting <literal>1</literal> to <literal>#include</literal> the name service package resolves all of the future questions pertaining to DNS lookups and makes the profile less brittle in that any changes to DNS configuration and the associated name service profile package can be made once, rather than needing to revise many profiles.
cs: V tomto příkladu je přístup ke <command>/etc/group</command> součástí httpd2-prefork přistupujícímu k názvovým službám. Vhodná odpověď je <literal>1</literal>, což vloží předdefinovanou sadu pravidel <phrase>AppArmor</phrase>. Výběrem <literal>1</literal> (<literal>#include</literal> balíček názvových služeb) se řeší všechny budoucí otázky týkající se vyhledávání DNS a způsobí to, že profil bude méně křehký v tom, že jakékoli změny konfigurace DNS a přidruženého balíčku názvových služeb profilu se mohou provést jen jednou, místo nutnosti revize mnoha profilů.

source: Profile: /usr/sbin/httpd2-prefork Path: /etc/group New Mode: r [1 - #include &lt;abstractions/nameservice&gt;] 2 - /etc/group [(A)llow] / (D)eny / (N)ew / (G)lob / Glob w/(E)xt / Abo(r)t / (F)inish
cs: Profile: /usr/sbin/httpd2-prefork [Profil:...] Path: /etc/group [Cesta:...] New Mode: r [Nový režim:...] [1 - #include &lt;abstractions/nameservice&gt;] 2 - /etc/group [(A)llow] / (D)eny / (N)ew / (G)lob / Glob w/(E)xt / Abo(r)t / (F)inish [Povolit / Odmítnout / Nový / Globbing / Globbing s příponou / Zrušit / Ukončit]

source: Select one of the following responses:
cs: Zvolte jednu z odpovědí:

source: Triggers the default action, which is, in this example, allowing access to the specified directory path entry.
cs: Spustí výchozí akci, která v tomto příkladu umožňuje přístup k zadané položce cesty k adresáři.

source: Allows access to the specified directory path entries. <phrase>AppArmor</phrase> suggests file permission access. For more information about this, refer to <xref linkend="sec.apparmor.profiles.perm"/>.
cs: Umožní přístup k zadaným položkám cesty k adresáři. <phrase>AppArmor</phrase> navrhne oprávnění přístupu k souboru. Další informace k tomu najdete v <xref linkend="sec.apparmor.profiles.perm"/>.

source: Permanently prevents the program from accessing the specified directory path entries. <phrase>AppArmor</phrase> then continues to the next event.
cs: Trvale zabrání programu v přístupu k zadaným položkám cesty k adresáři. <phrase>AppArmor</phrase> pak pokračuje k další události.

source: Prompts you to enter your own rule for this event, allowing you to specify whatever form of regular expression you want. If the expression entered does not actually satisfy the event that prompted the question in the first place, <phrase>AppArmor</phrase> asks for confirmation and lets you reenter the expression.
cs: Vyzve vás k zadání vlastního pravidla pro tuto událost, což vám umožní určit jakoukoli formu regulárního výrazu, jakou chcete. Pokud zadaný výraz ve skutečnosti nevyhoví události, která na prvním místě vyvolala otázku, <phrase>AppArmor</phrase> požádá o potvrzení a umožní znovu zadat výraz.

source: Select either a specific path or create a general rule using wild cards that matches on a broader set of paths. To select any of the offered paths, enter the number that is printed in front of the paths then decide how to proceed with the selected item.
cs: Vyberte buď konkrétní cestu, nebo vytvořte obecné pravidlo pomocí zástupných názvů, které odpovídají širší sadě cest. Chcete-li vybrat kteroukoli z nabízených cest, zadejte číslo, které je vytištěno před cestami, a poté se rozhodněte, jak pokračovat s vybranou položkou.

source: aa-logprof Example 2
cs: aa-logprof Příklad 2

source: For example, when profiling vsftpd, see this question:
cs: Například při profilování vsftpd vidíte tuto otázku:

source: Profile: /usr/sbin/vsftpd Path: /y2k.jpg New Mode: r [1 - /y2k.jpg] (A)llow / [(D)eny] / (N)ew / (G)lob / Glob w/(E)xt / Abo(r)t / (F)inish
cs: Profile: /usr/sbin/vsftpd [Profil:...] Path: /y2k.jpg [Cesta:...] New Mode: r [Nový režim: r] [1 - /y2k.jpg] (A)llow / [(D)eny] / (N)ew / (G)lob / Glob w/(E)xt / Abo(r)t / (F)inish Povolit / Odepřít / Nový / Globbing / Globbing s příponou / Zrušit / Ukončit]

source: Several items of interest appear in this question. First, note that vsftpd is asking for a path entry at the top of the tree, even though vsftpd on <phrase role="productname"><phrase os="osuse">openSUSE Leap</phrase><phrase os="sles">SUSE Linux Enterprise Server</phrase><phrase os="sled">SUSE Linux Enterprise Desktop</phrase></phrase> serves FTP files from <filename>/srv/ftp</filename> by default. This is because vsftpd uses chroot and, for the portion of the code inside the chroot jail, <phrase>AppArmor</phrase> sees file accesses in terms of the chroot environment rather than the global absolute path.
cs: V této otázce se objevuje několik zajímavých bodů. Nejprve si všimněte, že vsftpd požaduje zadání cesty v horní části stromu, i když vsftpd na <phrase role="productname"><phrase os="osuse">openSUSE Leap</phrase><phrase os="sles">SUSE Linux Enterprise Server</phrase><phrase os="sled">SUSE Linux Enterprise Desktop</phrase></phrase> standardně obsluhuje FTP soubory z <filename>/srv/ftp</filename>. Je to proto, že vsftpd používá chroot a pro část kódu uvnitř chrootského vězení <phrase>AppArmor</phrase> vidí přístupy k souborům spíše z hlediska chrootového prostředí než z globální absolutní cesty.

source: The second item of interest is that you should grant FTP read access to all JPEG files in the directory, so you could use <guimenu>Glob w/Ext</guimenu> and use the suggested path of <literal>/*.jpg</literal>. Doing so collapses all previous rules granting access to individual <literal>.jpg</literal> files and forestalls any future questions pertaining to access to <filename>.jpg</filename> files.
cs: Druhým zajímavým bodem je, že byste měli udělit FTP přístup ke čtení ke všem souborům JPEG v adresáři, abyste mohli použít <guimenu>Glob w/Ext</guimenu> a použít navrhovanou cestu <literal>/*. jpg </literal>. Tím padnou všechna předchozí pravidla, která udělují přístup k jednotlivým souborům <literal>.jpg</literal> a předcházejí jakýmkoli budoucím otázkám týkajícím se přístupu k souborům <filename>.jpg</filename>.

source: Finally, you should grant more general access to FTP files. If you select <guimenu>Glob</guimenu> in the last entry, <command>aa-logprof</command> replaces the suggested path of <filename>/y2k.jpg</filename> with <filename>/*</filename>. Alternatively, you should grant even more access to the entire directory tree, in which case you could use the <guimenu>New</guimenu> path option and enter <literal>/**.jpg</literal> (which would grant access to all <literal>.jpg</literal> files in the entire directory tree) or <filename>/**</filename> (which would grant access to all files in the directory tree).
cs: Nakonec byste měli udělit obecnější přístup k souborům FTP. Pokud v poslední položce vyberete <guimenu>Glob</guimenu>, <command>aa-logprof</command> nahradí navrhovanou cestu <filename>/y2k.jpg</filename> cestou <filename>/*</filename>. Případně byste měli udělit ještě více přístupu k celému stromu adresářů. V takovém případě byste mohli použít možnost cesty <guimenu>New</guimenu> a zadat <literal>/**.jpg </literal> (což by udělilo přístup do všech <literal>.jpg</literal> souborů v celém adresářovém stromu) nebo <filename>/**</filename> (což by udělilo přístup ke všem souborům ve stromu adresářů).

source: These items deal with read accesses. Write accesses are similar, except that it is good policy to be more conservative in your use of regular expressions for write accesses. Dealing with execute accesses is more complex. Find an example in <xref linkend="ex.apparmor.commandline.profiling.summary.genprof.learn"/>.
cs: Tyto položky se zabývají přístupy pro čtení. Přístupy pro zápis jsou podobné, až na to, že při používání regulárních výrazů pro přístupy pro zápis je dobré být konzervativnější. Řešení s přístupy pro spouštění je složitější. Příklad najdete v <xref linkend="ex.apparmor.commandline.profiling.summary.genprof.learn"/>.

source: In the following example, the <filename>/usr/bin/mail</filename> mail client is being profiled and <command>aa-logprof</command> has discovered that <command>/usr/bin/mail</command> executes <command>/usr/bin/less</command> as a helper application to <quote>page</quote> long mail messages. Consequently, it presents this prompt:
cs: V následujícím příkladu je profilován poštovní klient <filename>/usr/bin/mail</filename> a <command>aa-logprof</command> zjistil, že příkaz <command>/usr/bin/mail</command> spouští <command>/usr/bin/less</command> jako pomocnou aplikaci pro <quote>stránku</quote> dlouhé poštovní zprávy. Následně zobrazí tuto výzvu:

source: /usr/bin/nail -&gt; /usr/bin/less (I)nherit / (P)rofile / (C)hild / (N)ame / (U)nconfined / (X)ix / (D)eny
cs: /usr/bin/nail -&gt; /usr/bin/less (I)nherit / (P)rofile / (C)hild / (N)ame / (U)nconfined / (X)ix / (D)eny [Zdědit / Profil / Dítě / Název / Neomezovat / Xix / Odepřít]

source: The actual executable file for <filename>/usr/bin/mail</filename> turns out to be <filename>/usr/bin/nail</filename>, which is not a typographical error.
cs: Ukázalo se, že skutečný spustitelný soubor pro <filename>/usr/bin/mail</filename> je <filename>/usr/bin/nail</filename>, což není typografická chyba.

source: The program <filename>/usr/bin/less</filename> appears to be a simple one for scrolling through text that is more than one screen long and that is in fact what <filename>/usr/bin/mail</filename> is using it for. However, <command>less</command> is actually a large and powerful program that uses many other helper applications, such as <command>tar</command> and <command>rpm</command>.
cs: Program <filename>/usr/bin/less</filename> se zdá být vhodný pro procházení textem, který je delší než jedna obrazovka, a proto ho vlastně <filename>/usr/bin/mail</filename> používá. <command>less</command> je však ve skutečnosti velký a výkonný program, který používá mnoho dalších pomocných aplikací, například <command>tar</command> a <command>rpm</command>.

source: Run <command>less</command> on a tar file or an RPM file and it shows you the inventory of these containers.
cs: Spusťte <command>less</command> na souboru tar nebo RPM a tím zobrazíte inventář těchto kontejnerů.

source: You do not want to run <command>rpm</command> automatically when reading mail messages (that leads directly to a Microsoft* Outlook–style virus attack, because RPM has the power to install and modify system programs), so, in this case, the best choice is to use <guimenu>Inherit</guimenu>. This results in the less program executed from this context running under the profile for <filename>/usr/bin/mail</filename>. This has two consequences:
cs: Nechcete automaticky spouštět <command>rpm</command> při čtení e-mailových zpráv (což vede přímo k virovému útoku ve stylu Microsoft® Outlook, protože RPM má pravomoc instalovat a upravovat systémové programy), takže v takovém případě je nejlepší volbou použít <guimenu>Zdědit</guimenu>. Výsledkem bude program less spuštěný z tohoto kontextu a běžící pod profilem pro <filename>/usr/bin/mail</filename>. To má dva důsledky:

source: You need to add all of the basic file accesses for <filename>/usr/bin/less</filename> to the profile for <filename>/usr/bin/mail</filename>.
cs: Je třeba přidat všechny základní přístupy k souborům pro <filename>/usr/bin/less</filename> do profilu pro <filename>/usr/bin/mail</filename>.

source: You can avoid adding the helper applications, such as <command>tar</command> and <command>rpm</command>, to the <filename>/usr/bin/mail</filename> profile so that when <filename>/usr/bin/mail</filename> runs <filename>/usr/bin/less</filename> in this context, the less program is far less dangerous than it would be without <phrase>AppArmor</phrase> protection. Another option is to use the Cx execute modes. For more information on execute modes, see <xref linkend="sec.apparmor.profiles.exec"/>.
cs: Můžete se vyhnout přidání pomocných aplikací, například <command>tar</command> a <command>rpm</command>, do profilu <filename>/usr/bin/mail</filename>, takže když <filename>/usr/bin/mail</filename> spustí <filename>/usr/bin/less</filename> v tomto kontextu, je program less mnohem méně nebezpečný, než by byl bez ochrany <phrase>AppArmor</phrase>. Další možností je použití režimů běhu Cx. Další informace o režimech běhu najdete v <xref linkend="sec.apparmor.profiles.exec"/>.

source: In other circumstances, you might instead want to use the <guimenu>Profile</guimenu> option. This has the following effects on <command>aa-logprof</command>:
cs: Za jiných okolností můžete místo toho použít možnost <guimenu>Profil</guimenu>. To má na <command>aa-logprof</command> tyto účinky:

source: The rule written into the profile uses px/Px, which forces the transition to the child's own profile.
cs: Pravidlo zapsané do profilu používá px/Px, což vynutí přechod k vlastnímu profilu dítěte (podřízeného programu).

source: <command>aa-logprof</command> constructs a profile for the child and starts building it, in the same way that it built the parent profile, by assigning events for the child process to the child's profile and asking the <command>aa-logprof</command> user questions. The profile will also be applied if you run the child as a stand-alone program.
cs: <command>aa-logprof</command> vytvoří profil pro dítě a začne jej budovat stejným způsobem, jako vytvořil rodičovský profil, přiřazením událostí pro podřízený proces k profilu dítěte a tím, že si <command>aa-logprof</command> vyžádá uživatelovy odpovědí na své otázky. Profil bude také použit, pokud spustíte dítě jako samostatný program.

source: If a confined program forks and executes another program, <command>aa-logprof</command> sees this and asks the user which execution mode should be used when launching the child process. The execution modes of inherit, profile, unconfined, child, named profile, or an option to deny the execution are presented.
cs: Pokud se AppArmorem omezený program rozvětví a spustí jiný program, <command>aa-logprof</command> to zjistí a zeptá se uživatele, který režim běhu by měl být použit při spuštění podřízeného procesu. K výběru jsou nabídnuty režimy běhu: zdědění, profil, bez omezení, dítě (podřízený), pojmenovaný profil nebo možnost odepřít spuštění.
