Repository: openSUSE/doc-sle-translations
Catalog: */po/apparmor_glossary.*.po
Languages: cs

# _
source: translator-credits
cs: překladatelské kredity alkas alkas@volny.cz, 2016, 2020

source: <phrase>AppArmor</phrase> Glossary
cs: <phrase>AppArmor</phrase> Glosář

source: Abstraction
cs: Abstrakce

source: See <emphasis>profile foundation classes</emphasis> below.
cs: Viz <emphasis>třídy základních profilů</emphasis> dále.

source: Apache is a freely-available Unix-based Web server. It is currently the most commonly used Web server on the Internet. Find more information about Apache at the Apache Web site at <link xlink:href="http://www.apache.org"/>.
cs: Apache je volně dostupný webový server na Unixu. V současné době je to nejčastěji používaný webový server na Internetu. Další informace o Apache naleznete na webu Apache na <link xlink:href="http://www.apache.org"/>.

source: application fire-walling
cs: firewall pro aplikaci

source: <phrase>AppArmor</phrase> confines applications and limits the actions they are permitted to take. It uses privilege confinement to prevent attackers from using malicious programs on the protected server and even using trusted applications in unintended ways.
cs: <phrase>AppArmor</phrase> ohraničuje aplikace a omezuje akce, které mohou provádět. Používá ohraničení oprávnění, aby zabránil útočníkům spouštět škodlivé programy na chráněném serveru. Brání i nezamýšlenému způsobu použití důvěryhodných aplikací.

source: attack signature
cs: podpis (charakteristika, signatura) útoku

source: Pattern in system or network activity that alerts of a possible virus or hacker attack. Intrusion detection systems might use attack signatures to distinguish between legitimate and potentially malicious activity.
cs: Vzor typu systémové nebo síťové činnosti, která indikuje možný útok viru nebo hackera. Systémy detekce narušení mohou používat signatury útoku k rozlišení mezi legitimní a potenciálně škodlivou činností.

source: By not relying on attack signatures, <phrase>AppArmor</phrase> provides "proactive" instead of "reactive" defense from attacks. This is better because there is no window of vulnerability where the attack signature must be defined for <phrase>AppArmor</phrase> as it does for products using attack signatures.
cs: <phrase>AppArmor</phrase> se nespoléhá na podpisy útoků, ale poskytuje „předvídavou“ obranu místo „reagující“ obrany před útoky. To je lepší, protože neexistuje žádné okno zranitelnosti, které by muselo mít pro <phrase>AppArmor</phrase> předem definovaný podpis útoku, jako je tomu u produktů používajících podpisy útoku.

source: Graphical user interface. Refers to a software front-end meant to provide an attractive and easy-to-use interface between a computer user and application. Its elements include windows, icons, buttons, cursors, and scrollbars.
cs: Grafické uživatelské rozhraní. Odkazuje na atraktivní, snadno použitelné softwarové rozhraní mezi uživatelem počítače a aplikací. Mezi prvky takového rozhraní patří okna, ikony, tlačítka, kurzory a posuvníky.

source: File name substitution. Instead of specifying explicit file name paths, you can use helper characters <literal>*</literal> (substitutes any number of characters except special ones such as <literal>/</literal> or <literal>?</literal>) and <literal>?</literal> (substitutes exactly one character) to address multiple files/directories at once. <literal>**</literal> is a special substitution that matches any file or directory below the current directory.
cs: Nahrazení názvu souboru. Místo zadání explicitních cest k souborům můžete použít pomocné znaky <literal>*</literal> (nahrazuje libovolný počet znaků kromě speciálních, jako je <literal>/</literal> nebo <literal>?</literal>) a <literal>?</literal> (nahrazuje přesně jeden znak) pro adresování více souborů/adresářů najednou. <literal>**</literal> je speciální substituce, která odpovídá každému souboru nebo adresáři pod aktuálním adresářem.

source: Host intrusion prevention. Works with the operating system kernel to block abnormal application behavior in the expectation that the abnormal behavior represents an unknown attack. Blocks malicious packets on the host at the network level before they can <quote>hurt</quote> the application they target.
cs: Prevence proniknutí do hostitele. Spolupracuje s jádrem operačního systému na blokování abnormálního chování aplikace v očekávání, že takové chování představuje neznámý typ útoku. Na úrovni sítě zablokuje škodlivé pakety jdoucí k hostiteli, takže nemohou <quote>ublížit</quote> aplikaci, na kterou cílí.

source: mandatory access control
cs: povinná kontrola přístupu

source: A means of restricting access to objects that is based on fixed security attributes assigned to users, files, and other objects. The controls are mandatory in the sense that they cannot be modified by users or their programs.
cs: Prostředky omezení přístupu k objektům, které jsou založeny na pevných atributech zabezpečení přiřazených uživatelům, souborům a jiným objektům. Kontroly jsou povinné v tom smyslu, že je nemohou měnit uživatelé ani jejich programy.

source: profile
cs: profil

source: <phrase>AppArmor</phrase> profile completely defines what system resources an individual application can access, and with what privileges.
cs: Profil <phrase>AppArmor</phrase> plně definuje, ke kterým systémovým prostředkům může jednotlivá aplikace přistupovat a s jakými oprávněními.

source: profile foundation classes
cs: třídy základních profilů

source: Profile building blocks needed for common application activities, such as DNS lookup and user authentication.
cs: Stavební bloky profilů potřebné pro běžné činnosti aplikací, jako je vyhledávání DNS a ověřování uživatelů.

source: The RPM Package Manager. An open packaging system available for anyone to use. It works on Red Hat Linux, <phrase role="productname"><phrase os="osuse">openSUSE Leap</phrase><phrase os="sles">SUSE Linux Enterprise Server</phrase><phrase os="sled">SUSE Linux Enterprise Desktop</phrase></phrase>, and other Linux and Unix systems. It is capable of installing, uninstalling, verifying, querying, and updating computer software packages. See <link xlink:href="http://www.rpm.org/"/> for more information.
cs: Správce balíčků RPM. Otevřený balíčkový systém, který může použít kdokoli. Funguje na Red Hat Linux, <phrase role="productname"><phrase os="osuse">openSUSE Leap</phrase><phrase os="sles">SUSE Linux Enterprise Server</phrase><phrase os="sled">SUSE Linux Enterprise Desktop</phrase></phrase> a dalších systémech Linux a Unix. Je schopen instalovat, odinstalovat, ověřit, dotazovat a aktualizovat balíčky počítačového softwaru. Další informace viz <link xlink:href="http://www.rpm.org/"/>.

source: Secure Shell. A service that allows you to access your server from a remote computer and issue text commands through a secure connection.
cs: Zabezpečený shell. Služba, která umožňuje přistupovat k serveru ze vzdáleného počítače a zadávat textové příkazy zabezpečeným připojením.

source: streamlined access control
cs: efektivnější řízení přístupu

source: <phrase>AppArmor</phrase> provides streamlined access control for network services by specifying which files each program is allowed to read, write, and execute. This ensures that each program does what it is supposed to do and nothing else.
cs: <phrase>AppArmor</phrase> poskytuje efektivní řízení přístupu pro síťové služby určením souborů, které má každý program povoleno číst, zapisovat a provádět. To zajišťuje, že každý program dělá to, co má dělat, a nic jiného.

source: Universal resource identifier. The generic term for all types of names and addresses that refer to objects on the World Wide Web. A URL is one kind of URI.
cs: Univerzální identifikátor zdroje. Obecný termín pro všechny typy jmen a adres, které odkazují na objekty na webu. URL je jeden z typů URI.

source: Uniform Resource Locator. The global address of documents and other resources on the Web.
cs: Jednotný lokátor zdrojů. Globální adresa dokumentů a dalších zdrojů na webu.

source: The first part of the address indicates what protocol to use and the second part specifies the IP address or the domain name where the resource is located.
cs: První část adresy označuje, jaký protokol se má použít; druhá část určuje IP adresu nebo doménový název umístění zdroje.

source: For example, when you visit <phrase os="sles;sled"><literal>http://www.suse.com</literal></phrase><phrase os="osuse"><literal>http://www.opensuse.org</literal></phrase>, you are using the HTTP protocol, as the beginning of the URL indicates.
cs: Když například navštívíte <phrase os="sles;sled"><literal>http://www.suse.com</literal></phrase><phrase os="osuse"><literal>http://www.opensuse.org</literal></phrase>, používáte protokol HTTP, jak naznačuje začátek adresy URL.

source: vulnerabilities
cs: zranitelnosti

source: An aspect of a system or network that leaves it open to attack. Characteristics of computer systems that allow an individual to keep it from correctly operating or that allows unauthorized users to take control of the system. Design, administrative, or implementation weaknesses or flaws in hardware, firmware, or software. If exploited, a vulnerability could lead to an unacceptable impact in the form of unauthorized access to information or the disruption of critical processing.
cs: Aspekt systému nebo sítě, který jej/ji nechává otevřený/otevřenou útoku. Vlastnosti počítačových systémů, které jednotlivci umožňují způsobit, aby nepracovaly správně, nebo které umožňují neoprávněným uživatelům převzít kontrolu nad systémem. Slabiny nebo nedostatky v návrhu, správě, nebo implementační slabiny či závady hardwaru, firmwaru nebo softwaru. V případě zneužití by zranitelnost mohla vést k nepřijatelným důsledkům, ať ve formě neoprávněného přístupu k informacím nebo narušení kritického zpracování.
