Repository: openSUSE/doc-sle-translations
Catalog: */po/apparmor_support.*.po
Languages: cs

source: Manually editing <phrase>AppArmor</phrase> profiles can introduce syntax errors. If you attempt to start or restart <phrase>AppArmor</phrase> with syntax errors in your profiles, error results are shown. This example shows the syntax of the entire parser error.
cs: Ruční úprava profilů <phrase> AppArmor </phrase> může způsobit chyby syntaxe. Pokusíte-li se spustit nebo restartovat aplikaci <phrase>AppArmor</phrase> s chybami syntaxe ve svých profilech, zobrazí se chybné výsledky. Tento příklad ukazuje syntaxi celé chyby analyzátoru.

source: localhost:~ # rcapparmor start Loading AppArmor profiles AppArmor parser error in /etc/apparmor.d/usr.sbin.squid at line 410: syntax error, unexpected TOK_ID, expecting TOK_MODE Profile /etc/apparmor.d/usr.sbin.squid failed to load
cs: localhost:~ # rcapparmor start Zavádím AppArmor, profily AppArmor chyba analyzátoru v /etc/apparmor.d/usr.sbin.squid u řádku 410: chyba syntaxe, neočekáváno TOK_ID, očekáváno TOK_MODE Profil /etc/apparmor.d/usr.sbin.squid nebylo možno zavést

source: Using the <phrase>AppArmor</phrase> YaST tools, a graphical error message indicates which profile contained the error and requests you to fix it.
cs: Při použití nástrojů YaST <phrase>AppArmor</phrase> označuje grafická chybová zpráva, který profil obsahoval chybu, a požaduje, abyste ji opravili.

source: To fix a syntax error, log in to a terminal window as <systemitem class="username">root</systemitem>, open the profile, and correct the syntax. Reload the profile set with <command>systemctl reload apparmor</command>.
cs: Abyste opravili chybu syntaxe, přihlaste se do terminálového okna jako <systemitem class="username">root</systemitem>, otevřete profil a opravte syntaxi. Znovu načtěte sadu profilů pomocí <command>systemctl reload apparmor</command>.

source: <phrase>AppArmor</phrase> Syntax Highlighting in <literal>vi</literal>
cs: <phrase>AppArmor</phrase> - zvýraznění syntaxe v <literal>vi</literal>

source: The editor <literal>vi</literal> on <phrase role="productname"><phrase os="osuse">openSUSE Leap</phrase><phrase os="sles">SUSE Linux Enterprise Server</phrase><phrase os="sled">SUSE Linux Enterprise Desktop</phrase></phrase> supports syntax highlighting for <phrase>AppArmor</phrase> profiles. Lines containing syntax errors will be displayed with a red background.
cs: Editor <literal>vi</literal> na <phrase role="productname"> <phrase os="osuse">openSUSE Leap</phrase> <phrase os="sles">SUSE Linux Enterprise Server</phrase><phrase os="sled">SUSE Linux Enterprise Desktop</phrase> </phrase> podporuje zvýrazňování syntaxe pro profily <phrase>AppArmor</phrase>. Řádky obsahující chyby syntaxe se zobrazí s červeným pozadím.

source: Reporting Bugs for <phrase>AppArmor</phrase>
cs: Hlášení chyb pro <phrase>AppArmor</phrase>

source: The developers of <phrase>AppArmor</phrase> are eager to deliver products of the highest quality. Your feedback and your bug reports help us keep the quality high. Whenever you encounter a bug in <phrase>AppArmor</phrase>, file a bug report against this product:
cs: Vývojáři aplikace <phrase>AppArmor</phrase> touží dodávat produkty nejvyšší kvality. Vaše zpětná vazba a hlášení o chybách nám pomáhají udržovat vysokou kvalitu. Kdykoli narazíte na chybu v <phrase>AppArmor</phrase>, podejte hlášení o chybě v tomto produktu:

source: Use your Web browser to go to <link os="sles;sled" xlink:href="http://bugzilla.suse.com/"/><link os="osuse" xlink:href="http://bugzilla.opensuse.org/"/> and click <guimenu>Log In</guimenu>.
cs: Ve webovém prohlížeči jděte na <link os="sles;sled" xlink:href="http://bugzilla.suse.com/"/><link os="osuse" xlink:href="http://bugzilla.opensuse.org/"/> a klikněte <guimenu>Log In</guimenu>.

source: Enter the account data of your SUSE account and click <guimenu>Login</guimenu>. If you do not have a SUSE account, click <guimenu>Create Account</guimenu> and provide the required data.
cs: Zadejte data svého účtu SUSE a klikněte na <guimenu>Přihlásit se</guimenu>. Pokud nemáte účet SUSE, klikněte na <guimenu>Vytvořit účet</guimenu> a zadejte požadované údaje.

source: If your problem has already been reported, check this bug report and add extra information to it, if necessary.
cs: Pokud byl váš problém již nahlášen, zkontrolujte tuto zprávu o chybě a v případně k ní přidejte další informace.

source: If your problem has not been reported yet, select <guimenu>New</guimenu> from the top navigation bar and proceed to the <guimenu>Enter Bug</guimenu> page.
cs: Pokud váš problém ještě nebyl ohlášen, vyberte z horního navigačního panelu <guimenu>Nový</guimenu> a přejděte na stránku <guimenu>Zadejte chybu</guimenu>.

source: Select the product against which to file the bug. In your case, this would be your product's release. Click <guimenu>Submit</guimenu>.
cs: Vyberte produkt, jehož chybu chcete ohlásit. Ve vašem případě by to byla verze vydání vašeho produktu. Klikněte <guimenu>Odeslat</guimenu>.

source: Select the product version, component (<phrase>AppArmor</phrase> in this case), hardware platform, and severity.
cs: Vyberte verzi produktu, komponentu (v tomto případě <phrase>AppArmor</phrase>), hardwarovou platformu a závažnost.

source: Enter a brief headline describing your problem and add a more elaborate description including log files. You may create attachments to your bug report for screenshots, log files, or test cases.
cs: Zadejte krátký nadpis popisující váš problém a přidejte podrobnější popis včetně souborů protokolu. Ke zprávě o chybách můžete vytvořit a přidat přílohy - snímky obrazovky, soubory protokolu nebo testovací příklady.

source: Click <guimenu>Submit</guimenu> after you have entered all the details to send your report to the developers.
cs: Po zadání všech podrobností klikněte na <guimenu>Odeslat</guimenu> a odešlete svou zprávu vývojářům.
