Repository: openSUSE/doc-sle-translations
Catalog: */po/apparmor_profiles_yast.*.po
Languages: cs

source: <phrase>AppArmor</phrase> can apply profiles in two different modes. In <emphasis>complain</emphasis> mode, violations of <phrase>AppArmor</phrase> profile rules, such as the profiled program accessing files not permitted by the profile, are detected. The violations are permitted, but also logged. This mode is convenient for developing profiles and is used by the <phrase>AppArmor</phrase> tools for generating profiles. Loading a profile in <emphasis>enforce</emphasis> mode enforces the policy defined in the profile, and reports policy violation attempts to <systemitem class="daemon">rsyslogd</systemitem> (or <systemitem class="daemon">auditd</systemitem> or <systemitem class="daemon">journalctl</systemitem>, depending on system configuration).
cs: <phrase>AppArmor</phrase> může použít profily ve dvou různých režimech. V režimu <emphasis>stěžování</emphasis> jsou detekována narušení pravidel profilů aplikace <phrase>AppArmor</phrase>, jako jsou profilované programy, přistupující k souborům v profilu nepovoleným. Narušení je povoleno, ale zaznamenáno. Tento režim je vhodný pro vývoj profilů a používá se pro jejich vytváření nástroji <phrase>AppArmor</phrase>. Načtení profilu v režimu <emphasis>vynucení</emphasis> vynucuje zásady definované v profilu a ohlásí pokusy o porušení zásad do <systemitem class="daemon">rsyslogd</systemitem> (nebo <systemitem class="daemon">auditd</systemitem> nebo <systemitem class="daemon">journalctl</systemitem> podle konfigurace systému).

source: The <guimenu>Profile Mode Configuration</guimenu> dialog allows you to view and edit the mode of currently loaded <phrase>AppArmor</phrase> profiles. This feature is useful for determining the status of your system during profile development. During systemic profiling (see <xref linkend="sec.apparmor.commandline.profiling.systemic"/>), you can use this tool to adjust and monitor the scope of the profiles for which you are learning behavior.
cs: Dialog <guimenu>Konfigurace režimu profilu</guimenu> umožňuje zobrazit a upravit režim aktuálně načtených profilů <phrase>AppArmor</phrase>. Tato funkce je užitečná pro určení stavu vašeho systému během vývoje profilu. Během systémového profilování (viz <xref linkend="sec.apparmor.commandline.profiling.systemic"/>) můžete pomocí tohoto nástroje nastavit a sledovat rozsah profilů těch programů, jejichž chování se učíte.

source: To edit an application's profile mode, proceed as follows:
cs: Režim profilu aplikace upravíte takto:

source: In the <guimenu>Configure Profile Modes</guimenu> section, select <guimenu>Configure</guimenu>.
cs: V sekci <guimenu>Konfigurovat režimy profilu</guimenu> zvolte <guimenu>Konfigurovat</guimenu>.

source: Select the profile for which to change the mode.
cs: Vyberte profil, jemuž chcete změnit režim.

source: Select <guimenu>Toggle Mode</guimenu> to set this profile to <emphasis>complain</emphasis> mode or to <emphasis>enforce</emphasis> mode.
cs: Vyberte <guimenu>Přepnout režim</guimenu> a nastavte tento profil na režim <emphasis>stěžování</emphasis> nebo na režim <emphasis>vynucení</emphasis>.

source: Apply your settings and leave YaST with <guimenu>Done</guimenu>.
cs: Aplikujte své nastavení a ukončete YaST kliknutím <guimenu>Hotovo</guimenu>.

source: To change the mode of all profiles, use <guimenu>Set All to Enforce</guimenu> or <guimenu>Set All to Complain</guimenu>.
cs: Chcete-li změnit režim všech profilů, použijte <guimenu>Nastavit všem Vynucení</guimenu> nebo <guimenu>Nastavit všem Stěžování</guimenu>.

source: Listing the Profiles Available
cs: Výpis dostupných profilů

source: By default, only active profiles are listed (any profile that has a matching application installed on your system). To set up a profile before installing the respective application, click <guimenu>Show All Profiles</guimenu> and select the profile to configure from the list that appears.
cs: Standardně jsou uvedeny pouze aktivní profily (jakýkoli profil, který má v systému instalovanou odpovídající aplikaci). Chcete-li nastavit profil před instalací příslušné aplikace, klikněte na <guimenu>Zobrazit všechny profily</guimenu> a ze seznamu vyberte profil, který chcete konfigurovat.
