Repository: openSUSE/doc-sle-translations
Catalog: */po/apparmor_changehat.*.po
Languages: cs

source: <prompt>tux &gt; </prompt><command>sudo</command> aa-status apparmor module is loaded. 39 profiles are loaded. 37 profiles are in enforce mode. [...] /usr/sbin/httpd2-prefork /usr/sbin/httpd2-prefork//DEFAULT_URI /usr/sbin/httpd2-prefork//HANDLING_UNTRUSTED_INPUT [...] 2 profiles are in complain mode. /usr/bin/getopt /usr/sbin/httpd2-prefork//adminer [...]
cs: <prompt>tux &gt; </prompt><command>sudo</command> aa-status apparmor module is loaded. 39 profiles are loaded. [39 profilů zavedeno] 37 profiles are in enforce mode. [37 profilů je ve vynucovacím režimu] [...] /usr/sbin/httpd2-prefork /usr/sbin/httpd2-prefork//DEFAULT_URI /usr/sbin/httpd2-prefork//HANDLING_UNTRUSTED_INPUT [...] 2 profiles are in complain mode. [2 profily jsou v režimu stížností] /usr/bin/getopt /usr/sbin/httpd2-prefork//adminer [...]

source: As we can see, the <literal>httpd2-prefork//adminer</literal> is loaded in complain mode.
cs: Jak vidno, <literal>httpd2-prefork//adminer</literal> je zaveden v režimu stížností.

source: Our last task is to find out the right set of rules for the <systemitem>adminer</systemitem> hat. That is why we set the <systemitem>adminer</systemitem> hat into complain mode—the logging facility collects useful information about the access requirements of <filename>adminer.php</filename> as we use it via the Web browser. <command>aa-logprof</command> then helps us with creating the hat's profile.
cs: Naším posledním úkolem je najít správnou sadu pravidel pro klobouk pro <systemitem>adminer</systemitem>. Proto jsme nastavili klobouk <systemitem>adminer</systemitem> do stěžovacího režimu - protokol shromažďuje užitečné informace o požadavcích na přístup <filename>adminer.php</filename>, při jeho používání webovým prohlížečem. <command>aa-logprof</command> nám pak pomáhá s vytvářením profilu klobouku.

source: Generating Rules for the <systemitem>adminer</systemitem> Hat
cs: Generování pravidel pro klobouk <systemitem>adminer</systemitem>

source: Open Adminer in the Web browser. If you installed it locally, then the URI is <literal>http://localhost/adminer/adminer.php</literal>.
cs: Otevřete Adminer ve webovém prohlížeči. Máte-li ho instalován lokálně, pak je URI <literal>http://localhost/adminer/adminer.php</literal>.

source: Choose the database engine you want to use (MariaDB in our case), and log in to Adminer using the existing database user name and password. You do not need to specify the database name as you can do so after logging in. Perform any operations with Adminer you like—create a new database, create a new table for it, set user privileges, and so on.
cs: Vyberte databázový stroj, který chcete použít (v našem případě MariaDB), a přihlaste se k Admineru pomocí existující kombinace uživatelského jména a hesla pro databázi. Není třeba zadávat název databáze, jelikož to můžete udělat po přihlášení. Proveďte jakékoli operace s Adminerem dle Vaší vlastní volby - vytvořte novou databázi, vytvořte pro ni novou tabulku, nastavte uživatelská oprávnění atd.

source: After the short testing of Adminer's user interface, switch back to console and examine the log for collected data.
cs: Po krátkém testování uživatelského rozhraní Admineru přepněte zpět do konzole a zkontrolujte protokol, zda neobsahuje stížnosti.

source: <prompt>tux &gt; </prompt><command>sudo</command> aa-logprof Reading log entries from /var/log/audit/audit.log. Updating AppArmor profiles in /etc/apparmor.d. Complain-mode changes: Profile: /usr/sbin/httpd2-prefork^adminer Path: /dev/urandom Mode: r Severity: 3 1 - #include &lt;abstractions/apache2-common&gt; [...] [8 - /dev/urandom] [(A)llow] / (D)eny / (G)lob / Glob w/(E)xt / (N)ew / Abo(r)t / (F)inish / (O)pts
cs: <prompt>tux &gt; </prompt><command>sudo</command> aa-logprof Reading log entries from /var/log/audit/audit.log. [Čtení položek záznamu ...] Updating AppArmor profiles in /etc/apparmor.d. [Aktualizace profilů AppArmor v ...] Complain-mode changes: [Změny v režimu stížností:] Profile: /usr/sbin/httpd2-prefork^adminer [Profil:] Path: /dev/urandom [Cesta:] Mode: r [Režim:] Severity: 3 [Závažnost:] 1 - #include &lt;abstractions/apache2-common&gt; [...] [8 - /dev/urandom] [(A)llow] / (D)eny / (G)lob / Glob w/(E)xt / (N)ew / Abo(r)t / (F)inish / (O)pts [ [Povolit] / Odepřít / Globbing / Globbing s příponou / Nový / Zrušit / Ukončit / Volby ]

source: From the <command>aa-logprof</command> message, it is clear that our new <systemitem>adminer</systemitem> hat was correctly detected:
cs: Ze zprávy <command>aa-logprof</command> je zřejmé, že náš nový klobouk <systemitem>adminer</systemitem> byl správně detekován:

source: The <command>aa-logprof</command> command will ask you to pick the right rule for each discovered <phrase>AppArmor</phrase> event. Specify the one you want to use, and confirm with <guimenu>Allow</guimenu>. For more information on working with the <command>aa-genprof</command> and <command>aa-logprof</command> interface, see <xref linkend="sec.apparmor.commandline.profiling.summary.genprof"/>.
cs: Příkaz <command>aa-logprof</command> vás požádá, abyste vybrali správné pravidlo pro každou objevenou událost <phrase>AppArmor</phrase>. Určete ten, který chcete použít, a potvrďte pomocí <guimenu>Povolit</guimenu>. Další informace o práci s rozhraními <command>aa-genprof</command> a <command>aa-logprof</command> naleznete v <xref linkend="sec.apparmor.commandline.profiling.summary.genprof"/>.

source: <command>aa-logprof</command> usually offers several valid rules for the examined event. Some are <emphasis>abstractions</emphasis>—predefined sets of rules affecting a specific common group of targets. Sometimes it is useful to include such an abstraction instead of a direct URI rule:
cs: <command>aa-logprof</command> obvykle nabízí několik platných pravidel pro zkoumanou událost. Některá jsou <emphasis>abstrakce</emphasis> - předdefinované sady pravidel ovlivňujících konkrétní společnou skupinu cílů. Někdy je užitečné zahrnout takovou abstrakci místo přímého pravidla URI:

source: In the example above, it is recommended hitting <guimenu>1</guimenu> and confirming with <guimenu>A</guimenu> to allow the abstraction.
cs: Ve výše uvedeném příkladu se doporučuje stisknout <guimenu>1</guimenu> a potvrdit pomocí <guimenu>A</guimenu>, aby se povolila abstrakce.

source: After the last change, you will be asked to save the changed profile.
cs: Po poslední změně budete požádáni o uložení změněného profilu.

source: The following local profiles were changed. Would you like to save them? [1 - /usr/sbin/httpd2-prefork] (S)ave Changes / [(V)iew Changes] / Abo(r)t
cs: The following local profiles were changed. Would you like to save them? [ Změnily se následující lokální profily. Chcete je uložit? ] [1 - /usr/sbin/httpd2-prefork] (S)ave Changes / [(V)iew Changes] / Abo(r)t [ Uložit změny / Prohlížet změny / Zrušit ]

source: Hit <guimenu>S</guimenu> to save the changes.
cs: Změny uložíte stisknutím <guimenu>S</guimenu>.

source: Set the profile to enforce mode with <command>aa-enforce</command>
cs: Nastavte vynucovací režim profilu programem <command>aa-enforce</command>

source: and check its status with <command>aa-status</command>
cs: a ověřte jeho stav programem <command>aa-status</command>

source: <prompt>tux &gt; </prompt><command>sudo</command> aa-status apparmor module is loaded. 39 profiles are loaded. 38 profiles are in enforce mode. [...] /usr/sbin/httpd2-prefork /usr/sbin/httpd2-prefork//DEFAULT_URI /usr/sbin/httpd2-prefork//HANDLING_UNTRUSTED_INPUT /usr/sbin/httpd2-prefork//adminer [...]
cs: <prompt>tux &gt; </prompt><command>sudo</command> aa-status apparmor module is loaded. [Modul Apparmor zaveden.] 39 profiles are loaded. [39 profilů zavedeno.] 38 profiles are in enforce mode. [38 profilů je ve vynucovacím režimu.] [...] /usr/sbin/httpd2-prefork /usr/sbin/httpd2-prefork//DEFAULT_URI /usr/sbin/httpd2-prefork//HANDLING_UNTRUSTED_INPUT /usr/sbin/httpd2-prefork//adminer [...]

source: As you can see, the <literal>//adminer</literal> hat jumped from <emphasis>complain</emphasis> to <emphasis>enforce</emphasis> mode.
cs: Jak vidno, klobouk <literal>//adminer</literal> přešel ze <emphasis>stěžovacího</emphasis> do <emphasis>vynucovacího</emphasis> režimu.

source: Try to run Adminer in the Web browser, and if you encounter problems running it, switch it to the complain mode, repeat the steps that previously did not work well, and update the profile with <command>aa-logprof</command> until you are satisfied with the application's functionality.
cs: Zkuste spustit Adminer ve webovém prohlížeči a narazíte-li na problémy s jeho spuštěním, přepněte jej do režimu stížnosti, opakujte kroky, které dříve nefungovaly dobře, a aktualizujte profil pomocí <command>aa-logprof</command>, dokud nebudete spokojeni s funkčností aplikace.

source: Hat and Parent Profile Relationship
cs: Vztah podprofilu ("klobouku") a rodičovského profilu

source: The profile <filename>^adminer</filename> is only available in the context of a process running under the parent profile <filename>usr.sbin.httpd2-prefork</filename>.
cs: Profil <filename>^adminer</filename> je k dispozici pouze v kontextu procesu spuštěného pod nadřazeným profilem <filename>usr.sbin.httpd2-prefork</filename>.

source: Adding Hats and Entries to Hats in YaST
cs: Přidání klobouků a položek klobouků v YaST

source: When you use the <guimenu>Edit Profile</guimenu> dialog (for instructions, refer to <xref xrefstyle="SectTitleOnPage" linkend="sec.apparmor.yast.edit"/>) or when you add a new profile using <guimenu>Manually Add Profile</guimenu> (for instructions, refer to <xref xrefstyle="SectTitleOnPage" linkend="sec.apparmor.yast.add"/>), you are given the option of adding hats (subprofiles) to your <phrase>AppArmor</phrase> profiles. Add a ChangeHat subprofile from the <guimenu><phrase>AppArmor</phrase> Profile Dialog</guimenu> window as in the following.
cs: Při použití dialogu <guimenu>Upravit profil</guimenu> (pokyny najdete v <xref xrefstyle="SectTitleOnPage" linkend="sec.apparmor.yast.edit"/>), nebo když přidáte nový profil pomocí <guimenu>Přidat profil manuálně</guimenu> (pokyny viz <xref xrefstyle="SectTitleOnPage" linkend="sec.apparmor.yast.add"/>), máte možnost přidat klobouky (podprofily) ke svým profilům <phrase>AppArmor</phrase>. Do okna <guimenu><phrase>AppArmor</phrase>Dialog profilu</guimenu> přidejte podprofil ChangeHat, jak je ukázáno dále.

source: <textobject role="description"><phrase><phrase>AppArmor</phrase> profile dialog</phrase> </textobject> <imageobject role="fo"> <imagedata format="PNG" fileref="hats_in_profiles.png" width="75%"/> </imageobject> <imageobject role="html"> <imagedata fileref="hats_in_profiles.png" width="75%" format="PNG"/> </imageobject>
cs: <textobject role="description"><phrase>Dialog profilu <phrase>AppArmor</phrase></phrase> </textobject> <imageobject role="fo"> <imagedata format="PNG" fileref="hats_in_profiles.png" width="75%"/> </imageobject> <imageobject role="html"> <imagedata fileref="hats_in_profiles.png" width="75%" format="PNG"/> </imageobject>

source: From the <guimenu><phrase>AppArmor</phrase> Profile Dialog</guimenu> window, click <guimenu>Add Entry</guimenu> then select <guimenu>Hat</guimenu>. The <guimenu>EnterHat Name</guimenu> dialog opens:
cs: V okně <guimenu><phrase>AppArmor</phrase>Dialog profilu</guimenu> klikněte na <guimenu>Přidat položku</guimenu> a vyberte <guimenu>Klobouk</guimenu>. Otevře se dialogové okno <guimenu>Zadejte název klobouku</guimenu>:

source: <textobject role="description"><phrase>Enter hat name</phrase> </textobject> <imageobject role="fo"> <imagedata format="PNG" fileref="hat_createhat.png" width="50%"/> </imageobject> <imageobject role="html"> <imagedata fileref="hat_createhat.png" width="35%" format="PNG"/> </imageobject>
cs: <textobject role="description"><phrase>Zadejte název klobouku</phrase> </textobject> <imageobject role="fo"> <imagedata format="PNG" fileref="hat_createhat.png" width="50%"/> </imageobject> <imageobject role="html"> <imagedata fileref="hat_createhat.png" width="35%" format="PNG"/> </imageobject>

source: Enter the name of the hat to add to the <phrase>AppArmor</phrase> profile. The name is the URI that, when accessed, receives the permissions set in the hat.
cs: Zadejte název klobouku, který chcete přidat do profilu <phrase>AppArmor</phrase>. Název je URI, který při přístupu obdrží oprávnění nastavená v klobouku.

source: Click <guimenu>Create Hat</guimenu>. You are returned to the <guimenu><phrase>AppArmor</phrase> Profile Dialog</guimenu> screen.
cs: Klikněte na <guimenu>Vytvořit klobouk</guimenu>. Vrátíte se na obrazovku <guimenu>Dialog profilu <phrase>AppArmor</phrase></guimenu>.

source: After adding the new hat, click <guimenu>Done</guimenu>.
cs: Po přidání nového klobouku klikněte na <guimenu>Hotovo</guimenu>.
