Repository: openSUSE/doc-sle-translations
Catalog: */po/apparmor_profiles_man.*.po
Languages: cs

source: If a separate profile exists for the child process, the default selection is profile. If a profile does not exist, the default is inherit. The inherit option, or <literal>ix</literal>, is described in <xref linkend="sec.apparmor.profiles.perm"/>.
cs: Pokud pro podřízený proces existuje samostatný profil, výchozí výběr je profil. Pokud profil neexistuje, pak výchozí profil je zděděný. Možnost zdědění, čili <literal>ix</literal>, je popsána v <xref linkend="sec.apparmor.profiles.perm"/>.

source: The profile option indicates that the child program should run in its own profile. A secondary question asks whether to sanitize the environment that the child program inherits from the parent. If you choose to sanitize the environment, this places the execution modifier <literal>Px</literal> in your <phrase>AppArmor</phrase> profile. If you select not to sanitize, <literal>px</literal> is placed in the profile and no environment sanitizing occurs. The default for the execution mode is <literal>Px</literal> if you select profile execution mode.
cs: Volba profilu označuje, že by měl být podřízený program spuštěn ve svém vlastním profilu. Druhotnou otázkou je, zda očistit prostředí, které podřízený program zdědí od rodiče. Pokud se rozhodnete očistit prostředí, umístí modifikátor provedení <literal>Px</literal> do vašeho profilu <phrase>AppArmor</phrase>. Nerozhodnete-li se k očistě, je do profilu vložen <literal>px</literal> a nenastane žádné čistění prostředí. Výchozí režim provádění je <literal>Px</literal>, pokud vyberete režim běhu s profilem.

source: The unconfined execution mode is not recommended and should only be used in cases where there is no other option to generate a profile for a program reliably. Selecting unconfined opens a warning dialog asking for confirmation of the choice. If you are sure and choose <guimenu>Yes</guimenu>, a second dialog ask whether to sanitize the environment. To use the execution mode <literal>Ux</literal> in your profile, select <guimenu>Yes</guimenu>. To use the execution mode <literal>ux</literal> in your profile instead, select <guimenu>No</guimenu>. The default value selected is <literal>Ux</literal> for unconfined execution mode.
cs: Neomezený režim provádění se nedoporučuje a měl by se používat pouze v případech, kdy neexistuje žádná jiná možnost spolehlivého vygenerování profilu pro program. Výběrem neomezeného běhu se otevře varovné dialogové okno s dotazem na potvrzení volby. Jste-li si jisti a zvolíte <guimenu>Yes</guimenu>, zobrazí se ve druhém dialogu dotaz, zda očistit prostředí. Chcete-li ve svém profilu použít režim běhu <literal>Ux</literal>, vyberte <guimenu>Yes</guimenu>. Chcete-li místo toho ve svém profilu použít režim běhu <literal>ux</literal>, vyberte <guimenu>No</guimenu>. Výchozí vybraná hodnota je <literal>Ux</literal> - neomezený režim provádění.

source: Running Unconfined
cs: Neomezený běh

source: Selecting <literal>ux or Ux</literal> is very dangerous and provides no enforcement of policy (from a security perspective) of the resulting execution behavior of the child program.
cs: Výběr <literal>ux nebo Ux</literal> je velmi nebezpečný a neposkytuje žádné vynucení zásad (co do bezpečnosti) výsledného chování běhu podřízeného programu.

source: aa-unconfined—Identifying Unprotected Processes
cs: aa-unconfined — Identifikace nechráněných procesů

source: The <command>aa-unconfined</command> command examines open network ports on your system, compares that to the set of profiles loaded on your system, and reports network services that do not have <phrase>AppArmor</phrase> profiles. It requires <systemitem class="username">root</systemitem> privileges and that it not be confined by an <phrase>AppArmor</phrase> profile.
cs: Příkaz <command>aa-unconfined</command> prozkoumá otevřené síťové porty ve vašem systému, porovná to se sadou profilů načtených ve vašem systému a ohlásí síťové služby, které nemají profily <phrase>AppArmor</phrase>. Vyžaduje oprávnění <systemitem class="username">root</systemitem> a nesmí být omezen profilem <phrase>AppArmor</phrase>.

source: <command>aa-unconfined</command> must be run as <systemitem class="username">root</systemitem> to retrieve the process executable link from the <filename>/proc</filename> file system. This program is susceptible to the following race conditions:
cs: <command>aa-unconfined</command> musí být spuštěn pod uživatelem <systemitem class="username">root</systemitem>, aby bylo možné získat odkaz na spustitelný proces ze systému souborů <filename>/proc</filename>. Tento program je citlivý na následující podmínky běhu:

source: An unlinked executable is mishandled
cs: Nepřipojený spustitelný soubor je nesprávně zpracován

source: A process that dies between <command>netstat(8)</command> and further checks is mishandled
cs: Proces, který skončí mezi <command>netstat(8)</command> a dalšími kontrolami, je nesprávně zpracován

source: This program lists processes using TCP and UDP only. In short, this program is unsuitable for forensics use and is provided only as an aid to profiling all network-accessible processes in the lab.
cs: Tento program uvádí procesy používající pouze TCP a UDP. Stručně řečeno, tento program není vhodný pro forenzní použití (pátrání) a je poskytován pouze jako laboratorní pomůcka k profilování všech procesů přistupujících k síti.

source: <command>aa-notify</command> is a handy utility that displays <phrase>AppArmor</phrase> notifications in your desktop environment. This is very convenient if you do not want to inspect the <phrase>AppArmor</phrase> log file, but rather let the desktop inform you about events that violate the policy. To enable <phrase>AppArmor</phrase> desktop notifications, run <command>aa-notify</command>:
cs: <command>aa-notify</command> je užitečný nástroj, který zobrazuje oznámení <phrase>AppArmor</phrase> na ploše vašeho počítače. To je velmi výhodné, pokud nechcete kontrolovat soubor žurnálu <phrase>AppArmor</phrase>, ale raději si necháte zobrazovat informace o událostech, porušující zásady, na plochu. Chcete-li povolit upozornění na ploše <phrase>AppArmor</phrase>, spusťte <command>aa-notify</command>:

source: <prompt>tux &gt; </prompt><command>sudo</command> aa-notify -p -u <replaceable>USERNAME</replaceable> --display <replaceable>DISPLAY_NUMBER</replaceable>
cs: <prompt>tux &gt; </prompt><command>sudo</command> aa-notify -p -u <replaceable>UŽIV.JMÉNO</replaceable> --display <replaceable>ČÍSLO_DISPLEJE</replaceable>

source: where <replaceable>USERNAME</replaceable> is your user name under which you are logged in, and <replaceable>DISPLAY_NUMBER</replaceable> is the X Window display number you are currently using, such as <literal>:0</literal>. The process is run in the background, and shows a notification each time a deny event happens.
cs: kde <replaceable>UŽIV.JMÉNO</replaceable> je Vaše uživatelské jméno, pod kterým jste přihlášen, a <replaceable>ČÍSLO_DISPLEJE</replaceable> je číslo displeje X Window, který právě používáte, např. <literal>:0</literal>. Proces běží na pozadí a zobrazí upozornění, jakmile nastane událost odepření.

source: The active X Window display number is saved in the <literal>$DISPLAY</literal> variable, so you can use <literal>--display $DISPLAY</literal> to avoid finding out the current display number.
cs: Číslo aktivního displeje X Window je uloženo v proměnné <literal>$DISPLAY</literal>, takže můžete použít <literal>--display $DISPLAY</literal>, abyste nemuseli zjišťovat číslo aktuálního displeje.

source: <command>aa-notify Message in GNOME</command>
cs: <command>aa-notify Zpráva v GNOME</command>

source: With the <option>-s <replaceable>DAYS</replaceable></option> option, you can also configure <command>aa-notify</command> to display a summary of notifications for the specified number of past days. For more information on <command>aa-notify</command>, see its man page <command>man 8 aa-notify</command>.
cs: Volbou <option>-s <replaceable>DNY</replaceable></option> můžete také konfigurovat <command>aa-notify</command> tak, aby zobrazoval souhrn oznámení pro zadaný počet minulých dnů. Další informace o <command>aa-notify</command> najdete na jeho manuálové stránce <command>man 8 aa-notify</command>.

source: A syntax highlighting file for the vim text editor highlights various features of an <phrase>AppArmor</phrase> profile with colors. Using vim and the <phrase>AppArmor</phrase> syntax mode for vim, you can see the semantic implications of your profiles with color highlighting. Use vim to view and edit your profile by typing vim at a terminal window.
cs: Soubor zvýrazňující syntaxi pro textový editor vim zvýrazňuje různé vlastnosti profilu <phrase> AppArmor </phrase> barvami. Pomocí vim a režimu syntaxe <phrase>AppArmor</phrase> pro vim můžete vidět sémantické důsledky vašich profilů zvýrazněním barev. Pomocí vim můžete zobrazit a upravit svůj profil zadáním vim v okně terminálu.

source: To enable the syntax coloring when you edit an <phrase>AppArmor</phrase> profile in vim, use the commands <literal>:syntax on</literal> then <literal>:set syntax=apparmor</literal>. To make sure vim recognizes the edited file type correctly as an <phrase>AppArmor</phrase> profile, add
cs: Chcete-li povolit barevné označení syntaxe při úpravě profilu <phrase>AppArmor</phrase> ve vim, použijte příkazy <literal>:syntax on</literal> a pak <literal>:set syntax=apparmor</literal>. Chcete-li se ujistit, že vim správně rozpoznává upravovaný typ souboru jako profil <phrase>AppArmor</phrase>, přidejte

source: at the end of the profile.
cs: na konec profilu.

source: <command>vim</command> comes with <phrase>AppArmor</phrase> highlighting automatically enabled for files in <filename>/etc/apparmor.d/</filename>.
cs: <command>vim</command> se dodává se zvýrazněním <phrase>AppArmor</phrase> automaticky povoleným pro soubory v adresáři <filename>/etc/apparmor.d/</filename>.

source: When you enable this feature, vim colors the lines of the profile for you:
cs: Když tuto funkci povolíte, vim vybarví řádky profilu za vás:

source: Blue
cs: Modrá

source: Comments
cs: Poznámky

source: White
cs: Bílá

source: Ordinary read access lines
cs: Běžné řádky s přístupem pro čtení

source: Brown
cs: Hnědá

source: Capability statements and complain flags
cs: Prohlášení schopnosti a značky stížností

source: Yellow
cs: Žlutá

source: Lines that grant write access
cs: Řádky, které udělují přístup pro zápis

source: Green
cs: Zelená

source: Lines that grant execute permission (either ix or px)
cs: Řádky, které udělují oprávnění ke spuštění (buď ix nebo px)

source: Red
cs: Červená

source: Lines that grant unconfined access (ux)
cs: Řádky, které udělují neomezený přístup (ux)

source: Red background
cs: Červené pozadí

source: Syntax errors that will not load properly into the <phrase>AppArmor</phrase> modules
cs: Chyby syntaxe, pro které se profily nenačtou správně do modulů <phrase>AppArmor</phrase>

source: Use the <systemitem>apparmor.vim</systemitem> and <systemitem>vim</systemitem> man pages and the <option>:help syntax</option> from within the vim editor for further vim help about syntax highlighting. The <phrase>AppArmor</phrase> syntax is stored in <filename>/usr/share/vim/current/syntax/apparmor.vim.</filename>
cs: Použijte manuálové stránky <systemitem>apparmor.vim</systemitem> a <systemitem>vim</systemitem> a <option>:help syntax</option> z editoru vim pro další nápovědu vim ke zvýraznění syntaxe. Syntaxe <phrase>AppArmor</phrase> je uložena v <filename>/usr/share/vim/current/syntax/apparmor.vim </filename>

source: Important File Names and Directories
cs: Důležité názvy souborů a adresářů

source: The following list contains the most important files and directories used by the <phrase>AppArmor</phrase> framework. If you intend to manage and troubleshoot your profiles manually, make sure that you know about these files and directories:
cs: Následující seznam obsahuje nejdůležitější soubory a adresáře používané rámcem <phrase>AppArmor</phrase>. Pokud máte v úmyslu spravovat a řešit problémy ručně, ujistěte se, že víte o těchto souborech a adresářích:

source: Virtualized file representing the currently loaded set of profiles.
cs: Virtualizovaný soubor představující aktuálně načtenou sadu profilů.

source: Location of <phrase>AppArmor</phrase> configuration files.
cs: Umístění konfiguračních souborů <phrase>AppArmor</phrase>.

source: A local repository of profiles shipped with <phrase>AppArmor</phrase>, but not enabled by default.
cs: Místní úložiště profilů dodávané s aplikací <phrase>AppArmor</phrase>, ve výchozím nastavení však není povoleno.

source: Location of profiles, named with the convention of replacing the <literal>/</literal> in paths with <literal>.</literal> (not for the root <literal>/</literal>) so profiles are easier to manage. For example, the profile for the program <filename>/usr/sbin/smbd</filename> is named <filename>usr.sbin.smbd</filename>.
cs: Umístění profilů, nazvaných podle konvence o nahrazení <literal>/</literal> v cestách <literal>.</literal> (nikoli pro kořen <literal>/</literal>), takže profily lze snadněji spravovat. Například profil programu <filename>/usr/sbin/smbd</filename> se nazývá <filename>usr.sbin.smbd</filename>.

source: Location of abstractions.
cs: Umístění abstrakcí.

source: Location of program chunks.
cs: Umístění úryvků programů.

source: Check this file to review the confinement status of a process and the profile that is used to confine the process. The <command>ps</command> <option>auxZ</option> command retrieves this information automatically.
cs: V tomto souboru zkontrolujte stav omezení procesu a profil, který se používá k omezení procesu. Příkaz <command>ps</command> <option>auxZ</option> tyto informace načte automaticky.
