Repository: openSUSE/doc-sle-translations
Catalog: */po/apparmor_profiles_man.*.po
Languages: cs

source: Resolves the full path of httpd2-prefork using your shell's path variables. You can also specify a full path. On <phrase role="productname"><phrase os="osuse">openSUSE Leap</phrase><phrase os="sles">SUSE Linux Enterprise Server</phrase><phrase os="sled">SUSE Linux Enterprise Desktop</phrase></phrase>, the default full path is <phrase><filename>/usr/sbin/httpd2-prefork</filename></phrase>.
cs: Vyřeší úplnou cestu httpd2-prefork pomocí proměnných cesty shellu. Můžete také zadat úplnou cestu. Na <phrase role="productname"><phrase os="osuse">openSUSE Leap</phrase><phrase os="sles">SUSE Linux Enterprise Server</phrase><phrase os="sled">SUSE Linux Enterprise Desktop</phrase></phrase> je výchozí úplná cesta <phrase><filename>/usr/sbin/httpd2-prefork</filename></phrase>.

source: Checks to see if there is an existing profile for httpd2-prefork. If there is one, it updates it. If not, it creates one using the <command>aa-autodep</command> as described in <xref linkend="sec.apparmor.commandline.profiling.summary"/>.
cs: Zkontroluje, zda existuje profil pro httpd2-prefork. Pokud existuje, aktualizuje jej. Pokud ne, vytvoří ho pomocí <command>aa-autodep</command>, jak je popsáno v <xref linkend="sec.apparmor.commandline.profiling.summary"/>.

source: Puts the profile for this program into learning or complain mode so that profile violations are logged, but are permitted to proceed. A log event looks like this (see <filename>/var/log/audit/audit.log</filename>):
cs: Přepne profil pro tento program do režimu učení čili stěžování, aby bylo zaznamenáno porušení profilu, ale bylo povoleno pokračovat. Událost protokolu vypadá takto (viz <filename>/var/log/audit/audit.log</filename>):

source: If you are not running the audit daemon, the <phrase>AppArmor</phrase> events are logged directly to <systemitem class="daemon">systemd</systemitem> journal (see <xref linkend="cha.journalctl"/>):
cs: Pokud auditovací démon neběží, události <phrase>AppArmor</phrase> se zaznamenávají přímo do žurnálu <systemitem class="daemon">systemd</systemitem> (viz <xref linkend="cha.journalctl"/> ):

source: They also can be viewed using the <command>dmesg</command> command:
cs: Dají se též prohlížet příkazem <command>dmesg</command>:

source: Marks the log with a beginning marker of log events to consider. For example:
cs: Označí protokol počáteční značkou událostí protokolu, které je třeba vzít v úvahu. Například:

source: When prompted by the tool, run the application to profile in another terminal window and perform as many of the application functions as possible. Thus, the learning mode can log the files and directories to which the program requires access to function properly. For example, in a new terminal window, enter <command>systemctl start apache2</command>.
cs: Po výzvě nástroje spusťte aplikaci k profilování v jiném okně terminálu a proveďte co nejvíce funkcí aplikace. Režim učení tedy může protokolovat soubory a adresáře, ke kterým program vyžaduje přístup, aby správně fungoval. Zadejte například <command>systemctl start apache2</command> v novém okně terminálu.

source: Select from the following options that are available in the <command>aa-genprof</command> terminal window after you have executed the program function:
cs: Vyberte z následujících možností dostupných v okně terminálu <command>aa-genprof</command> po provedení programové funkce:

source: <keycap>S</keycap> runs <command>aa-genprof</command> on the system log from where it was marked when <command>aa-genprof</command> was started and reloads the profile. If system events exist in the log, <phrase>AppArmor</phrase> parses the learning mode log files. This generates a series of questions that you must answer to guide <command>aa-genprof</command> in generating the security profile.
cs: <keycap>S</keycap> spustí <command>aa-genprof</command> v systémovém protokolu od místa, které bylo označeno při spuštění <command>aa-genprof</command> a znovu načte profil. Pokud v protokolu existují systémové události, <phrase>AppArmor</phrase> analyzuje soubory protokolu režimu učení. Tím vznikne řada otázek, na které musíte při vytváření bezpečnostního profilu odpovídat při provádění <command>aa-genprof</command>.

source: <keycap>F</keycap> exits the tool.
cs: <keycap>F</keycap> ukončí nástroj.

source: If requests to add hats appear, proceed to <xref linkend="cha.apparmor.hat"/>.
cs: Objeví-li se požadavky na přidání "klobouků", pokračujte na <xref linkend="cha.apparmor.hat"/>.

source: Answer two types of questions:
cs: Odpovězte na dva typy otázek:

source: A resource is requested by a profiled program that is not in the profile (see <xref linkend="ex.apparmor.commandline.profiling.summary.genprof.learn"/>).
cs: Profilovaný program požaduje zdroj, který není v profilu (viz <xref linkend="ex.apparmor.commandline.profiling.summary.genprof.learn"/>).

source: A program is executed by the profiled program and the security domain transition has not been defined (see <xref linkend="ex.apparmor.commandline.profiling.summary.genprof.perms"/>).
cs: Profilovaný program spouští program a nebyl definován přechod domény zabezpečení (viz <xref linkend="ex.apparmor.commandline.profiling.summary.genprof.perms"/>).

source: Each of these categories results in a series of questions that you must answer to add the resource or program to the profile. <xref linkend="ex.apparmor.commandline.profiling.summary.genprof.learn"/> and <xref linkend="ex.apparmor.commandline.profiling.summary.genprof.perms"/> provide examples of each one. Subsequent steps describe your options in answering these questions.
cs: Každá z těchto kategorií má za následek řadu otázek, na které musíte odpovědět, abyste do profilu přidali zdroj nebo program. <xref linkend="ex.apparmor.commandline.profiling.summary.genprof.learn"/> a <xref linkend="ex.apparmor.commandline.profiling.summary.genprof.perms"/> obsahují příklady obou dvou. Následující kroky popisují vaše možnosti odpovědí na tyto otázky.

source: Dealing with execute accesses is complex. You must decide how to proceed with this entry regarding which execute permission type to grant to this entry:
cs: Nakládání s vykonanými přístupy je složité. Musíte se rozhodnout, jak s touto položkou pokračovat - přesněji, který typ spouštěcího oprávnění udělit této položce:

source: Learning Mode Exception: Controlling Access to Specific Resources
cs: Výjimka režimu učení: Řízení přístupu ke konkrétním zdrojům

source: Reading log entries from /var/log/audit/audit.log. Updating AppArmor profiles in /etc/apparmor.d. Profile: /usr/sbin/cupsd Program: cupsd Execute: /usr/lib/cups/daemon/cups-lpd Severity: unknown (I)nherit / (P)rofile / (C)hild / (N)ame / (U)nconfined / (X)ix / (D)eny / Abo(r)t / (F)inish
cs: Reading log entries from /var/log/audit/audit.log. [Čtení nových položek z...] Updating AppArmor profiles in /etc/apparmor.d. Aktualizace profilů Armor v...] Profile: /usr/sbin/cupsd [Profil:...] Program: cupsd [Program:...] Execute: /usr/lib/cups/daemon/cups-lpd [Spuštěn z:...] Severity: unknown [Závažnost: neznámá] (I)nherit / (P)rofile / (C)hild / (N)ame / (U)nconfined / (X)ix / (D)eny / Abo(r)t / (F)inish [Zděděno / Profil / Dítě / Název / Neomezeno / Xix / Odepřít / Zrušit / Ukončit]

source: Inherit (ix)
cs: Zděděno (ix)

source: The child inherits the parent's profile, running with the same access controls as the parent. This mode is useful when a confined program needs to call another confined program without gaining the permissions of the target's profile or losing the permissions of the current profile. This mode is often used when the child program is a <emphasis>helper application</emphasis>, such as the <command>/usr/bin/mail</command> client using <command>less</command> as a pager.
cs: Dítě zdědí profil rodiče a běží se stejnými ovládacími prvky přístupu jako rodič (nadřazený program). Tento režim je užitečný, když musí omezený program zavolat jiný omezený program, aniž získá oprávnění profilu cíle nebo ztratí oprávnění aktuálního profilu. Tento režim se často používá, když je podřízeným programem <emphasis>pomocná aplikace</emphasis>, jako např. klient <command>/usr/bin/mail</command>, který používá <command>less</command> jako pager .

source: Profile (px/Px)
cs: Profil (px/Px)

source: The child runs using its own profile, which must be loaded into the kernel. If the profile is not present, attempts to execute the child fail with permission denied. This is most useful if the parent program is invoking a global service, such as DNS lookups or sending mail with your system's MTA.
cs: Dítě běží s vlastním profilem, který musí být načten do jádra. Pokud profil není k dispozici, pokusy o spuštění dítěte selžou s odepřením oprávnění. To je nejužitečnější, když nadřazený program volá globální službu, například vyhledávání DNS nebo odesílání pošty pomocí MTA (agent přenosu pošty) Vašeho systému.

source: Choose the <guimenu>profile with clean exec</guimenu> (Px) option to scrub the environment of environment variables that could modify execution behavior when passed to the child process.
cs: Vyberte možnost <guimenu>profil s čistým provedením</guimenu> (Px) a vyčistěte prostředí proměnných prostředí, které by mohly změnit chování, když řízení přejde do podřízeného procesu.

source: Child (cx/Cx)
cs: Dítě (cx/Cx)

source: Sets up a transition to a subprofile. It is like px/Px transition, except to a child profile.
cs: Nastaví přechod na podprofil. Je to jako přechod px/Px, s výjimkou podřízeného profilu.

source: Choose the <guimenu>profile with clean exec</guimenu> (Cx) option to scrub the environment of environment variables that could modify execution behavior when passed to the child process.
cs: Vyberte možnost <guimenu>profil s čistým provedením</guimenu> (Cx) a vyčistěte prostředí proměnných prostředí, které by mohly změnit chování, když řízení přejde do podřízeného procesu.

source: Unconfined (ux/Ux)
cs: Neomezeno (ux/Ux)

source: The child runs completely unconfined without any <phrase>AppArmor</phrase> profile applied to the executed resource.
cs: Dítě běží zcela neomezeně, bez jakéhokoli profilu <phrase>AppArmor</phrase> aplikovaného na spouštěný prostředek.

source: Choose the <guimenu>unconfined with clean exec</guimenu> (Ux) option to scrub the environment of environment variables that could modify execution behavior when passed to the child process. Note that running unconfined profiles introduces a security vulnerability that could be used to evade <phrase>AppArmor</phrase>. Only use it as a last resort.
cs: Vyberte možnost <guimenu>neomezená s čistým provedením</guimenu> (Ux) a vyčistěte prostředí proměnných prostředí, které by mohly změnit chování, když řízení přejde do podřízeného procesu. Uvědomte si, že spuštění neomezených profilů představuje bezpečnostní chybu, kterou lze použít k obejití <phrase>AppArmor</phrase>. Používejte ji pouze jako poslední možnost.

source: This permission denotes that the program running under the profile can access the resource using the mmap system call with the flag <envar>PROT_EXEC</envar>. This means that the data mapped in it can be executed. You are prompted to include this permission if it is requested during a profiling run.
cs: Toto oprávnění označuje, že program běžící pod profilem má přístup ke zdroji pomocí systémového volání mmap s příznakem <envar>PROT_EXEC</envar>. To znamená, že data v něm mapovaná mohou být spuštěna jako program. Výzva k zadání tohoto oprávnění se zobrazí, pokud je požadována během profilování.

source: Deny
cs: Odepřít

source: Adds a <literal>deny</literal> rule to the profile, and permanently prevents the program from accessing the specified directory path entries. <phrase>AppArmor</phrase> then continues to the next event.
cs: Přidá do profilu pravidlo <literal>deny</literal> a trvale zabrání programu v přístupu k zadaným položkám cest k adresářům. <phrase>AppArmor</phrase> pak pokračuje k další události.

source: Abort
cs: Zrušit

source: Aborts <command>aa-logprof</command>, losing all rule changes entered so far and leaving all profiles unmodified.
cs: Přeruší <command>aa-logprof</command>, zahodí všechny dosud zadané změny pravidel a všechny profily zůstanou nezměněny.

source: Finish
cs: Ukončit

source: Closes <command>aa-logprof</command>, saving all rule changes entered so far and modifying all profiles.
cs: Ukončí <command>aa-logprof</command>, uloží všechny dosud zadané změny pravidel a upraví všechny profily.

source: <xref linkend="ex.apparmor.commandline.profiling.summary.genprof.perms"/> shows <phrase>AppArmor</phrase> suggest allowing a globbing pattern <filename>/var/run/nscd/*</filename> for reading, then using an abstraction to cover common Apache-related access rules.
cs: <xref linkend="ex.apparmor.commandline.profiling.summary.genprof.perms"/> ukazuje, jak <phrase>AppArmor</phrase> navrhne povolit pro čtení globbing-šablonu <filename>/var/run/nscd/*</filename> a pak použít abstrakci pokrývající běžná pravidla přístupu související s Apache.

source: Learning Mode Exception: Defining Permissions for an Entry
cs: Výjimka učebního režimu: Definice oprávnění pro položku

source: Profile: /usr/sbin/httpd2-prefork Path: /var/run/nscd/dbSz9CTr Mode: r Severity: 3 1 - /var/run/nscd/dbSz9CTr [2 - /var/run/nscd/*] (A)llow / [(D)eny] / (G)lob / Glob w/(E)xt / (N)ew / Abo(r)t / (F)inish / (O)pts Adding /var/run/nscd/* r to profile. Profile: /usr/sbin/httpd2-prefork Path: /proc/11769/attr/current Mode: w Severity: 9 [1 - #include &lt;abstractions/apache2-common&gt;] 2 - /proc/11769/attr/current 3 - /proc/*/attr/current (A)llow / [(D)eny] / (G)lob / Glob w/(E)xt / (N)ew / Abo(r)t / (F)inish / (O)pts Adding #include &lt;abstractions/apache2-common&gt; to profile.
cs: Profile: /usr/sbin/httpd2-prefork [Profil:...] Path: /var/run/nscd/dbSz9CTr [Cesta:...] Mode: r [Režim:...] Severity: 3 [Závažnost:...] 1 - /var/run/nscd/dbSz9CTr [2 - /var/run/nscd/*] (A)llow / [(D)eny] / (G)lob / Glob w/(E)xt / (N)ew / Abo(r)t / (F)inish / (O)pts [Povolit / Odepřít / Globbing / Globbing s příponou / Nový / Zrušit / Ukončit / Možnosti] Adding /var/run/nscd/* r to profile. [Přidávám ... do profilu.] Profile: /usr/sbin/httpd2-prefork [Profil:...] Path: /proc/11769/attr/current [Cesta:...] Mode: w [Režim:...] Severity: 9 [Závažnost:...] [1 - #include &lt;abstractions/apache2-common&gt;] 2 - /proc/11769/attr/current 3 - /proc/*/attr/current (A)llow / [(D)eny] / (G)lob / Glob w/(E)xt / (N)ew / Abo(r)t / (F)inish / (O)pts [Povolit / Odepřít / Globbing / Globbing s příponou / Nový / Zrušit / Ukončit / Možnosti] Adding #include &lt;abstractions/apache2-common&gt; to profile. [Přidávám ... do profilu.]

source: <phrase>AppArmor</phrase> provides one or more paths or includes. By entering the option number, select the desired options then proceed to the next step.
cs: <phrase>AppArmor</phrase> obsahuje jednu nebo více cest nebo vložených částí. Zadáním čísla možnosti vyberte požadované možnosti a přejděte k dalšímu kroku.

source: Not all of these options are always presented in the <phrase>AppArmor</phrase> menu.
cs: V nabídce <phrase> AppArmor </phrase> nejsou tyto možnosti vždy uvedeny všechny.

source: This is the section of an <phrase>AppArmor</phrase> profile that refers to an include file, which procures access permissions for programs. By using an include, you can give the program access to directory paths or files that are also required by other programs. Using includes can reduce the size of a profile. It is good practice to select includes when suggested.
cs: Tato část profilu <phrase>AppArmor</phrase> odkazuje na vkládaný soubor, který zajišťuje přístupová oprávnění pro programy. Vložením můžete programu poskytnout přístup k adresářovým cestám nebo souborům, které jsou také vyžadovány jinými programy. Použití vkládání může zmenšit velikost profilu. Je dobrým zvykem volit vkládané soubory, pokud jsou navrženy.

source: Globbed Version
cs: Globbed verze

source: This is accessed by selecting <guimenu>Glob</guimenu> as described in the next step. For information about globbing syntax, refer to <xref linkend="sec.apparmor.profiles.glob"/>.
cs: K ní se dostanete výběrem <guimenu>Glob</guimenu>, jak je popsáno v dalším kroku. Informace o syntaxi globbing najdete v <xref linkend="sec.apparmor.profiles.glob"/>.

source: Actual Path
cs: Aktuální cesta

source: This is the literal path to which the program needs access so that it can run properly.
cs: Je to výslovná cesta (tj. neobsahuje žádné nahrazované proměnné), ke které potřebuje mít program přístup, aby mohl správně fungovat.

source: After you select the path or include, process it as an entry into the <phrase>AppArmor</phrase> profile by selecting <guimenu>Allow</guimenu> or <guimenu>Deny</guimenu>. If you are not satisfied with the directory path entry as it is displayed, you can also <guimenu>Glob</guimenu> it.
cs: Po výběru cesty nebo vložené části ji zpracujte jako záznam do profilu <phrase>AppArmor</phrase> výběrem <guimenu>Povolit</guimenu> nebo <guimenu>Odepřít</guimenu>. Pokud nejste spokojeni s položkou cesty k adresáři tak, jak je zobrazena, můžete ji také zadat jako <guimenu>Glob</guimenu>.

source: The following options are available to process the learning mode entries and build the profile:
cs: Pro zpracování položek režimu učení a sestavení profilu jsou k dispozici tyto možnosti:

source: Allows access to the selected directory path.
cs: Povoluje přístup k vybrané cestě k adresáři.

source: Allow
cs: Povolit

source: Allows access to the specified directory path entries. <phrase>AppArmor</phrase> suggests file permission access. For more information, refer to <xref linkend="sec.apparmor.profiles.perm"/>.
cs: Povoluje přístup k zadaným položkám cesty k adresáři. <phrase>AppArmor</phrase> navrhuje přístup k souboru. Další informace najdete v <xref linkend="sec.apparmor.profiles.perm"/>.

source: Prevents the program from accessing the specified directory path entries. <phrase>AppArmor</phrase> then continues to the next event.
cs: Zabrání programu v přístupu k zadaným položkám cest k adresářům. <phrase>AppArmor</phrase> pak pokračuje k další události.

source: New
cs: Nový

source: Prompts you to enter your own rule for this event, allowing you to specify a regular expression. If the expression does not actually satisfy the event that prompted the question in the first place, <phrase>AppArmor</phrase> asks for confirmation and lets you reenter the expression.
cs: Vyzve vás k zadání vlastního pravidla pro tuto událost - umožní určit regulární výraz. Pokud výraz nevyhovuje události, která vyvolala otázku na prvním místě, požádá aplikace <phrase>AppArmor</phrase> o potvrzení a umožní znovu zadat výraz.

source: Select a specific path or create a general rule using wild cards that match a broader set of paths. To select any of the offered paths, enter the number that is printed in front of the path then decide how to proceed with the selected item.
cs: Vyberte konkrétní cestu nebo vytvořte obecné pravidlo pomocí hromadných zápisů (wildcard), které odpovídají širší sadě cest. Chcete-li vybrat kteroukoli z nabízených cest, zadejte číslo, které je vytištěno před cestou, a poté se rozhodněte, jak pokračovat s vybranou položkou.

source: For more information about globbing syntax, refer to <xref linkend="sec.apparmor.profiles.glob"/>.
cs: Další údaje o syntaxi globbingu najdete na <xref linkend="sec.apparmor.profiles.glob"/>.

source: This modifies the original directory path while retaining the file name extension. For example, <filename>/etc/apache2/file.ext</filename> becomes <filename>/etc/apache2/*.ext</filename>, adding the wild card (asterisk) in place of the file name. This allows the program to access all files in the suggested directory that end with the <literal>.ext</literal> extension.
cs: Tím se upraví původní cesta k adresáři při zachování přípony názvu souboru. Např. z <filename>/etc/apache2/file.ext</filename> se stane <filename>/etc/apache2/*.ext</filename> a místo názvu souboru je hromadný zápis, tzv. divoká karta (hvězdička). To programu umožní v navrhovaném adresáři přístup ke všem souborům, které končí příponou <literal>.ext</literal>.

source: To view and edit your profile using <command>vi</command>, enter <command>vi /etc/apparmor.d/</command> <replaceable>PROFILENAME</replaceable> in a terminal window. To enable syntax highlighting when editing an <phrase>AppArmor</phrase> profile in vim, use the commands <command>:syntax on</command> then <command>:set syntax=apparmor</command>. For more information about vim and syntax highlighting, refer to <xref linkend="sec.apparmor.commandline.profiling.summary.vim"/>.
cs: Chcete-li zobrazit a upravit svůj profil pomocí <command>vi</command>, zadejte v okně terminálu <command>vi /etc/apparmor.d/</command> <replaceable>NÁZEV_PROFILU</replaceable>. Chcete-li při úpravě profilu <phrase>AppArmor</phrase> ve vim povolit zvýraznění syntaxe, použijte příkazy <command>:syntax on</command> a potom <command>:set syntax=apparmor</command>. Další informace o zvýraznění vim a syntaxe naleznete v <xref linkend="sec.apparmor.commandline.profiling.summary.vim"/>.

source: Restart <phrase>AppArmor</phrase> and reload the profile set including the newly created one using the <command>systemctl reload apparmor</command> command.
cs: Restartujte <phrase>AppArmor</phrase> a znovu načtěte sadu profilů, včetně nově vytvořeného, příkazem <command>systemctl reload apparmor</command>.

source: Like the graphical front-end for building <phrase>AppArmor</phrase> profiles, the YaST Add Profile Wizard, <command>aa-genprof</command> also supports the use of the local profile repository under <filename>/etc/apparmor/profiles/extras</filename> and the remote <phrase>AppArmor</phrase> profile repository.
cs: Stejně jako grafické rozhraní pro vytváření profilů <phrase>AppArmor</phrase> - YaST Průvodce přidáním profilu, také <command>aa-genprof</command> podporuje použití úložiště lokálních profilů v <filename>/etc/apparmor/profiles/extras</filename> a vzdálené úložiště profilů <phrase>AppArmor</phrase>.

source: To use a profile from the local repository, proceed as follows:
cs: Chcete-li použít profil z místního úložiště, postupujte takto:

source: Start <command>aa-genprof</command> as described above.
cs: Spusťte <command>aa-genprof</command>, jak je popsáno výše.

source: If <command>aa-genprof</command> finds an inactive local profile, the following lines appear on your terminal window:
cs: Najde-li <command>aa-genprof</command> neaktivní místní profil, objeví se v okně terminálu tyto řádky:

source: Profile: /usr/bin/opera [1 - Inactive local profile for /usr/bin/opera] [(V)iew Profile] / (U)se Profile / (C)reate New Profile / Abo(r)t / (F)inish
cs: Profile: /usr/bin/opera [Profil::...] [1 - Inactive local profile for /usr/bin/opera] [1 - Neaktivní místní profil pro...] [(V)iew Profile] / (U)se Profile / (C)reate New Profile / Abo(r)t / (F)inish [Ukázat profil / Použít profil / Vytvořit nový profil / Zrušit / Ukončit]

source: To use this profile, press <keycap>U</keycap> (<guimenu>Use Profile</guimenu>) and follow the profile generation procedure outlined above.
cs: Chcete-li tento profil použít, stiskněte klávesu <keycap>U</keycap> (<guimenu>Use profile</guimenu>) a postupujte podle výše uvedeného postupu generování profilu.

source: To examine the profile before activating it, press <keycap>V</keycap> (<guimenu>View Profile</guimenu>).
cs: Chcete-li prozkoumat profil před jeho aktivací, stiskněte <keycap>V</keycap> (<guimenu>View Profile</guimenu>).
