Repository: openSUSE/doc-sle-translations
Catalog: */po/apparmor_profiles_man.*.po
Languages: cs

source: You should review the profiles that have been generated. You can open and edit the profiles in <filename>/etc/apparmor.d/</filename> using a text editor.
cs: Měli byste zkontrolovat vygenerované profily. Profily můžete otevřít a upravit v <filename>/etc/apparmor.d/</filename> pomocí textového editoru.

source: Return to enforce mode.
cs: Vraťte vynucovací režim.

source: This is when the system goes back to enforcing the rules of the profiles, not only logging information. This can be done manually by removing the <literal>flags=(complain)</literal> text from the profiles or automatically by using the <command>aa-enforce</command> command, which works identically to the <command>aa-complain</command> command, except it sets the profiles to enforce mode. This functionality is also available through the YaST Profile Mode module, described in <xref linkend="sec.apparmor.yast.manage.profmodes"/>.
cs: To nastane, když se systém vrací k prosazování pravidel profilů, nejen k protokolování informací. Lze to provést ručně odstraněním textu <literal>flags=(complain) </literal> z profilů nebo automaticky pomocí příkazu <command>aa-enforce</command>, který pracuje stejně jako <command>aa -complain</command>, kromě toho, že nastavuje profily pro vynucení režimu. Tato funkce je k dispozici také prostřednictvím modulu YaST Profile Mode, popsaného v <xref linkend="sec.apparmor.yast.manage.profmodes"/>.

source: To ensure that all profiles are taken out of complain mode and put into enforce mode, enter <command>aa-enforce /etc/apparmor.d/*</command>.
cs: Chcete-li zajistit, aby všechny profily byly přepnuty ze stěžovacího režimu do vynucovacího režimu, zadejte <command>aa-enforce /etc/apparmor.d/*</command>.

source: Re-scan all profiles.
cs: Znovu prohledat všechny profily.

source: To have <phrase>AppArmor</phrase> re-scan all of the profiles and change the enforcement mode in the kernel, enter <command>systemctl reload apparmor</command>.
cs: Chcete-li, aby <phrase>AppArmor</phrase> znovu prohledal všechny profily a změnil režim vymáhání v jádře, zadejte <command>systemctl reload apparmor</command>.

source: Summary of Profiling Tools
cs: Souhrn nástrojů profilování

source: All of the <phrase>AppArmor</phrase> profiling utilities are provided by the <systemitem>apparmor-utils</systemitem> RPM package and are stored in <filename>/usr/sbin</filename>. Each tool has a different purpose.
cs: Všechny profilovací nástroje <phrase>AppArmor</phrase> jsou poskytovány balíčkem RPM <systemitem>apparmor-utils</systemitem> a jsou uloženy v <filename>/usr/sbin</filename>. Každý nástroj má jiný účel.

source: aa-autodep—Creating Approximate Profiles
cs: aa-autodep—Vytváření provizorních (přibližných) profilů

source: This creates an approximate profile for the program or application selected. You can generate approximate profiles for binary executables and interpreted script programs. The resulting profile is called <quote>approximate</quote> because it does not necessarily contain all of the profile entries that the program needs to be properly confined by <phrase>AppArmor</phrase>. The minimum <command>aa-autodep</command> approximate profile has, at minimum, a base include directive, which contains basic profile entries needed by most programs. For certain types of programs, <command>aa-autodep</command> generates a more expanded profile. The profile is generated by recursively calling <command>ldd(1)</command> on the executables listed on the command line.
cs: Vytvoří přibližný profil pro vybraný program nebo aplikaci. Můžete generovat přibližné profily pro binární spustitelné soubory a interpretované skriptové programy. Výsledný profil se nazývá <quote>přibližný</quote>, protože nemusí nutně obsahovat všechny položky profilu, kterými musí být program řádně omezen pomocí <phrase>AppArmor</phrase>. Minimální přibližný profil <command>aa-autodep</command> má přinejmenším základní direktivu, která obsahuje základní položky profilu potřebné pro většinu programů. Pro určité typy programů generuje <command>aa-autodep</command> rozšířený profil. Profil je generován rekurzivním voláním <command>ldd (1)</command> na spustitelných souborech uvedených na příkazovém řádku.

source: To generate an approximate profile, use the <command>aa-autodep</command> program. The program argument can be either the simple name of the program, which <command>aa-autodep</command> finds by searching your shell's path variable, or it can be a fully qualified path. The program itself can be of any type (ELF binary, shell script, Perl script, etc.). <command>aa-autodep</command> generates an approximate profile to improve through the dynamic profiling that follows.
cs: Chcete-li vygenerovat přibližný profil, použijte program <command>aa-autodep</command>. Argument programu může být buď jednoduchý název programu, který <command>aa-autodep</command> najde hledáním proměnné cesty vaší shellu, nebo to může být plně kvalifikovaná cesta. Samotný program může být libovolného typu (ELF binární, shell skript, Perl skript atd.). <command>aa-autodep</command> generuje přibližný profil, který se má zlepšit pomocí následujícího dynamického profilování.

source: The resulting approximate profile is written to the <filename>/etc/apparmor.d</filename> directory using the <phrase>AppArmor</phrase> profile naming convention of naming the profile after the absolute path of the program, replacing the forward slash (<literal>/</literal>) characters in the path with period (<literal>.</literal>) characters. The general syntax of <command>aa-autodep</command> is to enter the following in a terminal window:
cs: Výsledný přibližný profil je zapsán do adresáře <filename>/etc/apparmor.d</filename> s použitím profilu konvence názvů <phrase>AppArmor</phrase> pro název profilu podle absolutní cesty jeho programu, s nahrazením všech znaků lomítko (<literal>/</literal>) tečkami (<literal>.</literal>). Obecná syntaxe <command>aa-autodep</command> na příkazovém řádku:

source: <prompt>tux &gt; </prompt><command>sudo</command> aa-autodep [ -d <replaceable>/PATH/TO/PROFILES</replaceable> ] [<replaceable>PROGRAM1</replaceable> <replaceable>PROGRAM2</replaceable>...]
cs: <prompt>tux &gt; </prompt><command>sudo</command> aa-autodep [ -d <replaceable>/CESTA/K/PROFILŮM</replaceable> ] [<replaceable>PROGRAM1</replaceable> <replaceable>PROGRAM2</replaceable>...]

source: If you do not enter the program name or names, you are prompted for them. <replaceable>/path/to/profiles</replaceable> overrides the default location of <filename>/etc/apparmor.d</filename>, should you keep profiles in a location other than the default.
cs: Nezadáte-li název nebo názvy programů, budete vyzváni k jejich zadání. <replaceable>/cesta/k/profilům</replaceable> přepíše výchozí umístění <filename>/etc/apparmor.d</filename>, chcete-li mít profily v jiném než výchozím umístění.

source: To begin profiling, you must create profiles for each main executable service that is part of your application (anything that might start without being a child of another program that already has a profile). Finding all such programs depends on the application in question. Here are several strategies for finding such programs:
cs: Chcete-li začít profilovat, musíte vytvořit profily pro každou hlavní spustitelnou službu, která je součástí vaší aplikace (cokoli, co by se mohlo z aplikace spustit, ale není to dítě jiného programu, který již profil má). Nalezení všech takových programů závisí na dané aplikaci. Zde je několik strategií pro nalezení takových programů:

source: Directories
cs: Adresáře

source: If all the programs to profile are in one directory and there are no other programs in that directory, the simple command <command>aa-autodep</command> <replaceable>/path/to/your/programs/*</replaceable> creates basic profiles for all programs in that directory.
cs: Jsou-li všechny programy, které se mají profilovat, v jednom adresáři a žádné jiné programy v něm nejsou, pak jednoduchý příkaz <command>aa-autodep</command> <replaceable>/cesta/k/vašim/programům/*</replaceable> vytvoří přibližné profily pro všechny programy v tomto adresáři.

source: You can run your application and use the standard Linux <command>pstree</command> command to find all processes running. Then manually hunt down the location of these programs and run the <command>aa-autodep</command> for each one. If the programs are in your path, <command>aa-autodep</command> finds them for you. If they are not in your path, the standard Linux command <command>find</command> might be helpful in finding your programs. Execute <command>find / -name '</command> <replaceable>MY_APPLICATION</replaceable>' -print to determine an application's path (<replaceable>MY_APPLICATION</replaceable> being an example application). You may use wild cards if appropriate.
cs: Můžete spustit aplikaci a pomocí standardního příkazu Linux <command>pstree</command> najít všechny spuštěné procesy. Poté ručně vyhledejte umístění těchto programů a pro každý z nich spusťte <command>aa-autodep</command>. Pokud jsou programy na Vaší cestě (proměnná prostředí PATH), <command>aa-autodep</command> je najde za Vás. Pokud tam nejsou, může být při hledání programů užitečný standardní příkaz Linux <command>find</command>. Spusťte <command>find / -name'</command> <replaceable>MOJE_APLIKACE</replaceable>' -print a určete cestu aplikace (například <replaceable>MOJE_APLIKACE</replaceable>). V případě potřeby můžete zadat názvy se zástupnými znaky (wildcards).

source: aa-complain—Entering Complain or Learning Mode
cs: aa-complain — Zahájit stěžovací nebo výukový režim

source: The complain or learning mode tool (<command>aa-complain</command>) detects violations of <phrase>AppArmor</phrase> profile rules, such as the profiled program accessing files not permitted by the profile. The violations are permitted, but also logged. To improve the profile, turn complain mode on, run the program through a suite of tests to generate log events that characterize the program's access needs, then postprocess the log with the <phrase>AppArmor</phrase> tools to transform log events into improved profiles.
cs: Nástroj pro stěžovací nebo výukový režim (<command>aa-complain</command>) detekuje porušení pravidel profilů <phrase>AppArmor</phrase>, jako je například profilovaný program, který přistupuje k souborům, které profil nepovoluje. Porušení je povoleno, ale také zaznamenáno. Chcete-li vylepšit profil, zapněte režim stěžování, spusťte program pomocí sady testů, které generují události protokolu, které charakterizují přístupové potřeby programu a následně protokol zpracujte pomocí nástrojů <phrase>AppArmor</phrase>, aby se z událostí protokolu odvodila a zapsala vylepšení profilu.

source: Manually activating complain mode (using the command line) adds a flag to the top of the profile so that <literal>/bin/foo</literal> becomes <literal>/bin/foo flags=(complain)</literal>. To use complain mode, open a terminal window and enter one of the following lines as <systemitem class="username">root</systemitem>:
cs: Ruční aktivace režimu stížností (z příkazového řádku) přidá na začátek profilu příznak, takže z <literal>/bin/foo</literal> se stane <literal>/bin/foo flags=(stížnost)</literal>. Chcete-li použít režim stěžování, otevřete okno terminálu a zadejte jako uživatel <systemitem class="username">root</systemitem> jeden z následujících řádků:

source: If the example program (<replaceable>PROGRAM1</replaceable>) is in your path, use:
cs: Je-li profilovaný program (<replaceable>PROGRAM1</replaceable>) na vaší cestě ($PATH), použijte:

source: <prompt>tux &gt; </prompt><command>sudo</command> aa-complain [<replaceable>PROGRAM1</replaceable> <replaceable>PROGRAM2</replaceable> ...]
cs: <prompt>tux &gt; </prompt><command>sudo</command> aa-complain <replaceable>PROGRAM1</replaceable>

source: If the program is not in your path, specify the entire path as follows:
cs: Pokud program není ve Vaší cestě, zadejte celou cestu takto:

source: If the profiles are not in <filename>/etc/apparmor.d</filename>, use the following to override the default location:
cs: Nejsou-li profily ve <filename>/etc/apparmor.d</filename>, přepište výchozí umístění takto:

source: <prompt>tux &gt; </prompt><command>sudo</command> aa-complain <replaceable>/path/to/profiles/</replaceable><replaceable>PROGRAM1</replaceable>
cs: <prompt>tux &gt; </prompt><command>sudo</command> aa-complain <replaceable>/cesta/k/profilům/</replaceable><replaceable>PROGRAM1</replaceable>

source: Specify the profile for <replaceable>/sbin/program1</replaceable> as follows:
cs: Zadejte profil pro <replaceable>/sbin/program1</replaceable> takto:

source: Each of the above commands activates the complain mode for the profiles or programs listed. If the program name does not include its entire path, <command>aa-complain</command> searches <envar>$PATH</envar> for the program. For example, <command>aa-complain /usr/sbin/*</command> finds profiles associated with all of the programs in <filename>/usr/sbin</filename> and puts them into complain mode. <command>aa-complain /etc/apparmor.d/*</command> puts all of the profiles in <filename>/etc/apparmor.d</filename> into complain mode.
cs: Každý z výše uvedených příkazů aktivuje režim stížnosti pro uvedené profily nebo programy. Neobsahuje-li název programu celou cestu, vyhledá <command>aa-complain</command> program na některé cestě v <envar>$PATH</envar>. Například <command>aa-complain /usr/sbin/*</command> najde profily spojené se všemi programy ve <filename>/usr/sbin</filename> a uvede je do stěžovacího režimu. <command>aa-complain /etc/apparmor.d/*</command> přepne všechny profily v adresáři <filename>/etc/apparmor.d</filename> do stěžovacího režimu.

source: Toggling Profile Mode with YaST
cs: Přepnutí režimu profilu pomocí YaST

source: YaST offers a graphical front-end for toggling complain and enforce mode. See <xref linkend="sec.apparmor.yast.manage.profmodes"/> for information.
cs: YaST nabízí grafický nástroj pro přepínání mezi režimy stěžování a vynucování. Viz <xref linkend="sec.apparmor.yast.manage.profmodes"/>.

source: aa-decode—Decoding Hex-encoded Strings in <phrase>AppArmor</phrase> Log Files
cs: aa-decode — Dekódování hexadecimálně zakódovaných řetězců v žurnálových souborech <phrase>AppArmor</phrase>

source: <command>aa-decode</command> will decode hex-encoded strings in the <phrase>AppArmor</phrase> log output. It can also process the audit log on standard input, convert any hex-encoded <phrase>AppArmor</phrase> log entries, and display them on standard output.
cs: <command>aa-decode</command> bude dekódovat řetězce kódované hexadecimálně ve výstupu protokolu <phrase>AppArmor</phrase>. Může také zpracovávat protokol auditu na standardní vstup, převádět libovolné hexadecimálně kódované položky protokolu <phrase>AppArmor</phrase> a zobrazovat je na standardním výstupu.

source: aa-disable—Disabling an <phrase>AppArmor</phrase> Security Profile
cs: aa-disable — Vypnout bezpečnostní profil <phrase>AppArmor</phrase>

source: Use <command>aa-disable</command> to disable the enforcement mode for one or more <phrase>AppArmor</phrase> profiles. This command will unload the profile from the kernel, and prevent the profile from being loaded on <phrase>AppArmor</phrase> start-up. Use <command>aa-enforce</command> or <command>aa-complain</command> utilities to change this behavior.
cs: Pomocí <command>aa-disable</command> můžete zakázat režim vynucování pro jeden nebo více profilů <phrase>AppArmor</phrase>. Tento příkaz uvolní profil z jádra a zabrání načtení profilu při spuštění aplikace <phrase>AppArmor</phrase>. Toto chování můžete změnit pomocí nástrojů <command>aa-vynucení</command> nebo <command>aa-complaint</command>.

source: aa-easyprof—Easy Profile Generation
cs: aa-easyprof — Snadné generování profilu

source: <command>aa-easyprof</command> provides an easy-to-use interface for <phrase>AppArmor</phrase> profile generation. <command>aa-easyprof</command> supports the use of templates and profile groups to quickly profile an application. While <command>aa-easyprof</command> can help with profile generation, its utility is dependent on the quality of the templates, profile groups and abstractions used. Also, this tool may create a profile that is less restricted than when creating a profile manually or with <command>aa-genprof</command> and <command>aa-logprof</command>.
cs: <command>aa-easyprof</command> poskytuje snadno použitelné rozhraní pro generování profilů <phrase>AppArmor</phrase>. <command>aa-easyprof</command> podporuje použití šablon a skupin profilů pro rychlé profilování aplikace. I když <command>aa-easyprof</command> může pomoci s generováním profilu, jeho užitečnost závisí na kvalitě použitých šablon, skupin profilů a abstrakcí. Tento nástroj také může vytvořit profil, který je méně omezený než při vytváření profilu ručně nebo použitím <command>aa-genprof</command> a <command>aa-logprof</command>.

source: For more information, see the man page of <command>aa-easyprof</command> (8).
cs: Více informací má stránka manuálu programu: man <command>aa-easyprof</command> (8).

source: aa-enforce—Entering Enforce Mode
cs: aa-enforce — Spustit režim vynucování

source: The enforce mode detects violations of <phrase>AppArmor</phrase> profile rules, such as the profiled program accessing files not permitted by the profile. The violations are logged and not permitted. The default is for enforce mode to be enabled. To log the violations only, but still permit them, use complain mode.
cs: Režim vynucení detekuje porušení pravidel profilu <phrase>AppArmor</phrase>, jako jsou profilované programy, které přístup k souborům nepovolují. Porušení je zaznamenáno a není povoleno. Režim vynucení je ve výchozím stavu povolen. Chcete-li protokolovat pouze porušení, ale přesto je povolit, použijte režim stížnosti.

source: Manually activating enforce mode (using the command line) removes the complain flag from the top of the profile so that <literal>/bin/foo flags=(complain)</literal> becomes <literal>/bin/foo</literal>. To use enforce mode, open a terminal window and enter one of the following lines.
cs: Ruční aktivace režimu vynucení (z příkazového řádku) odstraní příznak stěžování ze začátku profilu, takže z <literal>/bin/foo flags=(complain)</literal> se stává <literal>/bin/foo</literal>. Chcete-li použít režim vynucování, otevřete okno terminálu a zadejte jeden z následujících řádků.

source: If the program is not in your path, specify the entire path, as follows:
cs: Není-li program ve Vaší cestě ($PATH), zadejte úplnou cestu takto:

source: If the profiles are not in <replaceable>/etc/apparmor.d</replaceable>, use the following to override the default location:
cs: Nejsou-li profily v <replaceable>/etc/apparmor.d</replaceable>, přepište standardní umístění takto:

source: <prompt>tux &gt; </prompt><command>sudo</command> aa-enforce -d <replaceable>/path/to/profiles/ program1</replaceable>
cs: <prompt>tux &gt; </prompt><command>sudo</command> aa-enforce -d <replaceable>/cesta/k/profilům/ program1</replaceable>

source: Each of the above commands activates the enforce mode for the profiles and programs listed.
cs: Každý z výše uvedených příkazů aktivuje režim vynucení pro uvedené profily a programy.

source: If you do not enter the program or profile names, you are prompted to enter one. <replaceable>/path/to/profiles</replaceable> overrides the default location of <filename>/etc/apparmor.d</filename>.
cs: Nezadáte-li názvy programů nebo profilů, budete vyzváni k jejich zadání. <replaceable>/cesta/k/profilům</replaceable> přepíše výchozí umístění <filename>/etc/apparmor.d</filename>.

source: The argument can be either a list of programs or a list of profiles. If the program name does not include its entire path, <command>aa-enforce</command> searches <envar>$PATH</envar> for the program.
cs: Argumentem může být buď seznam programů, nebo seznam profilů. Pokud název programu neobsahuje celou cestu, vyhledá <command>aa-enforce</command> program prohledáním <envar>$PATH</envar>.

source: aa-exec—Confining a Program with the Specified Profile
cs: aa-exec — Omezení programu specifikovaným profilem

source: Use <command>aa-exec</command> to launch a program confined by a specified profile and/or profile namespace. If both a profile and namespace are specified, the program will be confined by the profile in the new namespace. If only a profile namespace is specified, the profile name of the current confinement will be used. If neither a profile nor namespace is specified, the command will be run using the standard profile attachment—as if you did not use the <command>aa-exec</command> command.
cs: Příkazem <command>aa-exec</command> spusťte program omezený zadaným profilem nebo názvovým prostorem profilu. Pokud je zadán profil i názvový prostor, bude program omezen profilem v novém názvovém prostoru. Pokud je zadán pouze názvový prostor profilu, použije se název profilu aktuálního omezení. Pokud není zadán ani profil, ani názvový prostor, bude příkaz spuštěn pomocí standardní přílohy profilu - jako byste nepoužili příkaz <command>aa-exec</command>.

source: For more information on the command's options, see its manual page <command>man 8 aa-exec</command>.
cs: Další informace o možnostech příkazu najdete na jeho manuálové stránce <command>man 8 aa-exec</command>.

source: aa-genprof—Generating Profiles
cs: aa-genprof — Generování profilů

source: <command>aa-genprof</command> is <phrase>AppArmor</phrase>'s profile generating utility. It runs <command>aa-autodep</command> on the specified program, creating an approximate profile (if a profile does not already exist for it), sets it to complain mode, reloads it into <phrase>AppArmor</phrase>, marks the log, and prompts the user to execute the program and exercise its functionality. Its syntax is as follows:
cs: <command>aa-genprof</command> je utilita pro generování profilů aplikace <phrase>AppArmor</phrase>. Spustí <command>aa-autodep</command> ve specifikovaném programu, vytvoří přibližný profil (pokud pro něj profil již neexistuje), nastaví jej na režim stížnosti, znovu jej načte do <phrase>AppArmor</phrase>, označí protokol a vyzve uživatele k provedení programu a vyzkoušení jeho funkce. Syntaxe:

source: <prompt>tux &gt; </prompt><command>sudo</command> aa-genprof [ -d <replaceable>/path/to/profiles</replaceable> ] <replaceable>PROGRAM</replaceable>
cs: <prompt>tux &gt; </prompt><command>sudo</command> aa-genprof [ -d <replaceable>/cesta/k/profilům</replaceable> ] <replaceable>PROGRAM</replaceable>

source: To create a profile for the Apache Web server program httpd2-prefork, do the following as <systemitem class="username">root</systemitem>:
cs: Chcete-li vytvořit profil pro program httpd2-prefork webového serveru Apache, proveďte jako <systemitem class="username">root</systemitem> následující kroky:

source: Enter <command>systemctl stop apache2</command>.
cs: Zadejte <command>systemctl stop apache2</command>.

source: Next, enter <command>aa-genprof httpd2-prefork</command>.
cs: Nyní zadejte <command>aa-genprof httpd2-prefork</command>.

source: Now <command>aa-genprof</command> does the following:
cs: Teď <command>aa-genprof</command> provede toto:
