Repository: openSUSE/doc-sle-translations
Catalog: */po/apparmor_managing.*.po
Languages: cs

# _
source: translator-credits
cs: překladatelské kredity alkas alkas@volny.cz, 2016, 2020

source: Managing Profiled Applications
cs: Správa profilovaných aplikací

source: After creating profiles and immunizing your applications, <phrase role="productname"><phrase os="osuse">openSUSE® Leap</phrase><phrase os="sles">SUSE® Linux Enterprise Server</phrase><phrase os="sled">SUSE® Linux Enterprise Desktop</phrase></phrase> becomes more efficient and better protected as long as you perform <phrase>AppArmor®</phrase> profile maintenance (which involves analyzing log files, refining your profiles, backing up your set of profiles and keeping it up-to-date). You can deal with these issues before they become a problem by setting up event notification by e-mail, updating profiles from system log entries by running the aa-logprof tool, and dealing with maintenance issues.
cs: Po vytvoření profilů a imunizaci vašich aplikací, stane se <phrase role="productname"><phrase os="osuse">openSUSE® Leap</phrase><phrase os="sles">SUSE® Linux Enterprise Server</phrase><phrase os="sled">SUSE® Linux Enterprise Desktop</phrase></phrase> efektivnějším a lépe chráněným, pokud provádíte údržbu profilu <phrase>AppArmor®</phrase> (tj. analýzu záznamů log souborů, vylepšování vašich profilů, zálohování vaší sady profilů a jejich aktualizace). Měli byste se tím zabývat dříve, než se to stane problémem, nastavením hlášení událostí e-mailem, aktualizací profilů podle položek systémového žurnálu (logu) nástrojem aa-logprof a řešením problémů údržby.

source: Reacting to Security Event Rejections
cs: Reakce na odmítnutí bezpečnostních událostí

source: When you receive a security event rejection, examine the access violation and determine if that event indicated a threat or was part of normal application behavior. Application-specific knowledge is required to make the determination. If the rejected action is part of normal application behavior, run <command>aa-logprof</command> at the command line.
cs: Když obdržíte odmítnutí bezpečnostní události, prozkoumejte narušení přístupu a zjistěte, zda tato událost indikovala hrozbu nebo byla součástí běžného chování aplikace. K určení jsou zapotřebí znalosti specifické pro aplikaci. Pokud je odmítnutá akce součástí běžného chování aplikace, spusťte z příkazového řádku příkaz <command>aa-logprof</command>.

source: If the rejected action is not part of normal application behavior, this access should be considered a possible intrusion attempt (that was prevented) and this notification should be passed to the person responsible for security within your organization.
cs: Pokud odmítnutá akce není součástí běžného chování aplikace, měl by být tento přístup považován za možný pokus o narušení (kterému bylo zabráněno) a toto oznámení by mělo být předáno osobě odpovědné za bezpečnost ve vaší organizaci.

source: Maintaining Your Security Profiles
cs: Údržba vašich bezpečnostních profilů

source: In a production environment, you should plan on maintaining profiles for all of the deployed applications. The security policies are an integral part of your deployment. You should plan on taking steps to back up and restore security policy files, plan for software changes, and allow any needed modification of security policies that your environment dictates.
cs: V produkčním prostředí byste měli plánovat údržbu profilů pro všechny nasazené aplikace. Bezpečnostní zásady jsou nedílnou součástí vašeho nasazení. Měli byste plánovat kroky k zálohování a obnovení souborů zásad zabezpečení, naplánovat změny softwaru a povolit jakékoli potřebné změny zásad zabezpečení, které stanoví vaše prostředí.

source: Backing Up Your Security Profiles
cs: Zálohování vašich bezpečnostních profilů

source: Backing up profiles might save you from having to re-profile all your programs after a disk crash. Also, if profiles are changed, you can easily restore previous settings by using the backed up files.
cs: Zálohování profilů může vést k tomu, že nebudete muset po selhání disku znovu profilovat všechny programy. A když se změní profily, můžete snadno obnovit předchozí nastavení pomocí zálohovaných souborů.

source: Back up profiles by copying the profile files to a specified directory.
cs: Záloha profilů kopírováním profilu do určeného adresáře.

source: You should first archive the files into one file. To do this, open a terminal window and enter the following as <systemitem class="username">root</systemitem>:
cs: Nejprve byste měli profily archivovat do jednoho souboru. Otevřete tedy okno terminálu a zadejte následující příkaz jako<systemitem class="username">root</systemitem>:

source: The simplest method to ensure that your security policy files are regularly backed up is to include the directory <filename>/etc/apparmor.d</filename> in the list of directories that your backup system archives.
cs: Nejjednodušší metodou, jak zajistit pravidelné zálohování souborů zásad zabezpečení, je zahrnout adresář <filename>/etc/apparmor.d</filename> do seznamu adresářů, které váš záložní systém archivuje.

source: You can also use <command>scp</command> or a file manager like Nautilus to store the files on some kind of storage media, the network, or another computer.
cs: Můžete také použít <command>scp</command> nebo správce souborů, jako je Nautilus, k uložení souborů na nějakém paměťovém médiu, na síti nebo na jiném počítači.

source: Changing Your Security Profiles
cs: Změna vašich bezpečnostních profilů

source: Maintenance of security profiles includes changing them if you decide that your system requires more or less security for its applications. To change your profiles in <phrase>AppArmor</phrase>, refer to <xref xrefstyle="SectTitleOnPage" linkend="sec.apparmor.yast.edit"/>.
cs: Údržba bezpečnostních profilů zahrnuje jejich změnu, pokud se rozhodnete, že váš systém vyžaduje pro své aplikace více či méně zabezpečení. Chcete-li změnit své profily v <phrase>AppArmor</phrase>, postupujte podle <xref xrefstyle="SectTitleOnPage" linkend="sec.apparmor.yast.edit"/>.

source: Introducing New Software into Your Environment
cs: Představujeme nový software do vašeho prostředí

source: When you add a new application version or patch to your system, you should always update the profile to fit your needs. You have several options, depending on your company's software deployment strategy. You can deploy your patches and upgrades into a test or production environment. The following explains how to do this with each method.
cs: Když do systému přidáte novou verzi nebo záplatu (patch) aplikace, měli byste profil vždy aktualizovat, aby vyhovoval vašim potřebám. V závislosti na strategii nasazení softwaru vaší společnosti máte několik možností. Záplatu a upgradů můžete nasadit do testovacího nebo produkčního prostředí. Následující text vysvětluje, jak to provést s každou metodou.

source: If you intend to deploy a patch or upgrade in a test environment, the best method for updating your profiles is to run <command>aa-logprof</command> in a terminal as <systemitem class="username">root</systemitem>. For detailed instructions, refer to <xref xrefstyle="HeadingOnPage" linkend="sec.apparmor.commandline.profiling.summary.logprof"/>.
cs: Máte-li v úmyslu zavést opravu nebo upgrade v testovacím prostředí, nejlepší metodou pro aktualizaci vašich profilů je spuštění příkazu <command>aa-logprof</command> v terminálu jako <systemitem class="username">root</systemitem>. Podrobné pokyny najdete v <xref xrefstyle="HeadingOnPage" linkend="sec.apparmor.commandline.profiling.summary.logprof"/>.

source: If you intend to deploy a patch or upgrade directly into a production environment, the best method for updating your profiles is to monitor the system frequently to determine if any new rejections should be added to the profile and update as needed using <command>aa-logprof</command>. For detailed instructions, refer to <xref xrefstyle="HeadingOnPage" linkend="sec.apparmor.commandline.profiling.summary.logprof"/>.
cs: Pokud máte v úmyslu zavést opravu nebo upgrade přímo do produkčního prostředí, nejlepší metodou pro aktualizaci vašich profilů je časté sledování systému, aby se určilo, zda by měla být do profilu přidána jakákoli nová odmítnutí a aktualizována podle potřeby pří <command>aa-logprof</command>. Podrobné pokyny viz <xref xrefstyle="HeadingOnPage" linkend="sec.apparmor.commandline.profiling.summary.logprof"/>.
