Repository: openSUSE/doc-sle-translations
Catalog: */po/apparmor_changehat.*.po
Languages: cs

# _
source: translator-credits
cs: překladatelské kredity alkas alkas@volny.cz, 2016, 2020

source: Profiling Your Web Applications Using ChangeHat
cs: Profilování webových aplikací pomocí ChangeHat

source: An <phrase>AppArmor®</phrase> profile represents the security policy for an individual program instance or process. It applies to an executable program, but if a portion of the program needs different access permissions than other portions, the program can <quote>change hats</quote> to use a different security context, distinctive from the access of the main program. This is known as a <emphasis>hat</emphasis> or <emphasis>subprofile</emphasis>.
cs: Profil <phrase>AppArmor®</phrase> obsahuje zásady zabezpečení pro jednotlivou instanci nebo proces programu. Platí pro spustitelný program, ale pokud část programu potřebuje jiná přístupová oprávnění než jeho jiné části, může program <quote>"změnit klobouky"</quote>, aby použil jiný bezpečnostní kontext, odlišný od přístupu hlavního programu, což se nazývá <emphasis>klobouk</emphasis> nebo <emphasis>podprofil</emphasis> (subprofil).

source: ChangeHat enables programs to change to or from a <emphasis>hat</emphasis> within an <phrase>AppArmor</phrase> profile. It enables you to define security at a finer level than the process. This feature requires that each application be made <quote>ChangeHat-aware</quote>, meaning that it is modified to make a request to the <phrase>AppArmor</phrase> module to switch security domains at specific times during the application execution. One example of a ChangeHat-aware application is the Apache Web server.
cs: ChangeHat umožňuje programům změnit <emphasis>klobouk</emphasis> uvnitř profilu <phrase>AppArmor</phrase>. To umožňuje definovat zabezpečení na jemnější úrovni než pro celý proces. Tato funkce vyžaduje, aby každá aplikace byla vytvořena <quote>ChangeHat-aware</quote> (vědoma si změny klobouku), což znamená, že je upravena tak, aby podala žádost modulu <phrase>AppArmor</phrase> a ten pak přepínal domény zabezpečení v určitých časech během její činnosti. Jedním příkladem aplikace podporující ChangeHat je webový server Apache.

source: A profile can have an arbitrary number of subprofiles, but there are only two levels: a subprofile cannot have further child profiles. A subprofile is written as a separate profile. Its name consists of the name of the containing profile followed by the subprofile name, separated by a <literal>^</literal>.
cs: Profil může mít libovolný počet podprofilů ("klobouků"), ale jsou možné pouze dvě úrovně: podprofil nemůže mít další podprofily. Podprofil je napsán jako samostatný profil. Jeho název se skládá z názvu hlavního (nadřazeného) profilu následovaného názvem podprofilu, odděleným znakem <literal>^</literal>.

source: Subprofiles are either stored in the same file as the parent profile, or in a separate file. The latter case is recommended on sites with many hats—it allows the policy caching to handle changes at the per hat level. If all the hats are in the same file as the parent profile, then the parent profile and all hats must be recompiled.
cs: Podprofily jsou buď uloženy ve stejném souboru jako nadřazený profil, nebo v samostatném souboru. Druhý případ se doporučuje na webech s mnoha klobouky - umožňuje kešování zásad, aby zpracovával změny na úrovních jednotlivých klobouků. Pokud jsou všechny klobouky ve stejném souboru jako nadřazený profil, je nutno překompilovat nadřazený profil a všechny klobouky.

source: An external subprofile that is going to be used as a hat, must begin with the word <literal>hat</literal> or the <literal>^</literal> character.
cs: Externí podprofil, který bude použit jako klobouk, musí začínat slovem <literal>hat</literal> nebo znakem <literal>^</literal>.

source: The following two subprofiles <emphasis>cannot</emphasis> be used as a hat:
cs: Následující dva podprofily <emphasis>nelze</emphasis> použít jako klobouk:

source: or
cs: nebo

source: While the following two are treated as hats:
cs: Avšak následující dva jsou považovány za klobouky:

source: hat /foo//bar { } # this syntax is not highlighted in vim
cs: hat /foo//bar { } # tato syntaxe nebude ve vim zvýrazněna

source: Note that the security of hats is considerably weaker than that of full profiles. Using certain types of bugs in a program, an attacker may be able to escape from a hat into the containing profile. This is because the security of hats is determined by a secret key handled by the containing process, and the code running in the hat must not have access to the key. Thus, change_hat is most useful with application servers, where a language interpreter (such as PERL, PHP, or Java) is isolating pieces of code such that they do not have direct access to the memory of the containing process.
cs: Pozor, bezpečnost klobouků je výrazně slabší než u úplných hlavních profilů. Při použití určitých typů chyb v programu může útočník uniknout z klobouku do obsahujícího profilu. Důvodem je to, že zabezpečení klobouků je určeno tajným klíčem zpracovaným procesem obsahujícím kód a kód spuštěný v klobouku nesmí mít přístup ke klíči. Proto je change_hat nejužitečnější u aplikačních serverů, kde interpret jazyka (např. PERL, PHP nebo Java) izoluje části kódu tak, že nemají přímý přístup do paměti procesu, který je obsahuje.

source: The rest of this chapter describes using change_hat with Apache, to contain Web server components run using <literal>mod_perl</literal> and <literal>mod_php</literal>. Similar approaches can be used with any application server by providing an application module similar to the <literal>mod_apparmor</literal> described next in <xref linkend="sec.apparmor.hat.config.directives"/>.
cs: Zbytek této kapitoly popisuje použití change_hat s Apache, aby obsahoval komponenty webového serveru spuštěné pomocí <literal>mod_perl</literal> a <literal>mod_php</literal>. Podobné přístupy lze použít s jakýmkoli aplikačním serverem poskytnutím aplikačního modulu podobného <literal>mod_apparmor</literal> popsanému dále v <xref linkend="sec.apparmor.hat.config.directives"/>.

source: For More Information
cs: Další informace

source: For more information, see the <command>change_hat</command> man page.
cs: Další informace viz stránku man <command>change_hat</command>.

source: Configuring Apache for <systemitem>mod_apparmor</systemitem>
cs: Konfigurace Apache pro <systemitem>mod_apparmor</systemitem>

source: <phrase>AppArmor</phrase> provides a <literal>mod_apparmor</literal> module (package <systemitem class="resource">apache2-mod-apparmor</systemitem>) for the Apache program<phrase os="sled"> (only included in SUSE Linux Enterprise Server)</phrase>. This module makes the Apache Web server ChangeHat aware. Install it along with Apache.
cs: <phrase>AppArmor</phrase> poskytuje <literal>mod_apparmor</literal> modul (balíček <systemitem class="resource">apache2-mod-apparmor</systemitem>) pro program Apache <phrase os = "sled" > (pouze u SUSE Linux Enterprise Server)</phrase>. Tento modul umožňuje webovému serveru Apache pracovat s ChangeHat. Nainstalujte jej společně s Apache.

source: When Apache is ChangeHat-aware, it checks for the following customized <phrase>AppArmor</phrase> security profiles in the order given for every URI request that it receives.
cs: Když je si Apache "vědom" ChangeHat, zkontroluje následující přizpůsobené bezpečnostní profily <phrase>AppArmor</phrase> v pořadí určeném pro každý požadavek URI, který obdrží.

source: URI-specific hat. For example, <filename>^www_app_name/templates/classic/images/bar_left.gif</filename>
cs: Klobouk specifický pro URI. Například <filename>^www_app_name/templates/classic/images/bar_left.gif</filename>

source: <literal>DEFAULT_URI</literal>
cs: <literal>VÝCHOZÍ_URI</literal>

source: <literal>HANDLING_UNTRUSTED_INPUT</literal>
cs: <literal>ZPRACOVÁNÍ_NEDŮVĚRYHODNÉHO_VSTUPU</literal>

source: Apache Configuration
cs: Konfigurace Apache

source: If you install <systemitem class="resource">apache2-mod-apparmor</systemitem>, make sure the module is enabled, and then restart Apache by executing the following command:
cs: Nainstalujete-li <systemitem class="resource">apache2-mod-apparmor</systemitem>, ujistěte se, že je modul povolen, a restartujte Apache provedením příkazu:

source: Apache is configured by placing directives in plain text configuration files. The main configuration file is usually <filename>/etc/apache2/httpd.conf</filename>. When you compile Apache, you can indicate the location of this file. Directives can be placed in any of these configuration files to alter the way Apache behaves. When you make changes to the main configuration files, you need to reload Apache with <command>sudo systemctl reload apache2</command>, so the changes are recognized.
cs: Apache je konfigurován umístěním direktiv do konfiguračních souborů v prostém textu. Hlavním konfiguračním souborem je obvykle <filename>/etc/apache2/httpd.conf</filename>. Při kompilaci Apache můžete označit umístění tohoto souboru. Direktivy mohou být umístěny do kteréhokoli z těchto konfiguračních souborů, kde změní způsob, jakým se Apache chová. Když provedete změny v hlavních konfiguračních souborech, musíte znovu načíst Apache pomocí <command>sudo systemctl reload apache2</command>, aby byly změny přijaty.

source: Virtual Host Directives
cs: Direktivy virtuálního hostitele

source: &lt;VirtualHost&gt; and &lt;/VirtualHost&gt; directives are used to enclose a group of directives that will apply only to a particular virtual host. For more information on Apache virtual host directives, refer to <link xlink:href="http://httpd.apache.org/docs/2.4/en/mod/core.html#virtualhost"/>.
cs: Direktivy &lt;VirtualHost&gt; a &lt;/VirtualHost&gt; se používají k uzavření skupiny direktiv, které se aplikují pouze na určeného virtuálního hostitele. Více informací o těchto direktivách Apache najdete na <link xlink:href="http://httpd.apache.org/docs/2.4/en/mod/core.html#virtualhost"/>.

source: The ChangeHat-specific configuration keyword is <literal>AADefaultHatName</literal>. It is used similarly to <literal>AAHatName</literal>, for example, <literal>AADefaultHatName My_Funky_Default_Hat</literal>.
cs: Konfigurační klíčové slovo specifické pro ChangeHat je <literal>AADefaultHatName</literal>. Používá se podobně jako <literal>AAHatName</literal>, například <literal>AADefaultHatName My_Funky_Default_Hat</literal>.

source: It allows you to specify a default hat to be used for virtual hosts and other Apache server directives, so that you can have different defaults for different virtual hosts. This can be overridden by the <literal>AAHatName</literal> directive and is checked for only if there is not a matching <literal>AAHatName</literal> or hat named by the URI. If the <literal>AADefaultHatName</literal> hat does not exist, it falls back to the <literal>DEFAULT_URI</literal> hat if it exists/
cs: Umožňuje určit výchozí klobouk, který se má použít pro virtuální hostitele a další direktivy serveru Apache, takže můžete mít různá výchozí nastavení pro různé virtuální hostitele. To lze potlačit směrnicí <literal>AAHatName</literal> a je kontrolováno, pouze když neexistuje odpovídající <literal>AAHatName</literal> nebo klobouk pojmenovaný URI. Pokud klobouk <literal>AADefaultHatName</literal> neexistuje, použije se klobouk <literal>DEFAULT_URI</literal>, pokud existuje/

source: If none of those are matched, it goes back to the <quote>parent</quote> Apache hat.
cs: Pokud se žádný z nich neshoduje, přejde se zpět do <quote>rodičovského</quote> klobouku Apache.

source: Location and Directory Directives
cs: Direktivy umístění a adresáře

source: Location and directory directives specify hat names in the program configuration file so the Apache calls the hat regarding its security. For Apache, you can find documentation about the location and directory directives at <link xlink:href="http://httpd.apache.org/docs/2.4/en/sections.html"/>.
cs: Direktivy umístění a adresářů určují názvy klobouků v konfiguračním souboru programu, takže Apache volá klobouk pro své zabezpečení. Pro Apache najdete dokumentaci o direktivách pro umístění a adresáře na <link xlink:href="http://httpd.apache.org/docs/2.4/en/sections.html"/>.

source: The location directive example below specifies that, for a given location, <literal>mod_apparmor</literal> should use a specific hat:
cs: Následující příklad direktivy umístění udává, že pro dané umístění by měl <literal>mod_apparmor</literal> používat konkrétní klobouk:

source: &lt;Location /foo/&gt; AAHatName MY_HAT_NAME &lt;/Location&gt;
cs: &lt;Location /foo/&gt; AAHatName NÁZEV_KLOBOUKU &lt;/Location&gt;

source: This tries to use <literal>MY_HAT_NAME</literal> for any URI beginning with <filename>/foo/</filename> (<filename>/foo/</filename>, <filename>/foo/bar</filename>, <filename>/foo/cgi/path/blah_blah/blah</filename>, etc.).
cs: Toto je pokus o použití <literal>NÁZEV_KLOBOUKU</literal>pro každý URI začínající <filename>/foo/</filename> (např. <filename>/foo/</filename>, <filename>/foo/bar</filename>, <filename>/foo/cgi/path/blah_blah/blah</filename>, atd.).

source: The directory directive works similarly to the location directive, except it refers to a path in the file system as in the following example:
cs: Direktiva adresářů funguje podobně jako direktiva umístění, kromě toho, že odkazuje na cestu v systému souborů, jako v následujícím příkladu:

source: &lt;Directory "/srv/www/www.example.org/docs"&gt; # Note lack of trailing slash AAHatName example.org &lt;/Directory&gt;
cs: &lt;Directory "/srv/www/www.example.org/docs"&gt; # Všimněte si, že chybí koncové lomítko AAHatName example.org &lt;/Directory&gt;

source: Managing ChangeHat-Aware Applications
cs: Správa aplikací schopných ChangeHat

source: In the previous section you learned about <literal>mod_apparmor</literal> and the way it helps you to secure a specific Web application. This section walks you through a real-life example of creating a hat for a Web application, and using <phrase>AppArmor</phrase>'s change_hat feature to secure it. Note that this chapter focuses on <phrase>AppArmor</phrase>'s command line tools, as YaST's <phrase>AppArmor</phrase> module has limited functionality.
cs: V předchozí části jste se dozvěděli o <literal>mod_apparmor</literal> a o tom, jak vám pomáhá zabezpečit konkrétní webovou aplikaci. Tato část vás provede příkladem ze skutečného života. Je to vytvoření klobouku pro webovou aplikaci a její zabezpečení pomocí funkce change_hat z <phrase>AppArmor</phrase>. Tato kapitola se zaměřuje na nástroje příkazového řádku <phrase>AppArmor</phrase>, protože YaST modul <phrase>AppArmor</phrase> má omezenou funkčnost.

source: With <phrase>AppArmor</phrase>'s Command Line Tools
cs: S nástroji příkazového řádku <phrase>AppArmor</phrase>

source: For illustration purposes, let us choose the Web application called <emphasis>Adminer</emphasis> (<link xlink:href="http://www.adminer.org/en/"/>). It is a full-featured SQL database management tool written in PHP, yet consisting of a single PHP file. For Adminer to work, you need to set up an Apache Web server, PHP and its Apache module, and one of the database drivers available for PHP—MariaDB in this example. You can install the required packages with
cs: Pro ilustraci si zvolíme webovou aplikaci s názvem <emphasis>Adminer</emphasis> (<link xlink:href="http://www.adminer.org/en/"/>). Je to plnohodnotný nástroj pro správu databází SQL, napsaný jako jediný soubor PHP. Aby Adminer fungoval, musíte nastavit webový server Apache, PHP a jeho modul pro Apache, a jeden z databázových ovladačů dostupných pro PHP - v tomto příkladu MariaDB. Požadované balíčky můžete nainstalovat pomocí

source: zypper in apache2 apache2-mod_apparmor apache2-mod_php5 php5 php5-mysql
cs: programu zypper: apache2, apache2-mod_apparmor, apache2-mod_php5, php5 a php5-mysql

source: To set up the Web environment for running Adminer, follow these steps:
cs: Webové prostředí pro aplikaci Adminer nastavíte takto:

source: Setting Up a Web Server Environment
cs: Nastavte prostředí webového serveru

source: Make sure <literal>apparmor</literal> and <literal>php5</literal> modules are enabled for Apache. To enable the modules in any case, use:
cs: Zařiďte, aby moduly <literal>apparmor</literal> a <literal>php5</literal> byly v Apache vždy zapnuty. Použijte:

source: and then restart Apache with
cs: a pak Apache restartujte příkazem

source: Make sure MariaDB is running. If unsure, restart it with
cs: Zajistěte, aby běžel MariaDB (via mysql). Případně ho restartujte příkazem

source: Download Adminer from <link xlink:href="http://www.adminer.org"/>, copy it to <filename>/srv/www/htdocs/adminer/</filename>, and rename it to <filename>adminer.php</filename>, so that its full path is <filename>/srv/www/htdocs/adminer/adminer.php</filename>.
cs: Stáhněte si Adminer z <link xlink:href="http://www.adminer.org"/>, zkopírujte do <filename>/srv/www/htdocs/adminer/</filename> a přejmenujte na <filename>adminer.php</filename>, takže jeho úplná cesta je <filename>/srv/www/htdocs/adminer/adminer.php</filename>.

source: Test Adminer in your Web browser by entering <literal>http://localhost/adminer/adminer.php</literal> in its URI address field. If you installed Adminer to a remote server, replace <literal>localhost</literal> with the real host name of the server.
cs: Otestujte Adminer ve svém webovém prohlížeči zadáním <literal>http://localhost/adminer/adminer.php</literal> do pole URI. Instalujete-li Adminer na vzdálený server, změňte <literal>localhost</literal> na název toho serveru.

source: Adminer Login Page
cs: Přihlašovací (login) stránka Adminer

source: If you encounter problems viewing the Adminer login page, try to look for help in the Apache error log <filename>/var/log/apache2/error.log</filename>. Another reason you cannot access the Web page may be that your Apache is already under <phrase>AppArmor</phrase> control and its <phrase>AppArmor</phrase> profile is too tight to permit viewing Adminer. Check it with <command>aa-status</command>, and if needed, set Apache temporarily in complain mode with
cs: Narazíte-li na problémy se zobrazením přihlašovací stránky Adminer, zkuste vyhledat pomoc v protokolu chyb Apache <filename>/var/log/apache2/error.log</filename>. Dalším důvodem, proč nemůžete získat přístup na webovou stránku, může být to, že váš Apache je již ovládán <phrase>AppArmor</phrase> a jeho profil <phrase>AppArmor</phrase> je příliš omezen, než aby umožňoval zobrazit Adminer. Zkontrolujte to pomocí <command>aa-status</command>, a je-li to nutné, nastavte Apache dočasně do režimu stížnosti příkazem

source: After the Web environment for Adminer is ready, you need to configure Apache's <literal>mod_apparmor</literal>, so that <phrase>AppArmor</phrase> can detect accesses to Adminer and change to the specific <quote>hat</quote>.
cs: Když je webové prostředí pro správce připraveno, musíte zkonfigurovat <literal>mod_apparmor</literal> Apache, tak, aby <phrase>AppArmor</phrase> mohl detekovat přístupy k Admineru a zapojit konkrétní <quote>klobouk</quote>.

source: Configuring <literal>mod_apparmor</literal>
cs: Konfigurujte <literal>mod_apparmor</literal>

source: Apache has several configuration files under <filename>/etc/apache2/</filename> and <filename>/etc/apache2/conf.d/</filename>. Choose your preferred one and open it in a text editor. In this example, the <command>vim</command> editor is used to create a new configuration file <filename>/etc/apache2/conf.d/apparmor.conf</filename>.
cs: Apache má několik konfiguračních souborů v <filename>/etc/apache2/</filename> a <filename>/etc/apache2/conf.d/</filename>. Vyberte si Vámi preferovaný a otevřete ho v textovém editoru. V tomto příkladu je použit editor <command>vim</command> k vytvoření nového konfiguračního souboru <filename>/etc/apache2/conf.d/apparmor.conf</filename>.

source: Copy the following snippet into the edited file.
cs: Do upraveného souboru zkopírujte následující kód.

source: It tells Apache to let <phrase>AppArmor</phrase> know about a change_hat event when the Web user accesses the directory <filename>/adminer</filename> (and any file/directory inside) in Apache's document root. Remember, we placed the <filename>adminer.php</filename> application there.
cs: Říká Apache, aby dal <phrase>AppArmoru</phrase> vědět o události change_hat, když webový uživatel přistupuje k adresáři <filename>/adminer</filename> (a ke všem souborům/adresářům uvnitř) v kořenovém adresáři dokumentů Apache. Tam jsme totiž umístili aplikaci <filename>adminer.php</filename>.

source: Save the file, close the editor, and restart Apache with
cs: Uložte soubor, ukončete editor a restartujte Apache příkazem

source: Apache now knows about our Adminer and changing a <quote>hat</quote> for it. It is time to create the related hat for Adminer in the <phrase>AppArmor</phrase> configuration. If you do not have an <phrase>AppArmor</phrase> profile yet, create one before proceeding. Remember that if your Apache's main binary is <filename>/usr/sbin/httpd2-prefork</filename>, then the related profile is named <filename>/etc/apparmor.d/usr.sbin.httpd2-prefork</filename>.
cs: Apache nyní ví o našem Admineru a změní pro něj <quote>klobouk</quote>. Nyní je čas vytvořit příslušný klobouk pro Adminer v konfiguraci <phrase>AppArmor</phrase>. Pokud ještě nemáte profil <phrase>AppArmor</phrase>, vytvořte jej před pokračováním. Nezapomeňte, že pokud je hlavní binární soubor Apache <filename>/usr/sbin/httpd2-prefork</filename>, bude příslušný profil nazván <filename>/etc/apparmor.d/usr.sbin.httpd2-prefork</filename >.

source: Creating a Hat for Adminer
cs: Vytvořte klobouk pro Adminer

source: Open (or create one if it does not exist) the file <filename>/etc/apparmor.d/usr.sbin.httpd2-prefork</filename> in a text editor. Its contents should be similar to the following:
cs: V textovém editoru otevřete (nebo vytvořte, pokud neexistuje) soubor <filename>/etc/apparmor.d/usr.sbin.httpd2-prefork</filename>. Jeho obsah by měl být podobný tomuto:

source: Before the last closing curly bracket (<literal>}</literal>), insert the following section:
cs: Před poslední uzavírací složenou závorku (<literal>}</literal>) vložte sekci:

source: Note the <literal>(complain)</literal> addition after the hat name—it tells <phrase>AppArmor</phrase> to leave the <systemitem>adminer</systemitem> hat in complain mode. That is because we need to learn the hat profile by accessing Adminer later on.
cs: Všimněte si přidání <literal>(complain)</literal> (stěžování) za názvem klobouku. Řekne to <phrase>AppArmoru</phrase>, aby nechal klobouk <systemitem>adminer</systemitem> v režimu stížnosti. Je to proto, že potřebujeme naučit profil klobouku pozdějším používáním Admineru.

source: Save the file, and then restart <phrase>AppArmor</phrase>, then Apache.
cs: Uložte soubor a restartujte napřed <phrase>AppArmor</phrase> a pak Apache.

source: Check if the <systemitem>adminer</systemitem> hat really is in complain mode.
cs: Zkontrolujte, zda je klobouk pro <systemitem>adminer</systemitem> skutečně v režimu stížností.
