Repository: openSUSE/doc-sle-translations
Catalog: */po/apparmor_intro.*.po
Languages: cs, pt_br

# _
source: translator-credits
cs: překladatelské kredity alkas alkas@volny.cz, 2016, 2020
pt_br: tradutor-créditos

source: Introducing <phrase>AppArmor</phrase>
cs: Úvod k <phrase>AppArmor</phrase>
pt_br: Apresentando o <phrase>AppArmor</phrase>

source: Many security vulnerabilities result from bugs in <emphasis>trusted</emphasis> programs. A trusted program runs with privileges that attackers want to possess. The program fails to keep that trust if there is a bug in the program that allows the attacker to acquire said privilege.
cs: Mnoho chyb zabezpečení vyplývá z chyb v <emphasis>důvěryhodných</emphasis> programech. Důvěryhodný program běží s oprávněními, která útočníci chtějí mít. Program si tuto důvěru neudrží, pokud v něm existuje chyba, která útočníkovi umožňuje získat zmíněná oprávnění.
pt_br: Muitas vulnerabilidades de segurança resultam de erros nos programas <emphasis>confiáveis</emphasis>. Um programa confiável é executado com privilégios que os invasores desejam possuir. O programa falha em manter essa confiança se houver um erro no programa que permita ao invasor adquirir o referido privilégio.

source: <phrase>AppArmor®</phrase> is an application security solution designed specifically to apply privilege confinement to suspect programs. <phrase>AppArmor</phrase> allows the administrator to specify the domain of activities the program can perform by developing a security <emphasis>profile</emphasis>. A security profile is a listing of files that the program may access and the operations the program may perform. <phrase>AppArmor</phrase> secures applications by enforcing good application behavior without relying on attack signatures, so it can prevent attacks even if previously unknown vulnerabilities are being exploited.
cs: <phrase>AppArmor®</phrase> je řešení zabezpečení aplikace navržené speciálně pro omezení práv podezřelých programů. <phrase>AppArmor</phrase> umožňuje správci specifikovat doménu činností, které může program provádět, vytvořením bezpečnostního <emphasis>profilu</emphasis>. Bezpečnostní profil je seznam souborů, ke kterým program může přistupovat, a operací, které může program provádět. <phrase>AppArmor</phrase> zabezpečuje aplikace vynucením jejich dobrého chování a nespoléhá se na známé charakteristiky útoku, takže může zabránit útokům, i když jsou zneužita dosud neznámá zranitelná místa.
pt_br: <phrase>AppArmor®</phrase> é uma solução de segurança de aplicativo projetada especificamente para aplicar confinamento de privilégios a programas suspeitos. <phrase>AppArmor</phrase> permite que o administrador especifique o domínio de atividades que o programa pode executar, desenvolvendo um <emphasis>perfil</emphasis> de segurança. Um perfil de segurança é uma lista de arquivos que o programa pode acessar e as operações que o programa pode executar. O <phrase>AppArmor</phrase> protege os aplicativos, reforçando o bom comportamento dos aplicativos sem depender de assinaturas de ataques, para impedir ataques, mesmo que vulnerabilidades anteriormente desconhecidas estejam sendo exploradas.

source: <phrase>AppArmor</phrase> Components
cs: Komponenty <phrase>AppArmor</phrase>
pt_br: Componentes do <phrase>AppArmor</phrase>

source: <phrase>AppArmor</phrase> consists of:
cs: <phrase>AppArmor</phrase> sestává z:
pt_br: O <phrase>AppArmor</phrase> consiste em:

source: A library of <phrase>AppArmor</phrase> profiles for common Linux* applications, describing what files the program needs to access.
cs: Knihovny profilů <phrase>AppArmor</phrase> pro běžné aplikace Linuxu*; profily popisují, jaké soubory program potřebuje zpracovávat.
pt_br: Uma biblioteca de perfis <phrase>AppArmor</phrase> para aplicativos comuns do Linux*, descrevendo quais arquivos o programa precisa acessar.

source: A library of <phrase>AppArmor</phrase> profile foundation classes (profile building blocks) needed for common application activities, such as DNS lookup and user authentication.
cs: Knihovna základních tříd profilů <phrase>AppArmor</phrase> (stavebních bloků profilů) potřebných pro běžné aktivity aplikací, jako hledání v DNS a identifikace uživatelů.
pt_br: Uma biblioteca de classes de fundação do perfil <phrase>AppArmor</phrase> (blocos de construção do perfil) necessárias para atividades comuns do aplicativo, como pesquisa de DNS e autenticação do usuário.

source: A tool suite for developing and enhancing <phrase>AppArmor</phrase> profiles, so that you can change the existing profiles to suit your needs and create new profiles for your own local and custom applications.
cs: Sada nástrojů pro vývoj a vylepšování profilů <phrase>AppArmor</phrase>, takže můžete změnit stávající profily podle svých potřeb a vytvořit nové profily pro své místní a vlastní aplikace.
pt_br: Um conjunto de ferramentas para desenvolver e aprimorar perfis <phrase>AppArmor</phrase>, para que você possa alterar os perfis existentes para atender às suas necessidades e criar novos perfis para seus próprios aplicativos locais e personalizados.

source: Several specially modified applications that are <phrase>AppArmor</phrase> enabled to provide enhanced security in the form of unique subprocess confinement (including Apache).
cs: Několik aplikací speciálně upravených pro <phrase>AppArmor</phrase> umožňujících operovat se zvýšenou bezpečností cestou jedinečného omezení podprocesů (včetně Apache).
pt_br: Vários aplicativos especialmente modificados que são <phrase>AppArmor</phrase> ativados para fornecer segurança aprimorada na forma de confinamento exclusivo de subprocessos (incluindo Apache).

source: The <phrase>AppArmor</phrase>-related kernel code and associated control scripts to enforce <phrase>AppArmor</phrase> policies on your <phrase role="productname"><phrase os="osuse">openSUSE® Leap</phrase><phrase os="sles">SUSE® Linux Enterprise Server</phrase><phrase os="sled">SUSE® Linux Enterprise Desktop</phrase></phrase> system.
cs: Kód jádra pro <phrase>AppArmor</phrase> a připojené řídicí skripty pro aktivaci zásad <phrase>AppArmor</phrase> na vašem systému <phrase role="productname"><phrase os="osuse">openSUSE® Leap</phrase><phrase os="sles">SUSE® Linux Enterprise Server</phrase><phrase os="sled">SUSE® Linux Enterprise Desktop</phrase></phrase>.
pt_br: Os códigos do kernel relacionados ao <phrase>AppArmor</phrase> e scripts de controle associados para impor políticas <phrase>AppArmor</phrase> no seu sistema <phrase role="productname"><phrase os="osuse">openSUSE® Leap</phrase><phrase os="sles">SUSE® Linux Enterprise Server</phrase><phrase os="sled">SUSE® Linux Enterprise Desktop</phrase></phrase>

source: Background Information on <phrase>AppArmor</phrase> Profiling
cs: Základní informace o profilování <phrase>AppArmor</phrase>
pt_br: Informações básicas sobre a criação de perfil <phrase>AppArmor</phrase>

source: For more information about the science and security of <phrase>AppArmor</phrase>, refer to the following papers:
cs: Další informace o vědeckém a bezpečnostním základu aplikace <phrase>AppArmor</phrase> najdete v dokumentech:
pt_br: Para obter mais informações sobre a ciência e a segurança do <phrase>AppArmor</phrase>, consulte os seguintes documentos:

source: <citetitle>SubDomain: Parsimonious Server Security</citetitle> by Crispin Cowan, Steve Beattie, Greg Kroah-Hartman, Calton Pu, Perry Wagle, and Virgil Gligor
cs: <citetitle>SubDomain: Parsimonious Server Security</citetitle> : Crispin Cowan, Steve Beattie, Greg Kroah-Hartman, Calton Pu, Perry Wagle a Virgil Gligor
pt_br: <citetitle>SubDomain: Parsimonious Server Security</citetitle> por Crispin Cowan, Steve Beattie, Greg Kroah-Hartman, Calton Pu, Perry Wagle e Virgil Gligor

source: Describes the initial design and implementation of <phrase>AppArmor</phrase>. Published in the proceedings of the USENIX LISA Conference, December 2000, New Orleans, LA. This paper is now out of date, describing syntax and features that are different from the current <phrase>AppArmor</phrase> product. This paper should be used only for background, and not for technical documentation.
cs: Popisuje počáteční návrh a implementaci aplikace <phrase>AppArmor</phrase>. Publikováno ve sborníku konference USENIX LISA, prosinec 2000, New Orleans, LA. Tento dokument je nyní zastaralý a popisuje syntaxi a funkce, které se liší od aktuálního produktu <phrase>AppArmor</phrase>. Tento dokument by měl být používán pouze pro studium, nikoli jako technická dokumentace.
pt_br: Descreve o design e a implementação inicial do <phrase>AppArmor</phrase>. Publicado nos anais da USENIX LISA Conference, dezembro de 2000, Nova Orleans, LA. Este documento está desatualizado, descrevendo a sintaxe e os recursos diferentes do produto atual <phrase>AppArmor</phrase>. Este documento deve ser usado apenas para background e não para documentação técnica.

source: <citetitle>Defcon Capture the Flag: Defending Vulnerable Code from Intense Attack</citetitle> by Crispin Cowan, Seth Arnold, Steve Beattie, Chris Wright, and John Viega
cs: <citetitle>Defcon Capture the Flag: Defending Vulnerable Code from Intense Attack</citetitle> : Crispin Cowan, Seth Arnold, Steve Beattie, Chris Wright a John Viega
pt_br: <citetitle>Defcon captura a bandeira: defendendo códigos vulneráveis de ataques intensos</citetitle> por Crispin Cowan, Seth Arnold, Steve Beattie, Chris Wright e John Viega

source: A good guide to strategic and tactical use of <phrase>AppArmor</phrase> to solve severe security problems in a very short period of time. Published in the Proceedings of the DARPA Information Survivability Conference and Expo (DISCEX III), April 2003, Washington, DC.
cs: Dobrý průvodce strategickým a taktickým využitím aplikace <phrase>AppArmor</phrase> k vyřešení závažných bezpečnostních problémů ve velmi krátkém časovém období. Publikováno ve sborníku konference DARPA o přežití informací a výstavě (DISCEX III), duben 2003, Washington, DC.
pt_br: Um bom guia para o uso estratégico e tático do <phrase>AppArmor</phrase> para resolver problemas graves de segurança em um período muito curto. Publicado nos Anais da DARPA Information Survivability Conference and Expo (DISCEX III), abril de 2003, Washington, DC.

source: <citetitle>AppArmor for Geeks</citetitle> by Seth Arnold
cs: <citetitle>AppArmor for Geeks</citetitle> : Seth Arnold
pt_br: <citetitle> AppArmor for Geeks </citetitle> por Seth Arnold

source: This document tries to convey a better understanding of the technical details of <phrase>AppArmor</phrase>. It is available at <link xlink:href="http://en.opensuse.org/SDB:AppArmor_geeks"/>.
cs: Tento dokument se snaží dosáhnout lepšího porozumění technickým podrobnostem aplikace <phrase>AppArmor</phrase>. Je k dispozici na <link xlink: href = "http://en.opensuse.org/SDB:AppArmor_geeks" />.
pt_br: Este documento tenta transmitir uma melhor compreensão dos detalhes técnicos do <phrase>AppArmor</phrase>. Está disponível em <link xlink:href="http://en.opensuse.org/SDB:AppArmor_geeks"/>.
