Repository: openSUSE/doc-sle-translations
Catalog: */po/apparmor_support.*.po
Languages: cs

# _
source: translator-credits
cs: překladatelské kredity alkas alkas@volny.cz, 2016, 2020

source: Support
cs: Podpora

source: This chapter outlines maintenance-related tasks. Learn how to update <phrase>AppArmor®</phrase> and get a list of available man pages providing basic help for using the command line tools provided by <phrase>AppArmor</phrase>. Use the troubleshooting section to learn about some common problems encountered with <phrase>AppArmor</phrase> and their solutions. Report defects or enhancement requests for <phrase>AppArmor</phrase> following the instructions in this chapter.
cs: Tato kapitola popisuje úkoly související s údržbou. Naučte se, jak aktualizovat <phrase>AppArmor®</phrase> a získejte seznam dostupných manuálových stránek poskytujících základní nápovědu k používání nástrojů <phrase>AppArmor</phrase> příkazového řádku. V části Odstraňování problémů se dozvíte některé běžné problémy, se kterými se setkáte v <phrase>AppArmor</phrase> a jejich řešení. Hlaste závady nebo požadavky na vylepšení aplikace <phrase>AppArmor</phrase> podle pokynů v této kapitole.

source: Updating <phrase>AppArmor</phrase> Online
cs: Aktualizace <phrase>AppArmor</phrase> on-line

source: Updates for <phrase>AppArmor</phrase> packages are provided in the same way as any other update for <phrase role="productname"><phrase os="osuse">openSUSE Leap</phrase><phrase os="sles">SUSE Linux Enterprise Server</phrase><phrase os="sled">SUSE Linux Enterprise Desktop</phrase></phrase>. Retrieve and apply them exactly like for any other package that ships as part of <phrase role="productname"><phrase os="osuse">openSUSE Leap</phrase><phrase os="sles">SUSE Linux Enterprise Server</phrase><phrase os="sled">SUSE Linux Enterprise Desktop</phrase></phrase>.
cs: Aktualizace balíčků <phrase>AppArmor</phrase> jsou řešeny stejně jako jiné aktualizace <phrase role="productname"><phrase os="osuse">openSUSE Leap</phrase><phrase os="sles">SUSE Linux Enterprise Server</phrase><phrase os="sled">SUSE Linux Enterprise Desktop</phrase></phrase>. Získejte je a aplikujte stejně, jako u jiných balíčků dodávaných jako součást <phrase role="productname"><phrase os="osuse">openSUSE Leap</phrase><phrase os="sles">SUSE Linux Enterprise Server</phrase><phrase os="sled">SUSE Linux Enterprise Desktop</phrase></phrase>.

source: Using the Man Pages
cs: Použití stránek Man(uálu)

source: There are man pages available for your use. In a terminal, enter <command>man apparmor</command> to open the <phrase>AppArmor</phrase> man page. Man pages are distributed in sections numbered 1 through 8. Each section is specific to a category of documentation:
cs: K dispozici jsou manuálové stránky. V terminálu zadejte <command>man apparmor</command> a tím otevřete manuálovou stránku <phrase>AppArmor</phrase>. Man(uálové) stránky jsou distribuovány v sekcích číslovaných 1 až 8. Každá sekce je specifická pro určitou kategorii dokumentace:

source: Man Pages: Sections and Categories
cs: Stránky Man: Sekce a kategorie

source: Section
cs: Sekce

source: Category
cs: Kategorie

source: User commands
cs: Uživatelské příkazy

source: System calls
cs: Systémová volání

source: Library functions
cs: Knihovní funkce

source: Device driver information
cs: Údaje ovladače zařízení

source: Configuration file formats
cs: Formáty konfiguračních souborů

source: Games
cs: Hry

source: High level concepts
cs: Koncepce vysoké úrovně

source: Administrator commands
cs: Příkazy správce

source: The section numbers are used to distinguish man pages from each other. For example, <systemitem>exit(2)</systemitem> describes the exit system call, while <systemitem>exit(3)</systemitem> describes the exit C library function.
cs: Čísla oddílů se používají k odlišení manuálových stránek. Například <systemitem>exit (2)</systemitem> popisuje ukončení systémového volání, zatímco <systemitem>exit (3)</systemitem> popisuje funkci východu z knihovny C.

source: The <phrase>AppArmor</phrase> man pages are:
cs: Stránky <phrase>AppArmor</phrase> man jsou:

source: For More Information
cs: Další informace

source: Find more information about the <phrase>AppArmor</phrase> product at: <link xlink:href="http://wiki.apparmor.net"/>. Find the product documentation for <phrase>AppArmor</phrase> in the installed system at <filename>/usr/share/doc/manual</filename>.
cs: Další informace o produktu <phrase>AppArmor</phrase> naleznete na: <link xlink: href="http://wiki.apparmor.net"/>. Vyhledejte dokumentaci k produktu <phrase>AppArmor</phrase> v nainstalovaném systému na <filename>/usr/share/doc/manual</filename>.

source: There is a mailing list for <phrase>AppArmor</phrase> that users can post to or join to communicate with developers. See <link xlink:href="https://lists.ubuntu.com/mailman/listinfo/apparmor"/> for details.
cs: Existuje seznam adresátů e-mailů pro aplikaci <phrase>AppArmor</phrase>, do které mohou uživatelé přispívat nebo se k nim připojit, aby mohli komunikovat s vývojáři. Podrobnosti viz <link xlink:href="https://lists.ubuntu.com/mailman/listinfo/apparmor"/>.

source: Troubleshooting
cs: Odstraňování problémů

source: This section lists the most common problems and error messages that may occur using <phrase>AppArmor</phrase>.
cs: V této části jsou uvedeny nejčastější problémy a chybové zprávy, které mohou nastat při použití aplikace <phrase>AppArmor</phrase>.

source: How to React to odd Application Behavior?
cs: Jak reagovat na zvláštní, nečekané chování aplikací?

source: If you notice odd application behavior or any other type of application problem, you should first check the reject messages in the log files to see if <phrase>AppArmor</phrase> is too closely constricting your application. If you detect reject messages that indicate that your application or service is too closely restricted by <phrase>AppArmor</phrase>, update your profile to properly handle your use case of the application. Do this with <command>aa-logprof</command> (<xref linkend="sec.apparmor.commandline.profiling.summary.logprof"/>).
cs: Pokud si všimnete podivného chování aplikace nebo jakéhokoli jiného problému s aplikací, měli byste nejprve zkontrolovat odmítnuté zprávy v souborech protokolu a zjistit, zda aplikace <phrase>AppArmor</phrase> neomezuje příliš úzce vaši aplikaci. Zjistíte-li odmítavé zprávy, které naznačují, že aplikace nebo služba je příliš úzce omezena aplikací <phrase>AppArmor</phrase>, aktualizujte svůj profil, aby správně zvládl váš způsob použití aplikace. Použijte program <command>aa-logprof</command> (<xref linkend="sec.apparmor.commandline.profiling.summary.logprof"/>).

source: If you decide to run your application or service without <phrase>AppArmor</phrase> protection, remove the application's profile from <filename>/etc/apparmor.d</filename> or move it to another location.
cs: Rozhodnete-li se spustit aplikaci nebo službu bez ochrany <phrase>AppArmor</phrase>, odeberte profil aplikace z <filename>/etc/apparmor.d</filename> nebo přesuňte aplikaci/službu na jiné místo.

source: My Profiles Do not Seem to Work Anymore …
cs: Zdá se, že moje profily nefungují …

source: If you have been using previous versions of <phrase>AppArmor</phrase> and have updated your system (but kept your old set of profiles) you might notice some applications which seemed to work perfectly before you updated behaving strangely, or not working.
cs: Pokud jste používali předchozí verze aplikace <phrase> AppArmor </phrase> a aktualizovali jste svůj systém (ale ponechali si starou sadu profilů), možná si všimnete, že některé aplikace fungovaly perfektně, ale teď se chovají podivně nebo nepracují.

source: This version of <phrase>AppArmor</phrase> introduces a set of new features to the profile syntax and the <phrase>AppArmor</phrase> tools that might cause trouble with older versions of the <phrase>AppArmor</phrase> profiles. Those features are:
cs: Tato verze aplikace <phrase>AppArmor</phrase> zavádí do syntaxe profilu a nástrojů <phrase>AppArmor</phrase> sadu nových funkcí, které by mohly způsobit potíže se staršími verzemi profilů <phrase>AppArmor</phrase>. Jsou to tyto funkce:

source: File Locking
cs: Uzamykání souborů

source: Network Access Control
cs: Ovládání přístupu k síti

source: The <literal>SYS_PTRACE</literal> Capability
cs: Schopnost <literal>SYS_PTRACE</literal>

source: Directory Path Access
cs: Přístup cesty k adresáři

source: The current version of <phrase>AppArmor</phrase> mediates file locking and introduces a new permission mode (<literal>k</literal>) for this. Applications requesting file locking permission might misbehave or fail altogether if confined by older profiles which do not explicitly contain permissions to lock files. If you suspect this being the case, check the log file under <filename>/var/log/audit/audit.log</filename> for entries like the following:
cs: Aktuální verze aplikace <phrase>AppArmor</phrase> zprostředkovává uzamykání souborů a zavádí k tomu nový režim oprávnění (<literal>k</literal>). Aplikace vyžadující oprávnění k uzamčení souborů mohou chybovat nebo úplně selhat, pokud jsou omezeny staršími profily, které neobsahují výslovné oprávnění k uzamčení souborů. Pokud máte podezření, že jde o tento případ, zkontrolujte v souboru protokolu v <filename>/var/log/audit/audit.log</filename> tyto a podobné položky:

source: Update the profile using the <command>aa-logprof</command> command as outlined below.
cs: Aktualizujte profil programem <command>aa-logprof</command>, jak je uvedeno dále.

source: The new network access control syntax based on the network family and type specification, described in <xref linkend="sec.apparmor.profiles.nac"/>, might cause application misbehavior or even stop applications from working. If you notice a network-related application behaving strangely, check the log file under <filename>/var/log/audit/audit.log</filename> for entries like the following:
cs: Nová syntaxe řízení přístupu k síti založená na specifikaci rodiny a typu sítě, popsaná v <xref linkend="sec.apparmor.profiles.nac"/>, může způsobit nesprávné chování aplikací nebo i zabránit fungování aplikací. Všimnete-li si, že se aplikace pracující se sítí chová podivně, zkontrolujte v souboru protokolu v <filename>/var/log/audit/audit.log</filename> položky jako:

source: This log entry means that our example application, <command>/bin/ping</command> in this case, failed to get <phrase>AppArmor</phrase>'s permission to open a network connection. This permission needs to be explicitly stated to make sure that an application has network access. To update the profile to the new syntax, use the <command>aa-logprof</command> command as outlined below.
cs: Tato položka protokolu znamená, že naší vzorové aplikaci <command>/bin/ping</command> se v tomto případě nepodařilo získat oprávnění <phrase>AppArmor</phrase> k otevření síťového připojení. Toto oprávnění musí být výslovně uvedeno, aby se zajistilo, že aplikace má přístup k síti. Chcete-li upravit profil podle nové syntaxe, použijte příkaz <command>aa-logprof</command>, jak je uvedeno dále.

source: The current kernel requires the <literal>SYS_PTRACE</literal> capability, if a process tries to access files in <filename>/proc/<replaceable>PID</replaceable>/fd/*</filename>. New profiles need an entry for the file and the capability, where old profiles only needed the file entry. For example:
cs: Aktuální jádro vyžaduje schopnost <literal>SYS_PTRACE</literal>, pokouší-li se proces získat přístup k souborům v <filename>/proc/<replaceable>PID</replaceable>/fd/*</filename>. Nové profily potřebují záznam o souboru a schopnost, kdežto staré profily potřebovaly pouze záznam o souboru. Například:

source: in the old syntax would translate to the following rules in the new syntax:
cs: ve staré syntaxi by se v nové syntaxi převedly na následující pravidla:

source: To update the profile to the new syntax, use the YaST Update Profile Wizard or the <command>aa-logprof</command> command as outlined below.
cs: Chcete-li aktualizovat profil na novou syntaxi, použijte Průvodce aktualizací profilu YaST nebo příkaz <command>aa-logprof</command>, jak je uvedeno dále.

source: With this version of <phrase>AppArmor</phrase>, a few changes have been made to the profile rule syntax to better distinguish directory from file access. Therefore, some rules matching both file and directory paths in the previous version might now match a file path only. This could lead to <phrase>AppArmor</phrase> not being able to access a crucial directory, and thus trigger misbehavior of your application and various log messages. The following examples highlight the most important changes to the path syntax.
cs: U této verze aplikace <phrase> AppArmor </phrase> bylo provedeno několik změn v syntaxi pravidla profilu, aby bylo možné lépe odlišit přístup k adresářům od přístupu k souborům. Některá pravidla, která se shodují s cestami souborů i adresářů v předchozí verzi, se nyní mohou shodovat pouze s cestou k souboru. To by mohlo vést k tomu, že aplikace <phrase>AppArmor</phrase> nebude moci přistupovat ke klíčovému adresáři, a tím vyvolat nesprávné chování vaší aplikace a různé zprávy protokolu. Následující příklady zdůrazňují nejdůležitější změny syntaxe cesty.

source: Using the old syntax, the following rule would allow access to files and directories in <filename>/proc/net</filename>. It would allow directory access only to read the entries in the directory, but not give access to files or directories under the directory, for example <filename>/proc/net/dir/foo</filename> would be matched by the asterisk (*), but as <filename>foo</filename> is a file or directory under <filename>dir</filename>, it cannot be accessed.
cs: Při použití staré syntaxe by následující pravidlo umožnilo přístup k souborům a adresářům v <filename>/proc/net</filename>. Umožnilo by to adresářový přístup pouze ke čtení položek adresáře, ale už ne přístup k souborům nebo podadresářům, například <filename>/proc/net/dir/foo</filename> by odpovídal masce hvězdičky (*), ale protože <filename>foo</filename> je soubor nebo adresář pod <filename>dir</filename>, nelze k němu přistupovat.

source: To get the same behavior using the new syntax, you need two rules instead of one. The first allows access to the file under <filename>/proc/net</filename> and the second allows access to directories under <filename>/proc/net</filename>. Directory access can only be used for listing the contents, not actually accessing files or directories underneath the directory.
cs: K dosažení stejného chování pomocí nové syntaxe potřebujete dvě pravidla místo jednoho. První umožňuje přístup k souboru v <filename>/proc/net</filename> a druhé umožňuje přístup k adresářům pod <filename>/proc/net</filename>. Přístup do adresáře lze použít pouze pro výpis obsahu adresáře, nikoli ke skutečnému přístupu k souborům nebo jeho podadresářům.

source: The following rule works similarly both under the old and the new syntax, and allows access to both files and directories under <filename>/proc/net</filename> (but does not allow a directory listing of <filename>/proc/net/</filename> itself):
cs: Následující pravidlo funguje podobně pod starou i novou syntaxí a umožňuje přístup k souborům a adresářům v <filename>/proc/net</filename> (ale neumožňuje výpis obsahu adresáře <filename>/proc/net/</filename> samotného):

source: To distinguish file access from directory access using the above expression in the new syntax, use the following two rules. The first one only allows to recursively access directories under <filename>/proc/net</filename> while the second one explicitly allows for recursive file access only.
cs: Chcete-li odlišit přístup k souborům od přístupu k adresáři pomocí výše uvedeného výrazu v nové syntaxi, použijte následující dvě pravidla. První umožňuje pouze rekurzivní přístup k adresářům pod <filename>/proc/net</filename>, zatímco druhé výslovně umožňuje pouze rekurzivní přístup k souborům.

source: The following rule works similarly both under the old and the new syntax and allows access to both files and directories beginning with <literal>foo</literal> under <filename>/proc/net</filename>:
cs: Následující pravidlo funguje podobně ve staré i nové syntaxi a umožňuje přístup k souborům a adresářům začínajícím <literal>foo</literal> v <filename>/proc/net</filename>:

source: To distinguish file access from directory access in the new syntax and use the <literal>**</literal> globbing pattern, use the following two rules. The first one would have matched both files and directories in the old syntax, but only matches files in the new syntax because of the missing trailing slash. The second rule matched neither file nor directory in the old syntax, but matches directories only in the new syntax:
cs: Chcete-li odlišit přístup k souborům od přístupu k adresáři v nové syntaxi a použít vzor globbingu <literal>**</literal>, použijte následující dvě pravidla. První z nich by ve staré syntaxi vyhovovalo souborům i adresářům, ale v nové syntaxi vyhovuje pouze souborům, protože chybí koncové lomítko. Druhé pravidlo neodpovídalo ve staré syntaxi souboru ani adresáři, ale v nové syntaxi odpovídá pouze adresářům:

source: The following rules illustrate how the use of the <literal>?</literal> globbing pattern has changed. In the old syntax, the first rule would have matched both files and directories (four characters, last character could be any but a slash). In the new syntax, it matches only files (trailing slash is missing). The second rule would match nothing in the old profile syntax, but matches directories only in the new syntax. The last rule matches explicitly matches a file called <filename>bar</filename> under <filename>/proc/net/foo?</filename>. Using the old syntax, this rule would have applied to both files and directories:
cs: Následující pravidla ukazují, jak se změnilo použití globálního vzoru <literal>?</literal>. Ve staré syntaxi by první pravidlo odpovídalo souborům i adresářům (čtyři znaky, poslední znak může být lomítko). V nové syntaxi odpovídá pouze souborům (chybí koncové lomítko). Druhé pravidlo by neodpovídalo ve staré syntaxi profilu ničemu, ale v nové syntaxi odpovídá pouze adresářům. Poslední pravidlo explicitně odpovídá souboru nazvanému <filename>bar</filename> v <filename>/proc/net/foo?</filename>. Při použití staré syntaxe by toto pravidlo platilo pro soubory i adresáře:

source: To find and resolve issues related to syntax changes, take some time after the update to check the profiles you want to keep and proceed as follows for each application you kept the profile for:
cs: Chcete-li najít a vyřešit problémy související se změnami syntaxe, udělejte si po aktualizaci čas a zkontrolujte aplikační profily, které chcete zachovat, a pro každou takovou aplikaci postupujte takto:

source: Put the application's profile into complain mode:
cs: Přepněte profil aplikace do stěžovacího režimu:

source: <prompt>tux &gt; </prompt><command>sudo</command> <command>aa-complain</command> <option><replaceable>/path/to/application</replaceable></option>
cs: <prompt>tux &gt; </prompt><command>sudo</command> <command>aa-complain</command> <option><replaceable>/cesta/k/aplikaci</replaceable></option>

source: Log entries are made for any actions violating the current profile, but the profile is not enforced and the application's behavior not restricted.
cs: Pro všechny akce porušující aktuální profil se vytvářejí záznamy protokolu, ale profil není vynucován a chování aplikace není omezeno.

source: Run the application covering all the tasks you need this application to be able to perform.
cs: Spusťte aplikaci tak, aby pokryla všechny úkoly, které je schopna provádět.

source: Update the profile according to the log entries made while running the application:
cs: Aktualizujte profil podle položek protokolu zapsaných při běhu aplikace:

source: <prompt>tux &gt; </prompt><command>sudo</command> <command>aa-logprof</command> <option><replaceable>/path/to/application</replaceable></option>
cs: <prompt>tux &gt; </prompt><command>sudo</command> <command>aa-logprof</command> <option><replaceable>/cesta/k/aplikaci</replaceable></option>

source: Put the resulting profile back into enforce mode:
cs: Přepněte výsledný profil zpět do vynucovacího režimu:

source: <prompt>tux &gt; </prompt><command>sudo</command> <command>aa-enforce</command> <option><replaceable>/path/to/application</replaceable></option>
cs: <prompt>tux &gt; </prompt><command>sudo</command> <command>aa-enforce</command> <option><replaceable>/cesta/k/aplikaci</replaceable></option>

source: Resolving Issues with Apache
cs: Řešení problémů s Apache

source: After installing additional Apache modules (like <literal>apache2-mod_apparmor</literal>) or making configuration changes to Apache, profile Apache again to find out if additional rules need to be added to the profile. If you do not profile Apache again, it could be unable to start properly or be unable to serve Web pages.
cs: Po instalaci dalších modulů Apache (například <literal>apache2-mod_apparmor</literal>) nebo po změnách konfigurace Apache musíte pro profil Apache znovu zjistit, zda je třeba přidat další pravidla. Pokud nebudete Apache znovu profilovat, může se stát, že se nebude moci správně spustit nebo nebude moci zobrazovat webové stránky.

source: How to Exclude Certain Profiles from the List of Profiles Used?
cs: Jak vyloučit některé profily ze seznamu použitých profilů?

source: Run <command>aa-disable</command> <option><replaceable>PROGRAMNAME</replaceable></option> to disable the profile for <replaceable>PROGRAMNAME</replaceable>. This command creates a symbolic link to the profile in <filename>/etc/apparmor.d/disable/</filename>. To reactivate the profile, delete the link, and run <command>systemctl reload apparmor</command>.
cs: Spusťte <command>aa-disable</command> <option><replaceable>PROGRAM</replaceable></option> a tím vyřaďte profil pro <replaceable>PROGRAM</replaceable>. Tento program vytvoří symbolický odkaz na profil v <filename>/etc/apparmor.d/disable/</filename>. Profil reaktivujete smazáním toho odkazu a spuštěním <command>systemctl reload apparmor</command>.

source: Can I Manage Profiles for Applications not Installed on my System?
cs: Mohu spravovat profily pro aplikace, které nejsou nainstalované v mém systému?

source: Managing profiles with <phrase>AppArmor</phrase> requires you to have access to the log of the system on which the application is running. So you do not need to run the application on your profile build host as long as you have access to the machine that runs the application. You can run the application on one system, transfer the logs (<filename>/var/log/audit.log</filename> or, if <filename>audit</filename> is not installed, <command>journalctl | grep -i apparmor &gt; path_to_logfile</command>) to your profile build host and run <command>aa-logprof -f</command> <replaceable>PATH_TO_LOGFILE</replaceable>.
cs: Správa profilů pomocí aplikace <phrase>AppArmor</phrase> vyžaduje, abyste měli přístup k protokolu systému, ve kterém je aplikace spuštěna. Nemusíte tedy spouštět aplikaci na počítači. kde byl profil vytvořen, pokud máte přístup k počítači, na kterém je spuštěna aplikace. Můžete spustit aplikaci na jednom systému a přenést protokoly (<filename>/var/log/audit.log</filename> nebo, není-li <filename>audit</filename> instalován, zadejte <command>journalctl | grep -i apparmor &gt; cesta_k_žurnálu</command>) na počítači, kde byl profil vytvořen, a spusťte <command>aa-logprof -f</command> <replaceable>CESTA_K_ŽURNÁLU</replaceable>.

source: How to Spot and fix <phrase>AppArmor</phrase> Syntax Errors?
cs: Jak najít a opravit chyby syntaxe <phrase>AppArmor</phrase>?
