Repository: openSUSE/doc-sle-translations
Catalog: */po/apps_evolution.*.po
Languages: cs

# _
source: translator-credits
cs: překladatelské kredity alkas alkas@volny.cz, 2016, 2020

source: Evolution: E-Mailing and Calendaring
cs: Evolution: E-Mail a kalendář

source: yes
cs: ano

source: Evolution makes storing, organizing, and retrieving your personal information easy, so you can work and communicate more effectively with others. It is a professional groupware program and an important part of the Internet-connected desktop.
cs: Evolution usnadňuje ukládání, organizování a získávání vašich osobních údajů, takže můžete pracovat a efektivněji komunikovat s ostatními. Je to profesionální groupwarový program a důležitá součást pracovní plochy připojené k Internetu.

source: Evolution can help you work in a group by handling e-mail, contact information, and one or more calendars. It can do that on one or several computers, connected directly or over a network, for one person or for large groups.
cs: Evolution vám pomůže pracovat ve skupině zpracováním e-mailů, kontaktních informací a jednoho nebo více kalendářů. Může operovat na jednom nebo několika počítačích připojených přímo nebo přes síť, pro jednu osobu nebo pro velké skupiny.

source: Evolution helps you accomplish common daily tasks quickly. For example, you can easily reuse appointment or contact information sent to you by e-mail, or send e-mails to a contact or appointment. If you receive lots of e-mail, you can use advanced features like search folders, which let you save searches as though they were ordinary e-mail folders.
cs: Evolution vám pomůže rychle plnit běžné každodenní úkoly. Můžete například snadno znovu použít údaje schůzky nebo kontaktní informace zaslané e-mailem nebo poslat e-maily kontaktu nebo účastníkům schůzky. Pokud dostáváte hodně e-mailů, můžete použít pokročilé funkce, jako jsou složky hledání, které vám umožní uložit hledání, jako by to byly běžné složky e-mailů.

source: This chapter introduces you to Evolution and helps you get started. For more details, refer to the Evolution application help.
cs: Tato kapitola vás seznámí s Evolucí a pomůže vám začít. Další podrobnosti naleznete v nápovědě k aplikaci Evolution.

source: Starting Evolution
cs: Spuštění Evoluce

source: To start Evolution, , open the Activities Overview by pressing <keycap function="meta"/> and search for <literal>evol</literal>.
cs: Chcete-li spustit Evoluci, otevřete Přehled činností stisknutím <keycap function="meta"/> a vyhledejte <literal>evol</literal>.

source: Setup Assistant
cs: Pomocník nastavení

source: The first time you start Evolution, it opens an assistant to help you set up e-mail accounts and import data from other applications.
cs: Při prvním spuštění aplikace Evolution se otevře asistent, který vám pomůže nastavit e-mailové účty a importovat data z jiných aplikací.

source: The <guimenu>Evolution Account Assistant</guimenu> helps you provide all the required information.
cs: <guimenu>Pomocník účtu Evolution</guimenu> vám pomáhá dodat všechny požadované informace.

source: Restoring from a Backup File
cs: Obnova ze záložního souboru

source: When the assistant starts, the <guimenu>Welcome</guimenu> page is displayed. Proceed to the <guimenu>Restore from Backup</guimenu> page. If you previously backed up your Evolution configuration and want to restore it, activate the restoration option and select the backup file in the file chooser dialog.
cs: Po spuštění asistenta se zobrazí stránka <guimenu>Vítejte</guimenu>. Přejděte na stránku <guimenu>Obnovit ze zálohy</guimenu>. Pokud jste dříve zálohovali svou konfiguraci Evolution a chcete ji obnovit, aktivujte možnost obnovy a vyberte záložní soubor v dialogu pro výběr souboru.

source: Otherwise, proceed to <guimenu>Identity</guimenu>.
cs: Jinak pokračujte do menu <guimenu>Identita</guimenu>.

source: Defining Your Identity
cs: Definice Vaší identity

source: The <guimenu>Identity</guimenu> page is the next step in the assistant.
cs: Další krok pomocníka je stránka <guimenu>Identita</guimenu>.

source: Type your full name in the <guimenu>Full Name</guimenu> field.
cs: Napište svoje celé jméno do pole <guimenu>Celé jméno</guimenu>.

source: Type your e-mail address in the <guimenu>E-mail Address</guimenu> field.
cs: Do pole <guimenu>E-mailová adresa</guimenu> napište adresu své elektronické pošty.

source: (Optional) Type an address in the <guimenu>Reply-To</guimenu> field.
cs: Vyplňte (nepovinně) pole adresy pro odpověď <guimenu>Reply-To</guimenu>.

source: Only use this field if you want replies to e-mails from you to be sent to a different e-mail address.
cs: Toto pole použijte pouze v případě, že chcete, aby odpovědi na e-maily byly zasílány na jinou e-mailovou adresu.

source: (Optional) Type your organization name in the <guimenu>Organization</guimenu> field.
cs: Zapište (nepovinně) název své organizace do pole <guimenu>Organizace</guimenu>.

source: This is the company where you work, or the organization you represent when you send e-mails.
cs: Je to společnost, ve které pracujete, nebo organizace, kterou zastupujete při odesílání e-mailů.

source: Proceed to the next page.
cs: Přejděte na další stránku.

source: Receiving Mail
cs: Příjem pošty

source: The <guimenu>Receiving E-mail</guimenu> page lets you determine the server that you want to use to receive e-mail.
cs: Stránka <guimenu>Příjem e-mailu</guimenu> umožňuje určit server, který chcete použít k přijímání e-mailů.

source: You need to specify the type of server you want to receive mail from. If you are not sure about the type of server, contact your <phrase os="sles;sled">system administrator or</phrase> e-mail provider.
cs: Musíte určit typ serveru, ze kterého chcete přijímat poštu. Pokud si nejste jisti typem serveru, obraťte se na svého <phrase os="sles;sled">správce systému</phrase> nebo na svého poskytovatele elektronické pošty.

source: Select a server type in the <guimenu>Server Type</guimenu> list. The following is a list of available server types:
cs: V seznamu <guimenu>Typ serveru</guimenu> vyberte typ serveru. Následuje seznam dostupných typů serverů:

source: Exchange Web Services:
cs: Služby Exchange webu:

source: Allows you to connect to newer Microsoft Exchange servers to synchronize e-mail, calendar, and contact information. This is only available if you have installed the connector for Microsoft* Exchange* which is packaged in <package>evolution-ews</package> .
cs: Umožňuje připojit se k novějším serverům Microsoft Exchange a synchronizovat e-maily, kalendář a kontaktní informace. Je k dispozici, pouze pokud jste nainstalovali konektor pro Microsoft* Exchange*, který je obsažen v balíčku <package>evolution-ews</package>.

source: Keeps the e-mail on your server, so you can access your e-mail from multiple systems.
cs: Udržuje e-mail na serveru Vašeho poskytovatele, takže k e-mailu můžete přistupovat z více systémů.

source: Downloads your e-mail to your hard disk for permanent storage, freeing up space on the e-mail server.
cs: Stáhne e-maily na Váš pevný disk pro trvalé uložení a uvolní tak místo na e-mailovém serveru.

source: Connects to a news server and downloads a list of available news digests.
cs: Připojí se ke zpravodajskému serveru a stáhne seznam dostupných přehledů zpráv.

source: If you want to move e-mail from the spool and store it in your home directory, you need to provide the path to the mail spool you want to use. If you want to leave mail in your system’s spool files, select <guimenu>Standard Unix Mbox Spool File</guimenu> instead.
cs: Pokud chcete přesunout e-mail ze spoolu a uložit jej do svého domovského adresáře, musíte zadat cestu ke spoolu, který chcete použít. Pokud chcete nechat poštu v systémových spool souborech, vyberte místo toho <guimenu>Standardní spool soubor pro unixový Mbox </guimenu>.

source: MH Format Mail Directories:
cs: Adresáře mailu ve formátu MH:

source: To download your e-mail using <command>mh</command> or an <command>mh</command>-style program, you need to provide the path to the mail directory you want to use.
cs: Chcete-li stáhnout svůj e-mail pomocí <command>mh</command> nebo programu ve stylu <command>mh</command>, musíte zadat cestu k adresáři s poštou, který chcete použít.

source: Maildir Format Mail Directories:
cs: Adresáře mailu ve formátu Maildir:

source: If you download your e-mail using Qmail or another Maildir-style program, select this option. You need to provide the path to the mail directory you want to use.
cs: Stáhnete-li si e-mail programem Qmail nebo jiným programem stylu Maildir, vyberte tuto možnost. Musíte zadat cestu k adresáři pošty, který chcete použít.

source: Standard Unix Mbox Spool File or Directory:
cs: Standardní unixový spool soubor či adresář:

source: To read and store e-mail in the mail spool on your local system, select this option. You need to provide the path to the mail spool you want to use.
cs: Tuto možnost vyberte, chcete-li číst a ukládat e-maily v mail spoolu místního systému. Musíte zadat cestu ke spoolu pošty, který chcete použít.

source: None:
cs: Žádný:

source: If you do not plan to check e-mail with this account, select this option. There are no configuration options.
cs: Neplánujete-li kontrolovat e-maily tímto účtem, vyberte tuto možnost. Nemá žádné konfigurační možnosti.

source: Configuration Options for IMAP+, POP, and USENET
cs: Konfigurační možnosti IMAP+, POP a USENET

source: If you selected IMAP+, POP, or USENET News as the server type, you need to specify additional information.
cs: Pokud jste jako typ serveru vybrali IMAP +, POP nebo USENET News, musíte zadat další informace.

source: If you are not sure about the correct server address, user name or security setting, contact your <phrase os="sles;sled">system administrator or</phrase> e-mail provider.
cs: Nejste-li si jisti správnou adresou serveru, uživatelským jménem nebo nastavením zabezpečení, obraťte se na <phrase os="sles;sled">správce systému</phrase> nebo na svého poskytovatele pošty.

source: Type the host name of your e-mail server into the text box <guimenu>Server</guimenu>.
cs: Do textového pole <guimenu>Server</guimenu> zadejte název vašeho e-mailového serveru.

source: Type your user name for the account into the text box <guimenu>Username</guimenu>.
cs: Do textového pole zadejte své <guimenu>uživatelské jméno</guimenu> pro účet, který na serveru máte.

source: Choose a security setting supported by your mail server. For security reasons, avoid using <guimenu>No Encryption</guimenu>.
cs: Vyberte nastavení zabezpečení podporované vaším poštovním serverem. Z bezpečnostních důvodů se vyhněte použití <guimenu>Nešifrovat</guimenu>.

source: Select your authentication type in the <guimenu>Authentication</guimenu> list. To have Evolution check for supported authentication types, click <guimenu>Check for Supported Types</guimenu>. Then choose one of the options without a strikeout.
cs: V seznamu <guimenu>Ověřování</guimenu> vyberte typ ověřování (autentizace). Chcete-li, aby Evolution zkontroloval podporované typy ověřování, klikněte na <guimenu>Zjistit podporované typy</guimenu>. Poté vyberte jednu z nepřeškrtnutých možností.

source: Some servers do not announce the authentication mechanisms they support. Therefore clicking this button is not a guarantee that the shown mechanisms actually work.
cs: Některé servery neohlašují ověřovací (autentizační) mechanismy, které podporují. Proto uvedené zjištění nezaručuje, že uvedené mechanismy skutečně fungují.

source: Configuration Options for Exchange Web Services
cs: Konfigurační možnosti pro služby Exchange webu

source: If you selected Exchange Web Services as the server type, you need to specify additional information.
cs: Pokud jste jako typ serveru vybrali Exchange Web Services, musíte zadat další informace.

source: Type the EWS URL of your e-mail server into the text box <guimenu>Host URL</guimenu>.
cs: Do textového pole <guimenu>URL hostitele</guimenu> zadejte adresu EWS (Email Web Service) vašeho e-mailového serveru.

source: If available, type the address of an Offline Address Book into the text box <guimenu>OAB URL</guimenu>.
cs: Zadejte adresu adresáře offline, pokud je k dispozici, do textového pole <guimenu>OAB URL</guimenu>.

source: If your login name and the name of your mailbox differ, select <guimenu>Open Mailbox of other user</guimenu>. Then type the mailbox name into the text box below.
cs: Pokud se vaše přihlašovací jméno a název vaší poštovní schránky liší, vyberte <guimenu>Otevřít poštovní schránku jiného uživatele</guimenu>. Poté zadejte název poštovní schránky do textového pole níže.

source: Select an authentication type in the <guimenu>Authentication</guimenu> list. To have Evolution check for supported authentication types, click <guimenu>Check for Supported Types</guimenu>. Then choose one of the options without a strikeout.
cs: V seznamu <guimenu>Ověřování</guimenu> vyberte typ ověřování. Chcete-li, aby Evolution zkontroloval podporované typy autentizace, klikněte na <guimenu>Zkontrolovat podporované typy</guimenu>. Poté vyberte jednu z nepřeškrtnutých možností.

source: Local Configuration Options
cs: Možnosti místní konfigurace

source: If you selected <guimenu>Local Delivery</guimenu>, <guimenu>MH-Format Mail Directories</guimenu>, <guimenu>Maildir-Format Mail Directories</guimenu>, or <guimenu>Standard Unix Mbox Spool File or Directory</guimenu>, specify the path to the local files or directories in the path field.
cs: Pokud jste vybrali <guimenu>Místní doručování</guimenu>, <guimenu>Adresáře pošty ve formátu MH</guimenu>, <guimenu>Adresáře pošty ve formátu Maildir</guimenu> nebo <guimenu>Standardní spool soubor nebo adresář pro schránku Unixu</guimenu>, zadejte cestu k místním souborům nebo adresářům do pole cesty.

source: Receiving Options
cs: Možnosti příjmu

source: After you have selected a mail delivery mechanism, you can set some preferences for its behavior.
cs: Jakmile jste vybrali mechanismus doručování pošty, můžete nastavit některé předvolby jeho chování.

source: IMAP+ Receiving Options
cs: Možnosti příjmu u IMAP+

source: If you selected IMAP+ as the receiving server type, you will now see a page of options to specify the behavior of Evolution.
cs: Pokud jste jako typ přijímajícího serveru vybrali IMAP+, zobrazí se nyní stránka možností pro specifikaci chování Evolution.

source: You can choose from the following options:
cs: Můžete si vybrat z těchto možností:

source: <guimenu>Check for new messages every ... minutes</guimenu>
cs: <guimenu>Kontrolovat nové zprávy každých ... minut</guimenu>

source: Select if you want Evolution to automatically check for new mail. Set how often to check.
cs: Vyberte, zda chcete, aby Evolution automaticky vyhledával novou poštu. Nastavte, jak často ji má kontrolovat.

source: <guimenu>Check for new message in all folders</guimenu>
cs: <guimenu>Kontrolovat nové zprávy ve všech složkách</guimenu>

source: Select if you want to check for new messages in all folders.
cs: Vyberte, zda chcete zkontrolovat nové zprávy ve všech složkách.

source: <guimenu>Check for new message in subscribed folders</guimenu>
cs: <guimenu>Kontrolovat nové zprávy v odebíraných složkách</guimenu>

source: Select if you want to check for new messages in subscribed folders.
cs: Vyberte, zda chcete zkontrolovat nové zprávy ve složkách, které máte vybrané jako viditelné/odebírané.

source: <guimenu>Use Quick Resync if the server supports it</guimenu>
cs: <guimenu>Používat Quick Resync, ovládá-li ji server</guimenu>

source: Select to use Quick Resync which makes browsing mail faster on supported servers.
cs: Tuto možnost vyberte, chcete-li použít Quick Resync (rychlou synchronizaci), která zrychluje procházení pošty na serverech podporujících tuto funkci.

source: <guimenu>Listen for server change notifications</guimenu>
cs: <guimenu>Sledovat oznámení změn ze serveru</guimenu>

source: Select if you want Evolution to listen for change notifications. If you activate this option, Evolution will show you mail as it arrives. Therefore, you can usually deactivate <guimenu>Check for new messages every ... minutes</guimenu>.
cs: Vyberte, zda má Evolution sledovat oznámení o změně. Aktivujete-li tuto možnost, Evolution vám ukáže poštu, jakmile dorazí. Proto můžete <guimenu>obvykle kontrolovat nové zprávy každých ... minut</guimenu>.

source: <guimenu>Show only subscribed folders</guimenu>
cs: <guimenu>Ukázat pouze odebírané složky</guimenu>

source: Select if you want Evolution to show only subscribed folders.
cs: Zvolte, chcete-li, aby Evolution zobrazoval pouze Vámi zvolené odebírané složky.

source: You can unsubscribe from folders to cut down on the number of irrelevant folders shown in Evolution and to reduce the amount of mail that is downloaded.
cs: Můžete se odhlásit od nepotřebných složek a snížit jak počet složek zobrazených v Evolution, tak množství stažené pošty.

source: <guimenu>Apply filters to new messages in all folders</guimenu>
cs: <guimenu>Na nové zprávy ve všech složkách aplikujte filtry</guimenu>

source: Select if you want to apply filters to new messages, and whether to do so in all folders or only in the Inbox folder.
cs: Zvolte, zda chcete použít filtry na nové zprávy a zda to chcete ve všech složkách nebo pouze ve složce Doručená pošta.

source: <guimenu>Check new messages for Junk contents</guimenu>
cs: <guimenu>Kontrolujte nové zprávy na spam</guimenu>

source: Select if you want to check new messages for junk content, and whether to do so in all folders or only in the Inbox folder.
cs: Zvolte, zda chcete zkontrolovat, neobsahují-li nové zprávy nevyžádaný obsah, a chcete-li to provést ve všech složkách, nebo pouze ve složce Doručená pošta.

source: <guimenu>Automatically synchronize remote mail locally</guimenu>
cs: <guimenu>Automaticky synchronizovat vzdálenou poštu lokálně</guimenu>

source: Select this to download all your mail, so you can read it offline.
cs: Tuto možnost vyberte, chcete-li stáhnout veškerou poštu, abyste ji mohli číst offline.

source: POP Receiving Options
cs: Možnosti příjmu u POP

source: If you selected POP as the receiving server type, you will now see a page of options to specify the behavior of Evolution.
cs: Jestliže jste jako typ přijímajícího serveru vybrali POP, zobrazí se nyní stránka možností pro specifikaci chování Evolution.

source: <guimenu>Leave messages on server</guimenu>
cs: <guimenu>Ponechat zprávy na serveru</guimenu>

source: Select if you want leave your mail on the server or delete it on the server when you download it to your computer. You can also set a period of time for which the messages will be kept on the server after they were downloaded.
cs: Vyberte, zda chcete nechat poštu na serveru nebo ji ze serveru smazat, když ji stáhnete do počítače. Můžete také nastavit dobu, po kterou budou zprávy po stažení drženy na serveru.

source: <guimenu>Disable support for all POP3 extensions</guimenu>
cs: <guimenu>Vypnout podporu všech rozšíření POP3</guimenu>

source: Disabling POP3 extensions can help with old or misconfigured servers. Select if you have trouble receiving mail.
cs: Zakázat rozšíření POP3 může pomoci se starými nebo nesprávně konfigurovanými servery. Vyberte, máte-li potíže s příjmem pošty.

source: USENET News Receiving Options
cs: Možnosti příjmu zpráv USENET

source: If you selected USENET News as the receiving server type, you will now see a page of options to specify the behavior of Evolution.
cs: Jestliže jste jako typ přijímajícího serveru vybrali USENET News, zobrazí se vám stránka s možnostmi, jak určit chování Evolution.

source: Select if you want to apply filters to new messages.
cs: Vyberte, zda chcete na nové zprávy použít filtry.

source: <guimenu>Show folders in short notations</guimenu>
cs: <guimenu>Zobrazit složky v krátkém formátu</guimenu>

source: Abbreviate folder names, for example, <literal>comp.os.linux</literal> appears as <literal>c.o.linux</literal>.
cs: Zkrátí názvy složek, například <literal>comp.os.linux</literal> zobrazí jako <literal>c.o.linux</literal>.

source: <guimenu>In the subscription dialog, show relative folder names</guimenu>
cs: <guimenu>V dialogu výběru složek pro odběr ukázat relativní názvy složek</guimenu>

source: Display only the name of the folder. For example, the folder <literal>evolution.mail</literal> would appear as <literal>evolution</literal>.
cs: Zobrazit jen název složky. Například složka <literal>evolution.mail</literal> se zobrazí jako <literal>evolution</literal>.

source: Exchange Web Services Receiving Options
cs: Možnosti příjmu od webových služeb Exchange

source: If you selected Exchange Web Services as the receiving server type, you will now see a page of options to specify the behavior of Evolution.
cs: Jestliže jste jako typ přijímajícího serveru vybrali webovou službu Exchange Web Services, zobrazí se nyní stránka možností pro specifikaci chování Evolution.

source: <guimenu>Connection timeout (in seconds)</guimenu>
cs: <guimenu>Prodleva spojení (sekund)</guimenu>

source: Set maximum time to wait for an answer from the server.
cs: Nastavte maximální dobu čekání na odpověď ze serveru.

source: <guimenu>Cache offline address book</guimenu>
cs: <guimenu>Kešovat off-line adresář</guimenu>

source: If you provided an OAB URL in the prior step, you can select caching an address book. This will make the address book available when offline.
cs: Jestliže jste v předchozím kroku zadali adresu URL OAB (off-line adresáře), můžete vybrat ukládání do mezipaměti adresáře. Díky tomu bude adresář dostupný offline.

source: Local Delivery Receiving Options
cs: Možnosti příjmu místního doručení

source: If you selected that you want to receive mail through Local Delivery, you will now see a page of options to specify the behavior of Evolution.
cs: Jestliže jste vybrali, že chcete přijímat poštu místním doručováním, zobrazí se nyní stránka možností pro specifikaci chování Evolution.

source: Select <guimenu>Check for new messages every ... minutes</guimenu> if you want Evolution to automatically check for new mail. Set how often to check.
cs: Vyberte <guimenu>Zkontrolovat nové zprávy každých ... minut</guimenu>, pokud chcete, aby Evolution automaticky kontroloval novou poštu. Nastavte, jak často se má pošta kontrolovat.

source: MH-Format Mail Directories Receiving Options
cs: Možnosti příjmu poštovních adresářů ve formátu MH

source: If you selected that you want to receive mail through MH-Format Mail Directories, you will now see a page of options to specify the behavior of Evolution.
cs: Pokud jste vybrali, že chcete přijímat poštu přes poštovní adresáře formátu MH, zobrazí se nyní stránka možností pro specifikaci chování Evolution.

source: Select <guimenu>Use the .folders summary file</guimenu> to use the <filename>.folders</filename> summary file.
cs: Vyberte <guimenu>Použít souhrnný soubor .folders</guimenu>, aby se soubor <filename>.folders</filename> použil.

source: Maildir-Format Mail Directories Receiving Options
cs: Možnosti příjmu poštovních adresářů ve formátu Maildir

source: If you selected that you want to receive mail through Maildir-Format Mail Directories, you will now see a page of options to specify the behavior of Evolution.
cs: Jestliže jste vybrali, že chcete přijímat poštu prostřednictvím poštovních adresářů ve formátu Maildir, zobrazí se nyní stránka možností pro specifikaci chování Evolution.

source: Select <guimenu>Apply filters to new messages in Inbox</guimenu> if you want to apply filters to new messages.
cs: Vyberte <guimenu>Aplikovat filtry na nové zprávy v Inbox</guimenu>, chcete-li aplikovat filtry na nové zprávy.

source: Standard Unix Mbox Spool or Directory Receiving Options
cs: Standardní unixová spool schránka nebo Možnosti příjmu do adresáře
