Repository: openSUSE/doc-sle-translations
Catalog: */po/apps_firefox.*.po
Languages: cs, de

source: Some add-ons require you to restart the browser when you uninstall or disable them. In such cases, after clicking either of these actions, a <guimenu>Restart now</guimenu> link appears in the add-ons manager.
cs: Některé doplňky vyžadují restartování prohlížeče, když je odinstalujete nebo zakážete. V takových případech se po kliknutí na některou z těchto akcí ve správci doplňků zobrazí odkaz <guimenu>Restartovat hned</guimenu>.
de: Bei einigen Add-ons müssen Sie den Browser neu starten, wenn Sie sie deinstallieren oder deaktivieren. In solchen Fällen erscheint nach dem Anklicken einer dieser Aktionen im Add-On-Manager ein Link <guimenu>Jetzt neu starten</guimenu>.

source: Printing from Firefox
cs: Tisk z Firefoxu
de: Drucken aus Firefox

source: Before you actually print a Web page, you can use the print preview function to control how the printed page will look like. From the menu bar, choose <menuchoice> <guimenu>File</guimenu> <guimenu>Print Preview</guimenu> </menuchoice>. Configure paper size and orientation per printer with <guimenu>Page Setup</guimenu>.
cs: Před vlastním tiskem webové stránky můžete pomocí funkce náhledu tisku určit, jak bude vytištěná stránka vypadat. Na panelu nabídek vyberte <menuchoice> <guimenu>Soubor</guimenu> <guimenu>Náhled tisku</guimenu> </menuchoice>. Konfigurujte velikost a orientaci papíru (pro každou tiskárnu zvlášť) pomocí <guimenu>Nastavení stránky</guimenu>.
de: Bevor Sie eine Webseite tatsächlich drucken, können Sie die Druckvorschau-Funktion verwenden, um zu kontrollieren, wie die gedruckte Seite aussehen wird. Wählen Sie in der Menüleiste <menuchoice> <guimenu>Datei</guimenu> <guimenu>Druckvorschau</guimenu> </menuchoice>. Konfigurieren Sie Papierformat und Ausrichtung pro Drucker mit <guimenu>Seite einrichten</guimenu>.

source: To print a Web page either choose, from the menu bar, <menuchoice> <guimenu>File</guimenu><guimenu>Print</guimenu> </menuchoice> or press <keycombo><keycap function="control"/><keycap>P</keycap></keycombo>. The <guimenu>Printer</guimenu> dialog opens. To print with the default options click <guimenu>Print</guimenu>.
cs: Chcete-li vytisknout webovou stránku, vyberte z panelu nabídek <menuchoice> <guimenu>Soubor</guimenu> <guimenu>Vytisknout stránku...</guimenu> </menuchoice> nebo stiskněte klávesu <keycombo> <keycap function="control"/> <keycap>P</keycap> </keycombo>. Otevře se dialogové okno <guimenu>Tiskárna</guimenu>. Chcete-li tisknout s výchozími možnostmi, klikněte na <guimenu>Tisk</guimenu>.
de: Um eine Webseite zu drucken, wählen Sie entweder aus der Menüleiste <menuchoice> <guimenu>Datei</guimenu><guimenu>Drucken</guimenu> </menuchoice> oder drücken Sie <keycombo><keycap function="control"/><keycap>P</keycap></keycombo>. Das Dialogfeld <guimenu>Drucker</guimenu> wird geöffnet. Um mit den Standardoptionen zu drucken, klicken Sie auf <guimenu>Drucken</guimenu>.

source: The Printer dialog also offers extensive configuration options to fine-tune the printout. On the <guimenu>General</guimenu> tab, choose a printer, the range to print, the number of copies and the order. <guimenu>Page Setup</guimenu> lets you specify the number of pages per side, the scaling factor, and paper source and type. If the printer supports it, you can also activate double-sided printing here. Control how frames, backgrounds, header and footer are printed on the <guimenu>Options</guimenu> tab.
cs: Dialogové okno Tiskárna také nabízí rozsáhlé možnosti konfigurace pro jemné doladění vzhledu tisku. Na kartě <guimenu>Obecné</guimenu> vyberte tiskárnu, rozsah pro tisk, počet kopií a pořadí. <guimenu>Nastavení stránky</guimenu> umožňuje určit počet stránek na stranu, faktor změny měřítka a zdroj a typ papíru. Pokud to tiskárna podporuje, můžete zde také aktivovat oboustranný tisk. Určete, jak budou rámečky, pozadí, záhlaví a zápatí tisknuty, na kartě <guimenu>Možnosti</guimenu>.
de: Das Dialogfeld "Drucker" bietet auch umfangreiche Konfigurationsoptionen zur Feinabstimmung des Ausdrucks. Auf der Registerkarte <guimenu>Allgemein</guimenu> wählen Sie einen Drucker, den zu druckenden Bereich, die Anzahl der Exemplare und die Reihenfolge. Unter <guimenu>Seite einrichten</guimenu> können Sie die Anzahl der Seiten pro Seite, den Skalierungsfaktor sowie die Papierquelle und den Papiertyp festlegen. Wenn der Drucker dies unterstützt, können Sie hier auch den doppelseitigen Druck aktivieren. Steuern Sie, wie Rahmen, Hintergründe, Kopf- und Fußzeilen auf der Registerkarte <guimenu>Optionen</guimenu> gedruckt werden.

source: For More Information
cs: Další informace
de: Für mehr Informationen

source: To get more information about Firefox see the following links:
cs: Další informace o Firefoxu najdete na následujících odkazech:
de: Weitere Informationen über Firefox erhalten Sie unter den folgenden Links:

source: <emphasis>Mozilla forums</emphasis>: <link xlink:href="https://www.mozilla.org/about/forums/"/>
cs: <emphasis>Fóra Mozilly</emphasis>: <link xlink:href="https://www.mozilla.org/about/forums/"/>

source: <emphasis>Main Menu reference</emphasis>: <link xlink:href="http://support.mozilla.org/kb/Menu+reference"/>
cs: <emphasis>Popis Hlavního menu</emphasis>: <link xlink:href="http://support.mozilla.org/kb/Menu+reference"/>

source: <emphasis>Preferences reference</emphasis>: <link xlink:href="http://support.mozilla.org/kb/Options+window"/>
cs: <emphasis>Popis předvoleb</emphasis>: <link xlink:href="http://support.mozilla.org/kb/Options+window"/>

source: <emphasis>Keyboard shortcuts</emphasis>: <link xlink:href="http://support.mozilla.org/kb/Keyboard+shortcuts"/>
cs: <emphasis>Klávesové zkratky</emphasis>: <link xlink:href="http://support.mozilla.org/kb/Keyboard+shortcuts"/>
