Repository: openSUSE/doc-sle-translations
Catalog: */po/apps_evolution.*.po
Languages: cs

source: If you selected that you want to receive mail through a Unix mbox Spool File or Directories, you will now see a page of options to specify the behavior of Evolution.
cs: Jestliže jste vybrali, že chcete přijímat poštu prostřednictvím spool souboru unixové schránky (m[ail]box) nebo adresářů, zobrazí se nyní stránka možností pro specifikaci chování Evolution.

source: Select <guimenu>Store status headers in Elm/Pine/Mutt format</guimenu> to store status headers in a way compatible with Elm, Pine, and Mutt.
cs: Vyberte <guimenu>Uložit záhlaví stavu ve formátu Elm/Pine/Mutt</guimenu>, chcete-li uložit záhlaví stavu způsobem kompatibilním s e-mailovými klienty Elm, Pine a Mutt.

source: Sending Mail
cs: Odesílání e-mailu

source: Now that you have entered information about how you plan to receive mail, Evolution needs to know about how you want to send it. Usually, a separate server configuration is necessary for this. Otherwise, this page will be skipped.
cs: Nyní, když jste zadali informace o tom, jak máte v plánu přijímat poštu, Evolution potřebuje vědět, jak ji chcete odeslat. K tomu je obvykle nutná konfigurace jiného serveru/služby (SMTP). Jinak (je-li použit stejný server jako pro příjem pošty) bude tato stránka přeskočena.

source: Select a server type from the <guimenu>Server Type</guimenu> list.
cs: Ze seznamu <guimenu>Typ serveru</guimenu> vyberte typ serveru.

source: The following server types are available:
cs: Dostupné typy odesílacích serverů/služeb:

source: Uses the Sendmail program to send mail from your system. Sendmail is more flexible, but is not as easy to configure, so you should select this option only if you know how to set up a Sendmail service.
cs: K odesílání pošty z vašeho systému bude použit program Sendmail. Sendmail je flexibilnější, ale není tak snadno konfigurovatelný, takže tuto možnost byste měli vybrat pouze tehdy, pokud víte, jak nastavit službu Sendmail.

source: Sends mail using a separate mail server. This is the most common choice for sending mail. If you choose SMTP, there are additional configuration options.
cs: Odesílá poštu pomocí samostatného poštovního serveru/služby. Toto je nejběžnější volba pro odesílání pošty. Pokud zvolíte SMTP, existují další možnosti konfigurace.

source: SMTP Configuration
cs: Konfigurace SMTP

source: Type the host address in the <guimenu>Server</guimenu> field.
cs: Zadejte adresu hostitele (např. DNS název) do pole <guimenu>Server</guimenu>.

source: If you are not sure what your host address is, contact your <phrase os="sles;sled">system administrator or</phrase> e-mail provider.
cs: Neznáte-li přesnou adresu hostitele, kontaktujte svého <phrase os="sles;sled">správce systému</phrase> nebo poskytovatele e-mailových služeb.

source: Select if your server requires authentication.
cs: Zvolte, když hostitel - server vyžaduje ověření.

source: If you selected that your server requires authentication, you need to provide the following information:
cs: Vyžaduje-li server ověření, musíte ještě zadat tyto údaje:

source: Select your authentication type in the <guimenu>Authentication</guimenu> list.
cs: Vyberte typ ověření ze seznamu <guimenu>Ověření</guimenu>.

source: or
cs: nebo

source: Click <guimenu>Check for Supported Types</guimenu> to have Evolution check for supported types. Then choose one of the options without a strikeout.
cs: Po kliknutí na <guimenu>Zkontrolovat podporované typy</guimenu> zjistí Evolution typy ověření, které server podporuje, a zobrazí je. Poté vyberte jednu z nepřeškrtnutých možností.

source: Some servers do not announce the authentication mechanisms they support. Therefore, clicking this button is not a guarantee that the shown mechanisms actually work.
cs: Některé servery neohlašují ověřovací mechanismy, které podporují. Proto klepnutí na toto tlačítko není zárukou, že uvedené mechanismy skutečně fungují.

source: Type your user name in the <guimenu>Username</guimenu> field.
cs: Zadejte své uživatelské jméno do pole <guimenu>Uživatelské jméno</guimenu>.

source: Final Steps
cs: Závěrečné kroky

source: Now that you have finished the e-mail configuration process, you need to give the account a name. The name can be any name you prefer. Type your account name on the <guimenu>Name</guimenu> field. Proceed to the next page and confirm your changes.
cs: Po dokončení procesu konfigurace e-mailu je třeba stanovit název účtu, který může být libovolný. Do pole <guimenu>Název</guimenu> zadejte název účtu. Přejděte na další stránku a potvrďte své změny.

source: Depending on your configuration, you may now be asked for your e-mail passwords and whether you want to save them or want to always enter them when starting Evolution.
cs: V závislosti na vaší konfiguraci můžete být nyní vyzváni k zadání vašich e-mailových hesel a toho, zda je chcete uložit, nebo je chcete vždy při spuštění Evolution zadat.

source: The Evolution main window will then open for the first time.
cs: Poté se poprvé otevře hlavní okno Evolution.

source: Using Evolution
cs: Používání Evolution

source: Now that the first-run configuration has finished, you are ready to begin using Evolution. This section sums up the most important parts of the user interface.
cs: Po dokončení konfigurace při prvním spuštění jste připraveni začít používat Evolution. Tento oddíl shrnuje nejdůležitější části uživatelského rozhraní.

source: Evolution Window
cs: Okno Evolution

source: Menu Bar
cs: Panel hlavního menu

source: The menu bar gives you access to nearly all of the features of Evolution.
cs: Panel menu umožňuje přístup téměř ke všem funkcím e-mailového klienta Evolution.

source: Folder List
cs: Seznam složek

source: The folder list gives you a list of the available folders for each account. To see the contents of a folder, click the folder name. The contents are displayed in the e-mail list.
cs: Seznam složek vám pro každý účet poskytne seznam jemu dostupných složek. Chcete-li zobrazit obsah složky, klikněte na její název. Obsah se zobrazí v seznamu e-mailů.

source: Toolbar
cs: Panel nástrojů

source: The toolbar gives you fast and easy access to the frequently used features in each component.
cs: Panel nástrojů umožňuje rychlý a snadný přístup k často používaným funkcím každé komponenty Evolution.

source: Search Bar
cs: Vyhledávací lišta

source: The search bar lets you search for e-mails. You can filter e-mails, contacts, and calendar entries and tasks using different criteria: a label, a search term, and an account or folder. The Search bar can also save frequently used searches to a search folder.
cs: Vyhledávací lišta umožňuje hledat e-maily. Můžete filtrovat e-maily, kontakty a položky kalendáře a úkoly podle různých kritérií: jmenovky, hledaného výrazu a účtu nebo složky. Vyhledávací lišta může také uložit často používaná vyhledávání do vyhledávací složky.

source: Message List
cs: Seznam zpráv

source: The message list displays a list of e-mails that you have received. To view an e-mail in the preview pane, select the e-mail.
cs: Seznam zpráv zobrazuje seznam přijatých e-mailů. Chcete-li zobrazit e-mail v podokně náhledu, vyberte jej.

source: Shortcut Bar
cs: Lišta zástupců

source: The shortcut bar at the left lets you switch between folders and program components.
cs: Nalevo umístěná lišta zástupců umožňuje přepínat mezi složkami a komponentami programu.

source: Statusbar
cs: Stavový řádek

source: The statusbar periodically displays a message, or informs you about the progress of a task, such as sending e-mail.
cs: Stavový řádek pravidelně zobrazuje zprávu nebo vás informuje o průběhu úkolu, například odeslání e-mailu.

source: On the far left, you will find the Online/Offline indicator. Click the Online/Offline indicator to switch between being using Evolution in online or offline mode.
cs: Zcela nalevo je umístěn indikátor Offline/Online. Jeho klikáním přepínáte mezi režimy Evolution - offline a online.

source: Preview Pane
cs: Podokno náhledu

source: The preview pane displays the contents of the e-mails that are selected in the e-mail list.
cs: Podokno náhledu zobrazuje obsah e-mailů vybraných v seznamu e-mailů.

source: The Menu Bar
cs: Panel menu

source: The menu bar’s contents always provide all the possible actions for any view of your data.
cs: Obsah panelu menu vždy poskytuje všechny možné akce pro jakékoli zobrazení vašich dat.

source: File:
cs: Soubor:

source: Anything related to a file or to the operations of the application usually falls under this menu, such as creating things, saving them to disk, printing them, and quitting the program itself.
cs: Do této nabídky obvykle spadá vše, co souvisí se souborem nebo operacemi aplikace, jako je vytváření souborů, jejich ukládání na disk, jejich tisk a ukončení celého programu.

source: Edit:
cs: Úpravy:

source: Contains tools to edit text and most configuration options.
cs: Obsahuje nástroje pro úpravu textu a většinu možností konfigurace.

source: View:
cs: Zobrazení:

source: Allows configuring the appearance of Evolution.
cs: Umožňuje konfiguraci vzhledu Evolution.

source: Message:
cs: Zpráva:

source: Contains actions that can be applied to a message.
cs: Obsahuje možné akce, které lze provést se zprávou.

source: Folder:
cs: Složka:

source: Contains actions that can be performed on folders.
cs: Obsahuje akce, které lze provádět se složkami.

source: Search:
cs: Hledat:

source: Lets you search for messages, or phrases within a message. You can also see previous searches you have made.
cs: Umožňuje vyhledávat zprávy nebo části textu zpráv. Můžete také vidět předchozí vyhledávání, která jste provedli.

source: Help:
cs: Nápověda:

source: Opens the Evolution application help.
cs: Otevře nápovědu aplikace Evolution.

source: The Shortcut Bar
cs: Lišta zástupců

source: The shortcut bar is the column on the left side of the main window. At the top, there is a list of folders for the selected Evolution component. The buttons at the bottom are shortcuts to the individual components, such as Mail and Contacts.
cs: Lišta zástupců je sloupec na levé straně hlavního okna. V horní části je seznam složek pro zvolenou komponentu Evolution. Tlačítka dole jsou zástupci jednotlivých komponent, například Pošta a Kontakty.

source: The folder list organizes your e-mail, calendars, contact lists, and task lists in a tree. Most people find one to four folders at the base of the tree, depending on the component and their system configuration. Each Evolution component has at least one, called <guimenu>On This Computer</guimenu>, for local information. For example, the folder list for the e-mail component shows all your e-mail accounts, local folders, and search folders.
cs: Seznam složek organizuje vaše e-maily, kalendáře, seznamy kontaktů a seznamy úkolů do stromu. Většina lidí najde jednu až čtyři složky na základně stromu, v závislosti na komponentě a konfiguraci systému. Každá komponenta Evolution má alespoň jednu složku, nazvanou <guimenu>Na tomto počítači</guimenu>, kde jsou místní informace. Například seznam složek komponenty Pošta zobrazuje všechny vaše e-mailové účty, místní složky a složky hledání.

source: If you receive large amounts of e-mail, you need additional ways to organize it. In Evolution, you can create own e-mail folders, address books, calendars, task lists, or memo lists.
cs: Dostáváte-li velké množství e-mailů, budete potřebovat další způsoby uspořádávání. V aplikaci Evolution můžete vytvářet vlastní e-mailové složky, adresáře, kalendáře, seznamy úkolů nebo seznamy poznámek.

source: Creating a folder
cs: Vytvoření složky

source: To create a new folder:
cs: K vytvoření nové složky:

source: Click <menuchoice> <guimenu>File</guimenu> <guimenu>New</guimenu><guimenu>Mail Folder</guimenu> </menuchoice>.
cs: Klikněte <menuchoice> <guimenu>Soubor</guimenu> <guimenu>Nový</guimenu><guimenu>Složka pošty</guimenu> </menuchoice>.

source: Type the name of the folder in the <guimenu>Folder Name</guimenu> field.
cs: Zadejte název složky do pole <guimenu>Název složky</guimenu>.

source: Select the location of the new folder.
cs: Zvolte umístění nové složky.

source: Click <guimenu>Create</guimenu>.
cs: Klikněte <guimenu>Vytvořit</guimenu>.

source: Folder Management
cs: Správa složek

source: Right-click a folder or subfolder to display a menu with the following options:
cs: Pravý klik složky nebo podsložky zobrazí nabídku možností:

source: <guimenu>Mark All Messages As Read</guimenu>:
cs: <guimenu>Označit všechny zprávy jako přečtené</guimenu>:

source: Marks all the messages in the folder as read.
cs: Označí všechny zprávy ve složce jako přečtené.

source: <guimenu>New Folder</guimenu>:
cs: <guimenu>Nová složka</guimenu>:

source: Creates a new folder or subfolder in the same location.
cs: Vytvoří novou složku nebo podsložku v tomtéž umístění.

source: <guimenu>Copy Folder To</guimenu>:
cs: <guimenu>Kopírovat složku do</guimenu>:

source: Copies the folder to a different location. When you select this item, Evolution offers a choice of locations to copy the folder to.
cs: Zkopíruje složku do jiného umístění. Když vyberete tuto položku, Evolution nabídne výběr umístění, do kterých se složka může zkopírovat.

source: <guimenu>Move Folder To</guimenu>:
cs: <guimenu>Přesunout složku do</guimenu>:

source: Moves the folder to another location.
cs: Přesune složku do jiného umístění.

source: <guimenu>Delete</guimenu>:
cs: <guimenu>Smazat</guimenu>:

source: Deletes the folder and all contents.
cs: Smaže složku a všechen její obsah.

source: <guimenu>Rename</guimenu>:
cs: <guimenu>Přejmenovat</guimenu>:

source: Lets you change the name of the folder.
cs: Umožní Vám změnit název složky.

source: Refresh:
cs: Aktualizovat:

source: Refreshes the folder.
cs: Aktualizuje zobrazení složky.

source: Properties:
cs: Vlastnosti:

source: Shows the number of total and unread messages in a folder.
cs: Ukáže počet všech a nepřečtených zpráv ve složce.

source: You can also rearrange folders and messages by dragging and dropping them.
cs: Složky a zprávy můžete také přeskupit přetažením.

source: Any time new e-mail arrives in an e-mail folder, that folder label is displayed in bold text, along with the number of new messages in that folder.
cs: Kdykoli do e-mailové složky dorazí nový e-mail, zobrazí se její název tučně spolu s počtem nových zpráv v dané složce.

source: Using E-Mail
cs: Používání e-mailu

source: The e-mail component of Evolution has the following standout features:
cs: E-mailová komponenta Evolution má tyto standardní funkce:

source: It supports multiple e-mail sources from many protocols.
cs: Podporuje více e-mailových zdrojů a mnoho protokolů.

source: It lets you guard your privacy with encryption.
cs: Umožní Vám chránit vaše soukromí šifrováním.

source: It can speedily handle large amounts of e-mail.
cs: Dokáže rychle zpracovat velké množství e-mailů.

source: Search folders allow you to come back to often-used searches.
cs: Složky vyhledávání umožňují návrat k často používaným hledáním.

source: Below is a summary of the user interface elements of the e-mail window.
cs: Níže je uveden přehled prvků uživatelského rozhraní v okně e-mailu.

source: The message list displays all the e-mails that you have. This includes all your read and unread messages and e-mail that is flagged to be deleted. With the <guimenu>Show</guimenu> drop-down box above the message you can filter the message list view using predefined and custom labels.
cs: Seznam zpráv zobrazuje všechny e-maily, které máte. To zahrnuje všechny vaše přečtené a nepřečtené zprávy a zprávy označené jako smazané. V rozevíracím seznamu <guimenu>Zobrazit</guimenu> nad zprávou můžete filtrovat zobrazení seznamu zpráv pomocí předdefinovaných a vlastních štítků.

source: This is where your e-mail is displayed.
cs: Zde je zobrazen Váš e-mail.

source: If you find the preview pane too small, you can resize the pane, enlarge the whole window, or double-click the message in the message list to have it open in a new window. To change the size of a pane, drag the divider between the two panes.
cs: Pokud zjistíte, že podokno náhledu je příliš malé, můžete změnit velikost podokna, zvětšit celé okno nebo poklepáním na zprávu v seznamu zpráv ji otevřít v novém okně. Chcete-li změnit velikost podokna, posuňte oddělovač mezi dvěma podokny.

source: As with folders, you can right-click messages in the message list and get a menu of possible actions. This includes moving or deleting them, creating filters or search folders based on them, and marking them as junk mail.
cs: Stejně jako u složek můžete v seznamu zpráv kliknout pravým tlačítkem myši a získat nabídku možných akcí. Jsou to: přesouvání nebo mazání, vytváření filtrů nebo prohledávání složek na jejich základě a označení zpráv jako nevyžádané pošty.

source: Actions related to e-mail, like <guimenu>Reply</guimenu> and <guimenu>Forward</guimenu>, appear as buttons in the toolbar and are also located in the right-click menu.
cs: Akce související s e-mailovou zprávou, jako např. <guimenu>Odpovědět</guimenu> a <guimenu>Přeposlat</guimenu>, se zobrazují jako tlačítka na panelu nástrojů a jsou také umístěny v nabídce po kliknutí pravým tlačítkem.

source: Templates
cs: Šablony

source: Evolution allows you to create and edit message templates that you can use at any time to send mail with the same pattern.
cs: Evolution umožňuje vytvářet a upravovat šablony zpráv, které můžete kdykoli použít k odesílání pošty stejného typu.

source: Calendaring
cs: Kalendář

source: To begin using the calendar, click <guimenu>Calendars</guimenu> in the shortcut bar. By default, the calendar shows today’s schedule on a ruled background. At the upper right, there is a <guimenu>Tasks</guimenu> list, where you can keep a list of tasks separate from your calendar appointments. Below that, there is a list for memos.
cs: Chcete-li začít používat kalendář, klikněte na <guimenu>Kalendář</guimenu> na panelu zástupců. Ve výchozím nastavení kalendář zobrazuje dnešní rozvrh na linkovaném pozadí. Vpravo nahoře je seznam <guimenu>Úkoly</guimenu>, kde můžete seznam úkolů uchovávat odděleně od schůzek v kalendáři. Níže je seznam poznámek.

source: Appointment List
cs: Seznam schůzek

source: The appointment list displays all your scheduled appointments.
cs: Seznam schůzek zobrazuje všechny Vaše naplánované schůzky.

source: Month Pane
cs: Podokno Měsíc

source: The month pane is a small view of a calendar month. You can also select a range of days in the month pane to display a custom range of days in the appointment list.
cs: Podokno měsíce je malé zobrazení kalendářního měsíce. Můžete také vybrat rozsah dní v podokně měsíce a zobrazit vlastní rozsah dní v seznamu schůzek.

source: Tasks
cs: Úkoly

source: Tasks are distinct from appointments because they generally do not have times associated with them. You can see a larger view of your task list by clicking <guimenu>Tasks</guimenu> in the shortcut bar.
cs: Úkoly se liší od schůzek, protože obvykle nemají přidružené termíny. Kliknutím na <guimenu>Úkoly</guimenu> na panelu zástupců zvětšíte zobrazení seznamu úkolů.

source: Memos
cs: Poznámky

source: Memos, like Tasks, do not have times associated with them. You can see a larger view of your Memo list by clicking <guimenu>Memos</guimenu> in the shortcut bar.
cs: Poznámky, tak jako úkoly, nemají přidružené termíny. Kliknutím na ikonu <guimenu>Poznámky</guimenu> na panelu zástupců můžete zobrazit větší zobrazení seznamu poznámek.

source: Managing Contacts
cs: Správa kontaktů

source: To use the contacts component, click <guimenu>Contacts</guimenu> in the shortcut bar. The Evolution contacts component can handle all of the functions of an address book or phone book.
cs: Chcete-li použít složku kontaktů, klikněte na <guimenu>Kontakty</guimenu> na panelu zástupců. Komponenta kontaktů Evolution zvládne všechny funkce adresáře nebo telefonního seznamu.

source: It does, however, also do more than a paper book. To share your address book on a network, you can use LDAP directories. To create a new contact entry, right-click an e-mail address or double-click an empty space in the right pane. You can also search contacts using the search bar.
cs: Dokáže však více než papírový adresář. Chcete-li sdílet svůj adresář v síti, můžete použít adresáře LDAP. Chcete-li vytvořit novou položku kontaktu, klepněte pravým tlačítkem myši na e-mailovou adresu nebo poklepejte na prázdné místo v pravém podokně. Kontakty můžete hledat i pomocí vyhledávací lišty.

source: By default, the display shows all your contacts in alphabetical order, in a card-based view. You can select other views from the <guimenu>View</guimenu> menu.
cs: Ve výchozím nastavení se na displeji zobrazují všechny vaše kontakty v abecedním pořadí. Z nabídky <guimenu>Zobrazit</guimenu> můžete vybrat další pohledy.

source: For More Information
cs: Další informace

source: Get more information about Evolution from the application help available via <keycap>F1</keycap>.
cs: Další informace o Evolution získáte z nápovědy k aplikaci dostupné po stisknutí <keycap>F1</keycap>.

source: Find more information on the project home page <link xlink:href="https://wiki.gnome.org/Apps/Evolution"/>.
cs: Další informace najdete na domovské stránce projektu <link xlink:href="https://wiki.gnome.org/Apps/Evolution"/>.
