Repository: openSUSE/doc-sle-translations
Catalog: */po/apps_brasero.*.po
Languages: cs, de

# _
source: translator-credits
cs: překladatelské kredity alkas alkas@volny.cz, 2016, 2020
de: Übersetzer-Credits

source: Brasero: Burning CDs and DVDs
cs: Brasero: Vypalování CD a DVD
de: Brasero: Brennen von CDs und DVDs

source: Brasero is a GNOME program for writing data and audio CDs and DVDs. To start Brasero, open the Activities Overview by pressing <keycap function="meta"/> and search for <literal>bras</literal>. Start the program from the main menu by clicking <menuchoice><guimenu>Applications</guimenu><guimenu>Sound &amp; Video</guimenu> <guimenu>Brasero</guimenu></menuchoice>.
cs: Brasero je program GNOME pro zápis datových a zvukových CD a DVD. Chcete-li spustit aplikaci Brasero, otevřete Přehled činností stisknutím <keycap function="meta"/> a vyhledejte <literal>bras</literal>. Spusťte program z hlavní nabídky kliknutím na <menuchoice><guimenu>Aplikace</guimenu><guimenu>Zvuk &amp; Video</guimenu> <guimenu>Brasero</guimenu></menuchoice>.
de: Brasero ist ein GNOME-Programm zum Schreiben von Daten- und Audio-CDs und -DVDs. Um Brasero zu starten, öffnen Sie die Aktivitäten-Übersicht durch Drücken von <keycap function="meta"/> und suchen Sie nach <literal>bras</literal>. Starten Sie das Programm vom Hauptmenü aus, indem Sie auf <menuchoice><guimenu>>Anwendungen</guimenu><guimenu>Ton &Amp; Video</guimenu> <guimenu>Brasero</guimenu></menuchoice> klicken.

source: The following sections are a quick introduction on how to create your own CD or DVD.
cs: Další sekce jsou stručným úvodem k vytvoření vlastního CD nebo DVD.
de: Die folgenden Abschnitte sind eine kurze Einführung, wie Sie Ihre eigene CD oder DVD erstellen können.

source: yes
cs: ano
de: Ja

source: Creating a Data CD or DVD
cs: Vytvoření datového CD nebo DVD
de: Erstellen einer Daten-CD oder -DVD

source: After starting Brasero for the first time, the main window appears as shown in <xref linkend="fig.brasero.main" xrefstyle="select:label nopage"/>.
cs: Po prvním startu Brasero ukáže toto hlavní okno: <xref linkend="fig.brasero.main" xrefstyle="select:label nopage"/>.
de: Nachdem Brasero zum ersten Mal gestartet wurde, erscheint das Hauptfenster wie in <xref linkend="fig.brasero.main" xrefstyle="select:label nopage"/> gezeigt.

source: Main View of Brasero
cs: Brasero, hlavní pohled
de: Hauptansicht von Brasero

source: To create a data CD or DVD, proceed as follows:
cs: Postup vytváření datových CD nebo DVD:
de: Um eine Daten-CD oder -DVD zu erstellen, gehen Sie wie folgt vor:

source: Click <guimenu>Data project</guimenu> or select <menuchoice> <guimenu>Project</guimenu> <guimenu>New Project</guimenu> <guimenu>New Data Project</guimenu> </menuchoice>. The project view appears.
cs: Klikněte <guimenu>Datový projekt</guimenu> nebo zvolte <menuchoice> <guimenu>Projekt</guimenu> <guimenu>Nový projekt</guimenu> <guimenu>Nový datový projekt</guimenu> </menuchoice>. Zobrazí se projektový pohled.
de: Klicken Sie auf <guimenu>Datenprojekt</guimenu> oder wählen Sie <menuchoice> <guimenu>Projekt</guimenu> <guimenu>Neues Projekt</guimenu> <guimenu>Neues Datenprojekt</guimenu> </menuchoice>. Die Projektansicht erscheint.

source: Drag and drop the desired directories or individual files either from your file manager or by clicking the plus icon. To show your directory structure directly in Brasero, select <menuchoice> <guimenu>View</guimenu> <guimenu>Show Side Panel</guimenu> </menuchoice> or press <keycap>F7</keycap>.
cs: Přetáhněte požadované adresáře nebo jednotlivé soubory buď ze správce souborů, nebo kliknutím na ikonu "plus". Chcete-li zobrazit strukturu adresářů přímo v Braseru, vyberte <menuchoice> <guimenu>Pohled</guimenu> <guimenu>Ukázat postranní panel</guimenu> </menuchoice> nebo stiskněte <keycap>F7</keycap>.
de: Ziehen Sie die gewünschten Verzeichnisse oder einzelne Dateien per Drag & Drop entweder aus Ihrem Dateimanager oder durch Klicken auf das Plus-Symbol. Um Ihre Verzeichnisstruktur direkt in Brasero anzuzeigen, wählen Sie <menuchoice> <guimenu>Ansicht</guimenu> <guimenu>Seitenleiste anzeigen</guimenu> </menuchoice> oder drücken Sie <keycap>F7</keycap>.

source: Optionally, save the project under a name of your choice with <menuchoice> <guimenu>Project</guimenu> <guimenu>Save As</guimenu> </menuchoice>.
cs: Chcete-li, uložte projekt pod Vámi zvoleným názvem podle pomocí <menuchoice> <guimenu>Projekt</guimenu> <guimenu>Uložit jako</guimenu> </menuchoice>.
de: Optional können Sie das Projekt unter einem Namen Ihrer Wahl mit <menuchoice> <guimenu>Projekt</guimenu> <guimenu>Speichern unter</guimenu> </menuchoice> speichern.

source: Name your medium. The original label is <guimenu>Data disc (date)</guimenu>.
cs: Pojmenujte si médium. Výchozí štítek je <guimenu>Datový disk (datum)</guimenu>.
de: Benennen Sie Ihr Medium. Das Originaletikett lautet <guimenu>Datenträger (Datum)</guimenu>.

source: Choose the output medium from the pull down menu next to the <guimenu>Burn</guimenu> button (CD/DVD or an ISO image file).
cs: Vyberte výstupní médium z rozbalovací nabídky vedle tlačítka <guimenu>Vypálit</guimenu> (CD/DVD nebo soubor ISO-obrazu).
de: Wählen Sie das Ausgabemedium aus dem Pulldown-Menü neben der Schaltfläche <guimenu>Brennen</guimenu> (CD/DVD oder eine ISO-Abbilddatei).

source: Click <guimenu>Burn</guimenu>. A new dialog appears, depending on what medium you have selected in the previous step:
cs: Klikněte <guimenu>Vypálit</guimenu>. Zobrazí se nový dialog podle toho, jaké médium jste zvolili v předchozím kroku:
de: Klicken Sie auf <guimenu>Brennen</guimenu>. Ein neues Dialogfenster erscheint, je nachdem, welches Medium Sie im vorherigen Schritt ausgewählt haben:

source: You can define some parameters, like the burning speed or where to store temporary files. Under <guimenu>Options</guimenu> you can also choose whether to burn the image directly, close the session, verify the written data, and others.
cs: Můžete definovat některé parametry, například rychlost vypalování nebo místo ukládání dočasných souborů. V části <guimenu>Možnosti</guimenu> můžete také zvolit, zda chcete obraz vypálit přímo, ukončit relaci, ověřit zapsaná data aj.
de: Sie können einige Parameter definieren, wie z.B. die Brenngeschwindigkeit oder wo temporäre Dateien gespeichert werden sollen. Unter <guimenu>Optionen</guimenu> können Sie auch wählen, ob das Image direkt gebrannt, die Sitzung geschlossen, die geschriebenen Daten überprüft werden sollen, und andere.

source: ISO Image
cs: Obraz ISO

source: Specify a file name for your ISO image file.
cs: Určete název souboru Vašeho ISO-obrazu.
de: Geben Sie einen Dateinamen für Ihre ISO-Abbilddatei an.

source: Start the process with <guimenu>Burn</guimenu>.
cs: Proces vypalování zahájíte stisknutím <guimenu>Vypálit</guimenu>.
de: Starten Sie den Prozess mit <guimenu>Brennen</guimenu>.

source: Creating an Audio CD
cs: Vytváření zvukových CD
de: Erstellen einer Audio-CD

source: There are no significant differences between creating an audio CD and creating a data CD. Proceed as follows:
cs: Mezi vytvářením zvukových CD a datových CD nejsou významné rozdíly. Postup:
de: Es gibt keine signifikanten Unterschiede zwischen der Erstellung einer Audio-CD und der Erstellung einer Daten-CD. Gehen Sie wie folgt vor:

source: Select <menuchoice> <guimenu>Project</guimenu> <guimenu>New Project</guimenu> <guimenu>New Audio Project</guimenu> </menuchoice>.
cs: Zvolte <menuchoice> <guimenu>Projekt</guimenu> <guimenu>Nový Projekt</guimenu> <guimenu>Nový audio projekt</guimenu> </menuchoice>.
de: Wählen Sie <menuchoice> <guimenu>Projekt</guimenu> <guimenu>Neues Projekt</guimenu> <guimenu>Neues Audio-Projekt</guimenu> </menuchoice>.

source: Drag and drop the individual audio tracks to the project directory. The audio data must be in WAV or Ogg Vorbis format. Determine the sequence of the tracks by moving them up or down in the project directory.
cs: Přetáhněte jednotlivé zvukové stopy do adresáře projektu. Zvuková data musí být ve formátu WAV nebo Ogg Vorbis. Určete posloupnost skladeb jejich přesunutím nahoru nebo dolů v adresáři projektu.
de: Ziehen Sie die einzelnen Tonspuren per Drag & Drop in das Projektverzeichnis. Die Audiodaten müssen im WAV- oder Ogg Vorbis-Format vorliegen. Bestimmen Sie die Reihenfolge der Spuren, indem Sie sie im Projektverzeichnis nach oben oder unten verschieben.

source: Click <guimenu>Burn</guimenu>. A dialog opens.
cs: Klikněte <guimenu>Vypálit</guimenu>. Otevře se dialog.
de: Klicken Sie auf <guimenu>Brennen</guimenu>. Ein Dialog wird geöffnet.

source: Specify a drive to write to.
cs: Určete jednotku pro zápis.
de: Geben Sie ein Laufwerk an, auf das geschrieben werden soll.

source: Click <guimenu>Properties</guimenu> to adjust burning speed and other preferences. When burning audio CDs, choose a lower burning speed to reduce the risk of burn errors.
cs: Kliknutím <guimenu>Vlastnosti</guimenu> upravte rychlost vypalování a další předvolby. Při vypalování zvukových disků CD zvolte nižší rychlost vypalování, aby se snížilo riziko chyb vypalování.
de: Klicken Sie auf <guimenu>Eigenschaften</guimenu>, um die Brenngeschwindigkeit und andere Einstellungen anzupassen. Wählen Sie beim Brennen von Audio-CDs eine niedrigere Brenngeschwindigkeit, um das Risiko von Brennfehlern zu verringern.

source: Click <guimenu>Burn</guimenu>.
cs: Klikněte <guimenu>Vypálit</guimenu>.
de: Klicken Sie auf <guimenu>Brennen</guimenu>.

source: Copying a CD or DVD
cs: Kopírování CD a DVD
de: Kopieren einer CD oder DVD

source: To copy a CD or DVD, proceed as follows:
cs: Při kopírování CD a DVD postupujte takto:
de: Um eine CD oder DVD zu kopieren, gehen Sie wie folgt vor:

source: Click <guimenu>Disc Copy</guimenu> or go to <menuchoice> <guimenu>Project</guimenu> <guimenu>New Project</guimenu> <guimenu>Copy Disc</guimenu> </menuchoice>. The <guimenu>Copy CD/DVD</guimenu> dialog opens.
cs: Klikněte <guimenu>Kopírovat disk</guimenu> nebo zvolte menu <menuchoice> <guimenu>Projekt</guimenu> <guimenu>Nový projekt</guimenu> <guimenu>Kopírovat disk</guimenu> </menuchoice>. Otevře se dialog <guimenu>Kopírovat CD/DVD</guimenu>.
de: Klicken Sie auf <guimenu>Diskette kopieren</guimenu> oder gehen Sie zu <menuchoice> <guimenu>Projekt</guimenu> <guimenu>Neues Projekt</guimenu> <guimenu>CD/DVD kopieren</guimenu> </menuchoice>. Der Dialog <guimenu>CD/DVD kopieren</guimenu> wird geöffnet.

source: Specify the source drive you want to copy.
cs: Určete jednotku, odkud chcete kopírovat.
de: Geben Sie das Quelllaufwerk an, das Sie kopieren möchten.

source: Specify a drive or image file to write to.
cs: Určete jednotku nebo soubor, kam chcete kopírovat.
de: Geben Sie ein Laufwerk oder eine Image-Datei zum Schreiben an.

source: If necessary, change the burning speed, the temporary directory and other options in <guimenu>Properties</guimenu>.
cs: Je-li třeba, změňte rychlost vypalování, dočasný adresář a další možnosti v menu <guimenu>Vlastnosti</guimenu>.
de: Falls erforderlich, ändern Sie die Brenngeschwindigkeit, das temporäre Verzeichnis und andere Optionen in <guimenu>Eigenschaften</guimenu>.

source: Click <guimenu>Copy</guimenu>.
cs: Klikněte <guimenu>Kopírovat</guimenu>.
de: Klicken Sie auf <guimenu>Kopieren</guimenu>.

source: Writing ISO Images
cs: Zápis ISO-obrazů
de: Schreiben von ISO-Abbildern

source: If you already have an ISO image, click <guimenu>Burn image</guimenu> or go to <menuchoice> <guimenu>Project</guimenu> <guimenu>New Project</guimenu> <guimenu>Burn Image</guimenu> </menuchoice>. Choose the image to write and a disc to write to. If necessary, change parameters by clicking <guimenu>Properties</guimenu>. Choose the location of the image file with the pop-up menu labeled <guimenu>Path</guimenu>. Start the burning process and click <guimenu>Burn</guimenu>.
cs: Máte-li obraz ISO, klikněte na <guimenu>Vypálit obraz</guimenu> nebo přejděte na <menuchoice> <guimenu>Projekt</guimenu> <guimenu>Nový projekt</guimenu> <guimenu>Vypálit obraz</guimenu> </menuchoice>. Vyberte ISO-obraz, který chcete zapsat, a disk, na který ho chcete zapsat. V případě potřeby změňte parametry kliknutím na <guimenu>Vlastnosti</guimenu>. Vyberte umístění souboru ISO-obrazu z rozbalovací nabídky <guimenu>Cesta</guimenu>. Spusťte proces vypalování kliknutím na <guimenu>Vypálit</guimenu>.
de: Wenn Sie bereits ein ISO-Abbild haben, klicken Sie auf <guimenu>Abbild brennen</guimenu> oder gehen Sie zu <menuchoice> <guimenu>Projekt</guimenu> <guimenu>Neues Projekt</guimenu> <guimenu>Abbild brennen</guimenu> </menuchoice>. Wählen Sie das zu brennende Image und eine Disk zum Beschreiben. Ändern Sie gegebenenfalls die Parameter, indem Sie auf <guimenu>Eigenschaften</guimenu> klicken. Wählen Sie den Speicherort der Abbilddatei mit dem Einblendmenü mit der Bezeichnung <guimenu>Pfad</guimenu>. Starten Sie den Brennvorgang und klicken Sie auf <guimenu>Brennen</guimenu>.

source: Creating a Multisession CD or DVD
cs: Vytváření CD/DVD s více relacemi
de: Erstellen einer Multisession-CD oder -DVD

source: Multisession discs can be used to write data in more than one burning session. This is useful, for example, for writing backups that are smaller than the media. In each session, you can add another backup file. One note of interest is that you are not only limited to data CDs or DVDs. You can also add audio sessions in a multisession disc.
cs: Disky s více relacemi lze použít k zápisu dat ve více než jedné vypalovací relaci. To je užitečné například pro zápis záloh, které jsou menší než média. V každé relaci můžete přidat další záložní soubor. Stojí za zmínku, že se neomezujete pouze na datová CD/DVD. Na disk s více relacemi můžete také přidat zvukové relace.
de: Multisession-Disks können zum Schreiben von Daten in mehr als einer Brennsitzung verwendet werden. Dies ist z.B. nützlich, um Backups zu schreiben, die kleiner als die Medien sind. In jeder Sitzung können Sie eine weitere Sicherungsdatei hinzufügen. Ein interessanter Hinweis ist, dass Sie nicht nur auf Daten-CDs oder -DVDs beschränkt sind. Sie können auch Audiositzungen auf einer Multisession-Disc hinzufügen.

source: To start a new multisession disc, do the following:
cs: Chcete-li vytvořit nový disk s více sekcemi, postupujte takto:
de: Um eine neue Multisession-Disc zu starten, gehen Sie wie folgt vor:

source: Start with a data disc first as described in <xref linkend="sec.brasero.creating"/>. You cannot start with an audio CD session. Make sure that you do not fill up the entire disc, because otherwise you cannot append a new session.
cs: Začněte datovým diskem, jak je popsáno v <xref linkend="sec.brasero.creating"/>. Nelze začít zvukovou CD relací. Ujistěte se, že nevyplníte celý disk, protože jinak nelze novou relaci připojit.

source: Click <guimenu>Burn</guimenu>. The window <guimenu>Disc Burning Setup</guimenu> opens.
cs: Klikněte<guimenu>Vypálit</guimenu>. Otevře se okno <guimenu>Nastavení vypalování disku</guimenu>.

source: Select <guimenu>Leave the disc open to add other files later</guimenu> to make the disc multisession capable. Configure other options if needed.
cs: Vyberte <guimenu>Ponechte disk otevřený, aby šlo později přidat další soubory</guimenu>, čímž založíte vícerelační disk. V případě potřeby konfigurujte další možnosti.

source: Start the burning session with <guimenu>Burn</guimenu>.
cs: Zahajte vypalovací proces stisknutím <guimenu>Vypálit</guimenu>.
de: Starten Sie die Brennsitzung mit <guimenu>Brennen</guimenu>.

source: For More Information
cs: Další informace
de: Für mehr Informationen

source: You can find more information about Brasero at <link xlink:href="https://wiki.gnome.org/Apps/Brasero"/>.
cs: Více informací o aplikaci Brasero naleznete zde: <link xlink:href="https://wiki.gnome.org/Apps/Brasero"/>.
de: Weitere Informationen über Brasero finden Sie unter <link xlink:href="https://wiki.gnome.org/Apps/Brasero"/>.
