Repository: openSUSE/doc-sle-translations
Catalog: */po/apps_totem.*.po
Languages: cs

# _
source: translator-credits
cs: překladatelské kredity alkas alkas@volny.cz, 2016, 2020

source: yes
cs: ano

source: GNOME Videos is the default movie player. GNOME Videos provides the following multimedia features:
cs: GNOME Videos je výchozí přehrávač filmů. GNOME Videos nabízí následující multimediální funkce:

source: Support for a variety of video and audio files
cs: Podpora různých video a zvukových souborů

source: A variety of zoom levels and aspect ratios, and a full screen view
cs: Různé úrovně přiblížení a poměry stran; zobrazení na celé obrazovce

source: Seek and volume controls
cs: Ovládání hledání a hlasitosti

source: Playlists
cs: Přehrávací seznamy

source: Complete keyboard navigation
cs: Úplná navigace klávesnicí

source: To start GNOME Videos, open the Activities Overview by pressing <keycap function="meta"/> and search for <literal>video</literal>.
cs: Chcete-li spustit GNOME Videos, otevřete Přehled aktivit stisknutím <keycap function="meta"/> a najděte <literal>video</literal>.

source: Using GNOME Videos
cs: Použití GNOME Videos

source: When you start GNOME Videos, the following window is displayed.
cs: Po spuštění GNOME Videos se zobrazí následující okno.

source: GNOME Videos Start-Up Window
cs: Spouštěcí okno GNOME Videos

source: Opening a Video or Audio File
cs: Otevření video nebo audio souboru

source: Click <menuchoice><guimenu>Videos</guimenu><guimenu>Open</guimenu></menuchoice>.
cs: Klikněte <menuchoice><guimenu>Videa</guimenu><guimenu>Otevřít</guimenu></menuchoice>.

source: Select the files you want to open, then click <guimenu>Add</guimenu>
cs: Vyberte soubory, které chcete otevřít, a klikněte na <guimenu>Přidat</guimenu>

source: You can also drag a file from another application (such as a file manager) to the GNOME Videos window. GNOME Videos opens the file and plays the movie or song. GNOME Videos displays the title of the movie or song beneath the display area and in the titlebar of the window.
cs: Můžete také přetáhnout soubor z jiné aplikace (např. Správce souborů) do okna GNOME Videos. GNOME otevře soubor a přehraje film nebo skladbu. GNOME Videos zobrazuje název filmu nebo skladby pod zobrazenou oblastí a v záhlaví okna.

source: Unrecognized File Format
cs: Nerozpoznaný formát souboru

source: If you try to open a file format that GNOME Videos does not recognize, the application displays an error message and recommends a suitable codec.
cs: Pokusíte-li se otevřít soubor formátu, který GNOME Videos nerozpozná, aplikace zobrazí chybovou zprávu a doporučí vhodný kodek.

source: You can double-click a video or audio file in GNOME Files to open it in the GNOME Videos window by default.
cs: Můžete poklepat na video nebo zvukový soubor v souborech GNOME a ve výchozím nastavení jej otevřít v okně GNOME Videos.

source: Opening a Video or Audio File By URI Location
cs: Otevření video nebo audio souboru podle umístění URI

source: Click <menuchoice><guimenu>Videos</guimenu><guimenu>Open Location</guimenu> </menuchoice>.
cs: Klikněte <menuchoice><guimenu>Videa</guimenu><guimenu>Otevřít umístění</guimenu> </menuchoice>.

source: Specify the URI location of the file you want to open, then click <guimenu>Open</guimenu>.
cs: Určete URI umístění souboru, který chcete otevřít, a klikněte na <guimenu>Otevřít</guimenu>.

source: Playing a DVD, VCD, or CD
cs: Přehrávat DVD, VCD nebo CD

source: To play a DVD, VCD, or CD, insert the disc in the optical device of your computer, then click <menuchoice> <guimenu>Movie</guimenu> <guimenu>Play Disc</guimenu> </menuchoice>.
cs: Chcete-li přehrát disk DVD, VCD nebo CD, vložte disk do optické jednotky počítače a poté klikněte na <menuchoice> <guimenu>Film</guimenu> <guimenu>Přehrát disk</guimenu> </menuchoice>.

source: To eject a DVD, VCD, or CD, click <menuchoice> <guimenu>Movie</guimenu> <guimenu>Eject</guimenu> </menuchoice>.
cs: Chcete-li vysunout disk DVD, VCD nebo CD, klikněte na <menuchoice> <guimenu>Film</guimenu> <guimenu>Vysunout</guimenu> </menuchoice>.

source: To pause a movie or song that is playing, click the <inlinemediaobject><textobject role="description"><phrase>GNOME Videos Pause</phrase></textobject><imageobject role="fo"><imagedata fileref="totem_pause_button.svg" width="0.8em" format="SVG"/></imageobject><imageobject role="html"><imagedata fileref="totem_pause_button-fallback.png" width="1em" format="PNG"/></imageobject></inlinemediaobject> button, or click <menuchoice> <guimenu>Movie</guimenu> <guimenu>Play/Pause</guimenu> </menuchoice>. When you pause a movie or song, the statusbar displays <guimenu>Paused</guimenu> and the time elapsed on the current movie or song.
cs: Chcete-li pozastavit přehrávaný film nebo skladbu, klikněte na <inlinemediaobject> <textobject role="description"> <phrase>GNOME Videos Pause</phrase> </textobject> <imageobject role="fo"> <imagedata fileref="totem_pause_button.svg" width="0.8em" format="SVG"/> </imageobject> <imageobject role="html"> <imagedata fileref="totem_pause_button-fallback.png" width="1em" format="PNG"/> </imageobject> </inlinemediaobject> nebo klikněte na <menuchoice> <guimenu>Film</guimenu> <guimenu>Přehrát/pozastavit</guimenu> </menuchoice>. Při pozastavení filmu nebo skladby se na stavovém řádku zobrazí <guimenu>Pozastaveno</guimenu> a čas, který uplynul od aktuálního filmu nebo skladby.

source: To resume playing a movie or song, click the <inlinemediaobject><textobject role="description"><phrase>GNOME Videos Play</phrase></textobject><imageobject role="fo"><imagedata fileref="totem_play_button.svg" width="0.8em" format="SVG"/></imageobject><imageobject role="html"><imagedata fileref="totem_play_button-fallback.png" width="1em" format="PNG"/></imageobject></inlinemediaobject> button, or click <menuchoice> <guimenu>Movie</guimenu> <guimenu>Play/Pause</guimenu></menuchoice>.
cs: Chcete-li pokračovat v přehrávání filmu nebo skladby, klikněte na <inlinemediaobject> <textobject role="description"> <phrase>GNOME Videos Přehrát</phrase> </textobject> <imageobject role="fo"> <imagedata fileref="totem_play_button.svg" width="0.8em" format="SVG"/> </imageobject> <imageobject role="html"> <imagedata fileref="totem_play_button-fallback.png" width="1em" format="PNG"/> </imageobject> </inlinemediaobject> nebo klikněte na <menuchoice> <guimenu>Film</guimenu> <guimenu>Přehrát/Pauza</guimenu> </menuchoice>.

source: To play or pause a movie, you can also press <keycap>P</keycap>.
cs: Chcete-li přehrát nebo pozastavit film, můžete také stisknout klávesu <keycap>P</keycap>.

source: To view properties of a movie or song, click <menuchoice> <guimenu>View</guimenu> <guimenu>Sidebar</guimenu> </menuchoice> to make the sidebar appear. The dialog contains the title, artist, year, and duration of movie or song, video dimensions, codec, frame rate, and the audio bit rate.
cs: Chcete-li zobrazit vlastnosti filmu nebo skladby, klikněte na <menuchoice> <guimenu>Zobrazit</guimenu> <guimenu>Postranní panel</guimenu> </menuchoice> a zobrazte postranní panel. Dialog obsahuje název, interpreta, rok a trvání filmu nebo písně, rozměry videa, kodek, obnovovací kmitočet a přenosovou rychlost zvuku.

source: Seeking Through Movies or Songs
cs: Hledání filmů nebo písní

source: To seek through movies or songs, use any of the following methods:
cs: Chcete-li vyhledávat filmy nebo písně, použijte některou z následujících metod:

source: To skip forward
cs: Přeskočit dopředu

source: Click <menuchoice> <guimenu>Go</guimenu> <guimenu>Skip Forward</guimenu> </menuchoice>. Alternatively, use <keycap function="left"/>.
cs: Klikněte <menuchoice> <guimenu>Přejít</guimenu> <guimenu>Skok vpřed</guimenu> </menuchoice>. Alternativně použijte <keycap function="left"/>.

source: To skip backward
cs: Přeskočit zpět

source: Click <menuchoice> <guimenu>Go</guimenu> <guimenu>Skip Backward</guimenu> </menuchoice>. Alternatively, use <keycap function="right"/>.
cs: Klikněte <menuchoice> <guimenu>Přejít</guimenu> <guimenu>Skok zpět</guimenu> </menuchoice>. Alternativně použijte <keycap function="right"/>.

source: To move to next movie or song
cs: Přechod na další film nebo skladbu

source: Click <menuchoice> <guimenu>Go</guimenu> <guimenu>Next Chapter/Movie</guimenu> </menuchoice>, or click the <inlinemediaobject><textobject role="description"><phrase>GNOME Videos Next</phrase></textobject><imageobject role="fo"><imagedata fileref="totem_next_button.svg" width="0.8em" format="SVG"/></imageobject><imageobject role="html"><imagedata fileref="totem_next_button-fallback.png" width="1em" format="PNG"/></imageobject></inlinemediaobject> button.
cs: Klikněte na <menuchoice> <guimenu>Přejít</guimenu> na <guimenu>Další kapitolu/film</guimenu> </menuchoice> nebo klikněte na <inlinemediaobject> <textobject role="description"> <phrase>GNOME Videos Další</phrase> </textobject> <imageobject role="fo"> <imagedata fileref="totem_next_button.svg" width="0.8em" format="SVG"/> </imageobject> <imageobject role="html"> <imagedata fileref="totem_next_button-fallback.png" width="1em" format="PNG"/> </imageobject> </inlinemediaobject>.

source: To move to previous movie or song
cs: Přechod na předchozí film nebo skladbu

source: Click <menuchoice> <guimenu>Go</guimenu> <guimenu>Previous Chapter/Movie</guimenu> </menuchoice>, or click the <inlinemediaobject><textobject role="description"><phrase>GNOME Videos Previous</phrase></textobject><imageobject role="fo"><imagedata fileref="totem_previous_button.svg" width="0.8em" format="SVG"/></imageobject><imageobject role="html"><imagedata fileref="totem_previous_button-fallback.png" width="1em" format="PNG"/></imageobject></inlinemediaobject> button.
cs: Klikněte na <menuchoice> <guimenu> Přejít </guimenu> na <guimenu>Předchozí kapitola/film</guimenu> </menuchoice> nebo klikněte na <inlinemediaobject> <textobject role="description"> <phrase>GNOME Videos Předchozí</phrase> </textobject> <imageobject role="fo"> <imagedata fileref="totem_previous_button.svg" width="0.8em" format="SVG"/> </imageobject> <imageobject role="html"> <imagedata fileref="totem_previous_button-fallback.png" width="1em" format="PNG"/> </imageobject> </inlinemediaobject>.

source: Changing the Zoom Factor
cs: Změna faktoru zvětšení

source: To change the zoom factor of the display area, use any of the following methods:
cs: Chcete-li změnit faktor zvětšení oblasti zobrazení, použijte některou z následujících metod:

source: To zoom to full screen mode
cs: Přiblížení do režimu celé obrazovky

source: Click <menuchoice> <guimenu>View</guimenu> <guimenu>Fullscreen</guimenu> </menuchoice>. Alternatively, press <keycap>F</keycap>.
cs: Klikněte <menuchoice> <guimenu>Zobrazení</guimenu> <guimenu>Celá obrazovka</guimenu> </menuchoice>. Případně stiskněte klávesu <keycap>F</keycap>.

source: To exit fullscreen mode, click <guimenu>Leave Fullscreen</guimenu> or press <keycap function="escape"/>.
cs: Chcete-li ukončit režim celé obrazovky, klikněte na <guimenu>Opustit celou obrazovku</guimenu> nebo stiskněte <keycap function="escape"/>.

source: To zoom to half size (50%) of the original movie or visualization
cs: Přiblížení na poloviční velikost (50%) původního filmu nebo vizualizace

source: Click <menuchoice> <guimenu>View</guimenu> <guimenu>Fit Window to Movie</guimenu> <guimenu>Resize 1:2</guimenu> </menuchoice>.
cs: Klikněte na <menuchoice> <guimenu>Zobrazení</guimenu> <guimenu>Přizpůsobit okno filmu</guimenu> <guimenu>Změnit velikost na 1:2 </guimenu> </menuchoice>.

source: To zoom to size (100%) of the original movie or visualization
cs: Změnit na velikost (100%) původního filmu nebo vizualizace

source: Click <menuchoice> <guimenu>View</guimenu> <guimenu>Fit Window to Movie</guimenu> <guimenu>Resize 1:1</guimenu> </menuchoice>.
cs: Klikněte na možnost <menuchoice> <guimenu>Zobrazení</guimenu> <guimenu>Přizpůsobit okno filmu</guimenu> <guimenu>Změnit velikost na 1:1</guimenu> </menuchoice>.

source: To zoom to double size (200%) of the original movie or visualization
cs: Zvětšit na dvojnásobnou velikost (200%) původního filmu nebo vizualizace

source: Click <menuchoice> <guimenu>View</guimenu> <guimenu>Fit Window to Movie </guimenu> <guimenu>Resize 2:1</guimenu> </menuchoice>.
cs: Klikněte na <menuchoice> <guimenu>Zobrazení</guimenu> <guimenu>Přizpůsobit okno filmu</guimenu> <guimenu>Změnit velikost na 2:1</guimenu> </menuchoice>.

source: To switch between different aspect ratios, click <menuchoice> <guimenu>View</guimenu> <guimenu>Aspect Ratio</guimenu> </menuchoice>.
cs: Chcete-li přepínat mezi různými poměry stran, klikněte na <menuchoice> <guimenu>Zobrazení</guimenu> <guimenu>Poměr stran</guimenu> </menuchoice>.

source: The default aspect ratio is <guimenu>Auto</guimenu>.
cs: Výchozí poměr stran je <guimenu>Auto</guimenu>.

source: Showing or Hiding Controls
cs: Zobrazení nebo skrytí ovládacích prvků

source: To hide the window controls of GNOME Videos, click <menuchoice> <guimenu>View</guimenu> <guimenu>Show Controls</guimenu> </menuchoice> and deselect the option. To show the controls on the GNOME Videos window, right-click the window, then select <guimenu>Show Controls</guimenu>. If the Show Controls option is selected, GNOME Videos shows the menubar, time elapsed slider, seek control buttons, volume slider, and statusbar on the window. If the Show Controls option is not selected, the application hides these controls and shows only the display area.
cs: Chcete-li skrýt ovládací prvky okna GNOME Videos, klikněte na <menuchoice> <guimenu>Zobrazení</guimenu> <guimenu>Zobrazit ovládací prvky</guimenu> </menuchoice> a zrušte výběr možnosti. Chcete-li zobrazit ovládací prvky v okně GNOME Videos, klepněte pravým tlačítkem myši na okno a vyberte příkaz <guimenu>Zobrazit ovládací prvky</guimenu>. Pokud je vybrána možnost Zobrazit ovládací prvky, GNOME Videos zobrazují v okně menu, posuvník uplynulého času, tlačítka posunu, posuvník hlasitosti a stavový řádek. Pokud není vybrána možnost Zobrazit ovládací prvky, aplikace tyto ovládací prvky skryje a zobrazí pouze oblast zobrazení.

source: Choosing Subtitles
cs: Výběr titulků

source: To choose the language of the subtitles, click <menuchoice> <guimenu>View</guimenu> <guimenu>Subtitles</guimenu> <guimenu>Select Text Subtitles</guimenu> </menuchoice>, then select the subtitles language (DVD) or subtitle file (AVI etc.) you want to display.
cs: Chcete-li zvolit jazyk titulků, klikněte na <menuchoice> <guimenu>Zobrazení</guimenu> <guimenu>Titulky</guimenu> <guimenu>Vyberte textové titulky</guimenu> </menuchoice> a vyberte jazyk titulků (DVD) ) nebo soubor titulků (AVI atd.), který chcete zobrazit.

source: To disable the display of subtitles, click <menuchoice> <guimenu>View</guimenu> <guimenu>Subtitles</guimenu> <guimenu>None</guimenu> </menuchoice>.
cs: Chcete-li zakázat zobrazení titulků, klikněte na <menuchoice> <guimenu>Zobrazení</guimenu> <guimenu>Titulky</guimenu> <guimenu>Žádné</guimenu> </menuchoice>.

source: By default, GNOME Videos chooses the same language for the subtitles that you use on your computer.
cs: Ve výchozím nastavení vybere GNOME Videos stejný jazyk titulků, jaký používáte v počítači.

source: GNOME Videos automatically loads and displays subtitles if the file that contains them has the same name as the video file. It supports the following subtitle file extensions: <filename>srt</filename>, <filename>asc</filename>, <filename>txt</filename>, <filename>sub</filename>, <filename>smi</filename>, or <filename>ssa</filename>.
cs: GNOME Videos automaticky načte a zobrazí titulky, pokud soubor, který je obsahuje, má stejný název jako video soubor. Podporuje tyto typy souborů s titulky (dle přípon): <filename>srt</filename>, <filename>asc</filename>, <filename>txt</filename>, <filename>sub</filename>, <filename>smi</filename> a <filename>ssa</filename>.

source: Modifying GNOME Videos Preferences
cs: Úprava předvoleb GNOME Videos

source: To modify GNOME Videos preferences, click <menuchoice> <guimenu>Videos</guimenu><guimenu>Preferences</guimenu></menuchoice> in the Activities bar..
cs: Chcete-li upravit předvolby GNOME Videos, klikněte na <menuchoice> <guimenu>Videa</guimenu><guimenu>Předvolby</guimenu> </menuchoice> na panelu Činnosti.

source: General Preferences
cs: Obecné předvolby

source: The General Preferences let you select a network connection speed, specify if media files should be played from the last used position, and change the font and encoding used to display subtitles.
cs: Obecné předvolby umožňují vybrat rychlost síťového připojení, určit, zda se mají multimediální soubory přehrávat z poslední použité pozice, a měnit písmo a kódování používané k zobrazení titulků.

source: GNOME Videos General Preferences
cs: Obecné předvolby GNOME Videos

source: General Preferences include the following:
cs: Obecné preference obsahují:

source: Playback
cs: Přehrávání

source: Lets you specify whether to start playing the movie from the last position.
cs: Umožňuje určit, zda se má zahájit přehrávání filmu z poslední pozice.

source: Networking
cs: Síť

source: Select network connection speed from the Connection speed drop-down box.
cs: Z rozbalovací nabídky Rychlost připojení vyberte rychlost síťového připojení.

source: Text Subtitles
cs: Textové titulky

source: Lets you specify whether to load the subtitles automatically, and change the font and encoding used to display the subtitles.
cs: Umožňuje určit, zda se mají titulky načítat automaticky, a změnit písmo a kódování použité k zobrazení titulků.

source: Display Preferences
cs: Předvolby zobrazení

source: The Display Preferences let you choose to automatically resize the window when a new video is loaded, change the color balance, and configure visual effects when an audio file is played.
cs: Předvolby zobrazení vám umožní automaticky změnit velikost okna při načtení nového videa, změnit vyvážení barev a konfigurovat vizuální efekty při přehrávání zvukového souboru.

source: GNOME Videos Display Preferences
cs: Předvolby zobrazení GNOME Videos

source: Display Preferences include the following:
cs: Předvolby zobrazení obsahují:

source: Automatically resize the window when a new video is loaded
cs: Automaticky změnit velikost okna při načtení nového videa

source: Select this option if you want GNOME Videos to automatically resize the window when a new video is loaded.
cs: Tuto možnost vyberte, pokud chcete, aby GNOME Videos při načítání nového videa automaticky změnil velikost okna.

source: Disable the screen saver when playing video or audio
cs: Při přehrávání videa nebo zvuku deaktivujte spořič obrazovky

source: Select this option if you want GNOME Videos to automatically disable the desktop screen saver while an audio file is playing.
cs: Tuto možnost vyberte, chcete-li, aby GNOME Videos automaticky vypnul spořič obrazovky během přehrávání zvukového souboru.

source: Visual Effects
cs: Vizuální efekty

source: You can choose to show visual effects when an audio file is playing, select the type of visualization you want to show, and the visualization size.
cs: Při přehrávání zvukového souboru si můžete vybrat, zda chcete zobrazit vizuální efekty; když ano, zvolte typ a velikost vizualizace.

source: Color Balance
cs: Vyvážení barev

source: Specify the level of color brightness, contrast, saturation, and hue.
cs: Určete úroveň jasu, kontrastu, sytosti a odstínu barev.

source: Audio Preferences
cs: Předvolby zvuku

source: The Audio Preferences dialog lets you select the audio output type.
cs: Dialog Předvolby zvuku umožňuje vybrat typ zvukového výstupu.

source: GNOME Videos Audio Preferences
cs: Předvolby zvuku GNOME Videos
