Repository: openSUSE/doc-sle-translations
Catalog: */po/apps_ekiga.*.po
Languages: cs

# _
source: translator-credits
cs: překladatelské kredity alkas alkas@volny.cz, 2016, 2020

source: Ekiga: Using Voice over IP
cs: Ekiga: Použití Voice over IP

source: Ekiga is an application you can use for making phone calls via Voice over IP (VoIP), for video conferencing and for instant messaging.
cs: Ekiga je aplikace používaná k telefonování cestou Voice over IP (hlas přes IP, VoIP) pro videokonference a rychlé zasílání zpráv.

source: yes
cs: ano

source: Ekiga May Not Be Installed
cs: Ekiga nemusí být nainstalována

source: Before proceeding, make sure that the package <package>ekiga</package> is installed.
cs: Před pokračováním se ujistěte, že je nainstalován balíček <package>ekiga</package>.

source: Before starting, make sure that the following requirements are met:
cs: Před spuštěním se ujistěte, že jsou splněny tyto požadavky:

source: Your sound card is properly configured.
cs: Je správně zkonfigurována Vaše zvuková karta.

source: A headset or a microphone and speakers are connected to your computer.
cs: K počítači jsou připojena sluchátka s mikrofonem (headset) nebo mikrofon a reproduktory.

source: For dialing in to regular phone networks, a SIP account is required. SIP (<emphasis>Signaling protocol for Internet Telephony</emphasis>) is the protocol used to establish sessions for audio and video conferencing or call forwarding.
cs: Pro vytáčení do běžných telefonních sítí je nutný účet SIP. SIP (<emphasis>SIgnaling Protocol for Internet Telephony</emphasis>) je protokol používaný k vytvoření relací pro audio- a videokonference nebo přesměrování hovorů.

source: There are many VoIP providers all over the world. One provider is the Ekiga project itself, go to <link xlink:href="https://ekiga.im"/> to learn more.
cs: Existuje mnoho poskytovatelů VoIP po celém světě. Jedním z poskytovatelů je samotný projekt Ekiga. Další informace naleznete na <link xlink:href="https://ekiga.im"/>.

source: For video conferencing: A Web cam is connected to your computer.
cs: Pro videokonference: K Vašemu počítači je připojena webová kamera.

source: Starting Ekiga
cs: Ekiga - spuštění

source: To start Ekiga, open the Activities Overview by pressing <keycap function="meta"/> and search for <literal>ekiga</literal>.
cs: Chcete-li spustit Ekigu, otevřete Přehled činností stisknutím <keycap function="meta"/> a vyhledejte <literal>ekiga</literal>.

source: Configuring Ekiga
cs: Ekiga - konfigurace

source: On first start, Ekiga opens a configuration assistant that requests all data needed to configure Ekiga. Proceed as follows:
cs: Při prvním spuštění otevře Ekiga asistenta, který si vyžádá všechny údaje potřebné pro konfiguraci Ekigy. Postupujte takto:

source: Click <guimenu>Forward</guimenu>.
cs: Klikněte <guimenu>Další</guimenu>.

source: Enter your full name (name and surname). Click <guimenu>Forward</guimenu>.
cs: Zadejte své celé jméno (jméno a příjmení). Klikněte <guimenu>Další</guimenu>.

source: Enter your <literal>ekiga.net</literal> account data or choose not to register with <link xlink:href="http://www.ekiga.net"/>. Click <guimenu>Forward</guimenu>.
cs: Zadejte data svého účtu <literal>ekiga.net</literal> nebo zvolte neregistrovat se na <link xlink: href="http://www.ekiga.net"/>. Klikněte <guimenu>Další</guimenu>.

source: Enter your Ekiga Call Out Account data or choose not to register with <link xlink:href="http://www.ekiga.net"/>. Click <guimenu>Forward</guimenu>.
cs: Zadejte data svého účtu Ekiga Call Out nebo se rozhodněte, že se nezaregistrujete na <link xlink:href="http://www.ekiga.net"/>. Klikněte <guimenu>Další</guimenu>.

source: Set your connection type and speed. Click <guimenu>Forward</guimenu>.
cs: Nastavte typ a rychlost připojení. Klikněte <guimenu>Další</guimenu>.

source: Configure the audio devices to use by choosing the audio ringing, output and input device driver. In general, you can keep the <guimenu>Default</guimenu> setting. Click <guimenu>Forward</guimenu>.
cs: Nakonfigurujte zvuková zařízení, která mají být použita, výběrem zvukového vyzvánění, výstupu a ovladače vstupního zařízení. Obecně si můžete ponechat <guimenu>Výchozí</guimenu> nastavení. Klikněte <guimenu>Další</guimenu>.

source: Choose a video input device, if available. Click <guimenu>Forward</guimenu>.
cs: Vyberte vstupní video zařízení, pokud je k dispozici. Klikněte <guimenu>Další</guimenu>.

source: Check the summary of your settings and apply them.
cs: Zkontrolujte souhrn nastavení a použijte je.

source: If registration fails after making changes to your configuration, restart Ekiga.
cs: Pokud se registrace po provedení změn ve vaší konfiguraci nezdaří, restartujte Ekigu.

source: Ekiga allows you to maintain multiple accounts. To configure an additional account, proceed as follows:
cs: Ekiga vám umožňuje spravovat více účtů. Chcete-li nakonfigurovat další účet, postupujte takto:

source: Open <menuchoice> <guimenu>Edit</guimenu> <guimenu>Accounts</guimenu></menuchoice>.
cs: Otevřete <menuchoice> <guimenu>Úpravy</guimenu> - <guimenu>Účty</guimenu></menuchoice>.

source: Choose <menuchoice><guimenu>Accounts</guimenu> <guimenu>Add &lt;account type&gt;</guimenu></menuchoice>. If you are unsure, select <guimenu>Add a SIP Account</guimenu>.
cs: Vyberte <menuchoice><guimenu>Účty</guimenu> <guimenu>Přidat &lt;účet typu&gt;</guimenu></menuchoice>. Jste-li na pochybách, zvolte <guimenu>Přidat účet SIP</guimenu>.

source: Enter the <guimenu>Registrar</guimenu> to which you have registered. This is usually an IP address or a host name that will be given to you by your Internet Telephony Service Provider. Enter <guimenu>User</guimenu>, and <guimenu>Password</guimenu> according to the data provided by your provider.
cs: Zvolte <guimenu>Registrátor</guimenu>, kam jste se registrovali. Je to obvykle IP adresa nebo název počítače, který Vám sdělí Váš poskytovatel služby internetové telefonie (Internet Telephony Service Provider). Zadejte <guimenu>uživatele</guimenu> a <guimenu>heslo</guimenu> dle údajů, které jste od něj dostali.

source: Make sure <guimenu>Enable account</guimenu> is activated and leave the configuration dialog with <guimenu>OK</guimenu>. The account is displayed in the Ekiga main window, including its <guimenu>Status</guimenu>, which should change to <literal>Registered</literal>.
cs: Pomocí <guimenu>Aktivovat účet</guimenu> zajistěte, aby byl aktivován účet a ukončete konfigurační dialog tlačítkem <guimenu>OK</guimenu>. Účet je zobrazen v hlavním okně Ekiga, včetně jeho údaje <guimenu>Stav</guimenu>, který by se měl změnit na <literal>Registrován</literal>.

source: The Ekiga User Interface
cs: Ekiga - uživatelské rozhraní

source: The user interface has different modes. To switch between views, use the toolbar. The first mode is <guimenu>Contacts</guimenu>, the second is <guimenu>Dialpad</guimenu> and the last one is <guimenu>Call History</guimenu>. Click the camera icon to open the <guimenu>Call Window</guimenu>. It displays images from your local Web cam (or from a remote Web cam during a call).
cs: Uživatelské rozhraní má různé režimy. Chcete-li mezi nimi přepínat, použijte panel nástrojů. První režim je <guimenu>Kontakty</guimenu>, druhý je <guimenu>Číselník</guimenu> a poslední režim je <guimenu>Historie hovorů</guimenu>. Kliknutím na ikonu kamery otevřete <guimenu>Okno volání</guimenu>. Zobrazuje obrázky z místní webové kamery (nebo ze vzdálené webové kamery během hovoru).

source: Ekiga User Interface
cs: Ekiga - uživatelské rozhraní

source: By default, Ekiga opens in the <guimenu>Contacts</guimenu> mode. This view shows you a local address book which lets you quickly open connections to often-used numbers.
cs: Ve výchozím nastavení se Ekiga otevře v režimu <guimenu>Kontakty</guimenu>. Toto zobrazení vám ukáže místní adresář, který vám umožní rychle otevřít spojení k často používaným číslům.

source: Many of the functions of Ekiga are available with key combinations. <xref linkend="tab.ekiga.shortcut"/> summarizes the most important ones.
cs: Mnoha funkcím Ekigy je přiřazena kombinace kláves. <xref linkend="tab.ekiga.shortcut"/> uvádí nejdůležitější z nich.

source: Key Combinations for Ekiga
cs: Klávesové kombinace pro Ekigu

source: Key Combination
cs: Klávesová kombinace

source: Description
cs: Popis

source: Initiate a call with the current number.
cs: Zahájí hovor s aktuálním číslem.

source: Hang up.
cs: Zavěsí.

source: Add a contact to your address book.
cs: Přidá kontakt do Vašeho adresáře.

source: Open the <guimenu>Address Book</guimenu> dialog.
cs: Otevře dialog <guimenu>Adresář</guimenu>.

source: Hold the current call.
cs: Přidrží probíhající hovor.

source: Transfer the current call to another party.
cs: Převede aktuální hovor na jiného účastníka.

source: Suspend the audio stream of the current call.
cs: Pozastaví zvukový proud aktuálního hovoru.

source: Suspend the video stream of the current call.
cs: Pozastaví tok videa aktuálního hovoru.

source: Close the Ekiga user interface.
cs: Uzavře uživatelské rozhraní Ekigy.

source: Quit Ekiga.
cs: Ukončí Ekigu.

source: Start the account manager.
cs: Spustí Správce účtů.

source: Activate <guimenu>Call Panel</guimenu> on the main user interface.
cs: Aktivuje<guimenu>Panel volání</guimenu> v hlavním uživatelském rozhraní.

source: Zoom in to the picture from the Web cam.
cs: Zvětší/přiblíží obraz webové kamery.

source: Zoom out on the picture from the Web cam.
cs: Zmenší/oddálí obraz webové kamery.

source: Return to the normal size of the Web cam display.
cs: Vrátí normální velikost obrazu webové kamery.

source: Use full screen for the Web cam.
cs: Celá obrazovka pro webovou kameru.

source: Making a Call
cs: Zavolat

source: After Ekiga is properly configured, making a call is easy.
cs: Je-li Ekiga správně konfigurována, zavolat je snadné.

source: Switch to the <guimenu>Dialpad</guimenu> mode.
cs: Přepnout do režimu <guimenu>Číselnice</guimenu>.

source: Enter the SIP address of the party to call at the bottom of the window. The address should look like:
cs: Ve spodní části okna zadejte SIP adresu účastníka, kterého chcete volat. Adresa by měla vypadat takto:

source: for direct local calls: <literal>sip:username@domainname</literal> or <literal>username@hostname</literal>
cs: pro přímé místní hovory: <literal>sip:username@domainname</literal> nebo <literal>username@hostname</literal>

source: <literal>sip:username@domainname</literal> or <literal>userid@sipserver</literal>
cs: <literal>sip:username@domainname</literal> nebo <literal>userid@sipserver</literal>

source: Click <guimenu>Call</guimenu> or press <keycombo><keycap function="control"/><keycap>O</keycap></keycombo> and wait for the other party to pick up the phone.
cs: Klikněte <guimenu>Volat</guimenu> nebo stiskněte <keycombo><keycap function="control"/><keycap>O</keycap></keycombo> a počkejte, až volaný přijme hovor.

source: To end the call, click <guimenu>Hang up</guimenu> or press <keycap function="escape"/>.
cs: Hovor ukončíte kliuknutím <guimenu>Zavěsit</guimenu> nebo stisknutím <keycap function="escape"/>.

source: If you need to tweak the sound parameters, click <menuchoice><guimenu>Edit</guimenu><guimenu>Preferences</guimenu> </menuchoice>.
cs: Potřebujete-li vylepšit zvukové parametry, klikněte na <menuchoice><guimenu>Upravit</guimenu><guimenu>Preference</guimenu> </menuchoice>.

source: Answering a Call
cs: Přijmout hovor

source: Ekiga can receive calls in two different ways. First, it can be called directly with <literal>sip:user@host</literal>, or via SIP provider. Most SIP providers enable you to receive calls from a normal land-line to your VoIP account. Depending on the mode in which you use Ekiga, there are several ways in which you are alerted to an incoming call:
cs: Ekiga může přijímat hovory dvěma různými způsoby. Lze ji volat přímo pomocí <literal>sip:user@host</literal>, nebo prostřednictvím poskytovatele SIP. Většina poskytovatelů SIP umožňuje přijímat hovory z normální pevné linky na Váš účet VoIP. V závislosti na režimu, ve kterém používáte službu Ekiga, existuje několik způsobů, jak Vás upozorní na příchozí hovor:

source: Normal Application
cs: Normální aplikace

source: Incoming calls can only be received and answered if Ekiga is already started. You can hear the ring sound on your headset or your speakers. If Ekiga is not started, the call cannot be received.
cs: Příchozí hovory lze přijímat a přijímat, pouze pokud je již spuštěna Ekiga. Zvuk vyzvánění můžete slyšet v náhlavní soupravě nebo z reproduktorů. Pokud Ekiga neběží, nelze hovor přijmout.

source: Panel Applet
cs: Aplet Panel

source: Normally, the Ekiga panel applet runs silently without giving any notice of its existence. This changes when a call comes in. The main window of Ekiga opens and you hear a ringing sound on your headset or speakers.
cs: Za normálních okolností aplet panelu Ekiga běží tiše, tj. nevidíte známky jeho existence, dokud nepřijde hovor. Otevře se hlavní okno Ekigy a v náhlavní soupravě nebo reproduktorech uslyšíte vyzváněcí zvuk.

source: Once you have noticed an incoming call, click <guimenu>Accept</guimenu> to answer the call then start talking. If you do not want to accept this call, click <guimenu>Reject</guimenu>. It is also possible to transfer the call to another SIP address.
cs: Jakmile si všimnete příchozího hovoru, klikněte na <guimenu>Přijmout</guimenu> a přijměte hovor, poté začněte mluvit. Pokud tento hovor nechcete přijmout, klikněte na <guimenu>Odmítnout</guimenu>. Je také možné přesměrovat hovor na jinou adresu SIP.

source: Using the Address Book
cs: Používání adresáře

source: Ekiga can manage your SIP contacts. All of the contacts are displayed in the <guimenu>Contacts</guimenu> tab, shown in the main window after start-up. To add a contact or a new contact group, select <menuchoice><guimenu>Chat</guimenu><guimenu>Add Contact</guimenu></menuchoice>.
cs: Ekiga může spravovat Vaše kontakty SIP. Všechny kontakty jsou zobrazeny na kartě <guimenu>Kontakty</guimenu>, kterou vidíte v hlavním okně po spuštění. Nový kontakt nebo kontaktní skupinu přidáte pomocí menu <menuchoice><guimenu>Chat</guimenu> - <guimenu>Přidat kontakt</guimenu></menuchoice>.

source: If you want to add a new group, enter the group name into the bottom text box and click <guimenu>Add</guimenu>. The new group is then added to the group list and preselected.
cs: Pokud chcete přidat novou skupinu, zadejte název skupiny do spodního textového pole a klikněte na <guimenu>Přidat</guimenu>. Nová skupina je poté přidána do seznamu skupin a předvolena.

source: The following entries are required for a valid contact:
cs: Pro platný nový kontakt zadejte následující údaje:

source: Name
cs: Jméno

source: Enter the name of your contact. This may be a full name, but you can also use a nickname here.
cs: Zadejte jméno kontaktu. Může to být celé jméno osoby, ale také přezdívka.

source: Address
cs: Adresa

source: Enter a valid SIP address for your contact.
cs: Zadejte platnou adresu SIP Vašeho kontaktu.

source: Groups
cs: Skupiny

source: If you have many contacts, add your own groups.
cs: Máte-li mnoho kontaktů, přidejte si vlastní skupiny.

source: To call a contact from the address book, double-click the contact. The call is initiated immediately.
cs: Chcete-li volat kontakt z adresáře, poklepejte na kontakt. Hovor je zahájen okamžitě.

source: For More Information
cs: Další informace

source: The official home page of Ekiga is <link xlink:href="http://www.ekiga.org/"/>. This site offers answers to frequently asked questions and more detailed documentation.
cs: Oficiální domovská stránka Ekigy: <link xlink:href="http://www.ekiga.org/"/>. Tento web nabízí podrobnější dokumentaci a odpovědi na často kladené otázky.

source: For information about the support of the <literal>H323</literal> teleconferencing protocol in Linux, see <link xlink:href="http://www.voip-info.org/wiki/view/H.323"/>. This is also a good starting point when searching for projects supporting VoIP.
cs: Informace o podpoře telekonferenčního protokolu <literal>H323</literal> v systému Linux viz <link xlink: href="http://www.voip-info.org/wiki/view/H.323"/>. To je také dobrý výchozí bod při hledání projektů podporujících VoIP.

source: To set up a private telephone network, you might be interested in the <literal>PBX</literal> software Asterisk <link xlink:href="http://www.asterisk.org/"/>. Find information about it at <link xlink:href="http://www.voip-info.org/wiki-Asterisk"/>.
cs: Chcete-li založit soukromou telefonní síť, možná vás bude zajímat software <literal>PBX</literal>Asterisk<link xlink:href="http://www.asterisk.org/"/>. Informace o něm naleznete na <link xlink:href="http://www.voip-info.org/wiki-Asterisk"/>.
