Repository: openSUSE/doc-sle-translations
Catalog: */po/apps_firefox.*.po
Languages: cs, de

# _
source: translator-credits
cs: překladatelské kredity alkas alkas@volny.cz, 2016, 2020
de: Übersetzer-Credits

source: Firefox: Browsing the Web
cs: Firefox: prohlížení webu (ver=79.0 (x64) z 20200801 jak Linux tak Windows, přesto se liší; zde je popsána verze pro openSUSE Linux)
de: Firefox: Surfen im Internet

source: The Mozilla Firefox Web browser is included with <phrase role="productname"><phrase os="osuse">openSUSE® Leap</phrase><phrase os="sles">SUSE® Linux Enterprise Server</phrase><phrase os="sled">SUSE® Linux Enterprise Desktop</phrase></phrase>. With features like tabbed browsing, pop-up window blocking and download management, Firefox combines the latest browsing and security technologies with an easy-to-use interface. Firefox gives you easy access to different search engines to help you find the information you need.
cs: Webový prohlížeč Firefox je součástí <phrase role="productname"><phrase os="osuse">openSUSE® Leap</phrase><phrase os="sles">SUSE® Linux Enterprise Server</phrase><phrase os="sled">SUSE® Linux Enterprise Desktop</phrase></phrase>. Díky funkcím, jako je procházení v záložkách, blokování vyskakovacích oken a správa stahování, kombinuje Firefox nejnovější technologie prohlížení a zabezpečení se snadno použitelným rozhraním. Firefox vám poskytuje snadný přístup k různým vyhledávacím nástrojům, které vám pomohou najít potřebné informace.
de: Der Mozilla Firefox-Webbrowser ist in <phrase role="Produktname"> <phrase os="Osuse"> OpenSUSE® Leap </phrase> <phrase os="sles"> SUSE® Linux Enterprise Server </phrase> <phrase os="sled"> SUSE® Linux Enterprise Desktop </phrase> </phrase>. Mit Funktionen wie Browsen mit Registerkarten, Blockieren von Popup-Fenstern und Download-Management kombiniert Firefox die neuesten Browsing- und Sicherheitstechnologien mit einer benutzerfreundlichen Oberfläche. Mit Firefox haben Sie einfachen Zugriff auf verschiedene Suchmaschinen, um die benötigten Informationen zu finden.

source: yes
cs: ano
de: Ja

source: Starting Firefox
cs: Spouštění Firefoxu
de: Firefox starten

source: To start Firefox, open the Activities Overview by pressing <keycap function="meta"/> and search for <literal>fire</literal>.
cs: Chcete-li spustit Firefox, otevřete Přehled aktivit stisknutím <keycap function="meta"/> a vyhledejte <literal>fire</literal>.
de: Um Firefox zu starten, öffnen Sie die Aktivitätenübersicht, indem Sie <keycap function="meta"/> drücken und nach <literal> fire </literal> suchen.

source: Navigating Web Sites
cs: Navigace po webech
de: Navigieren auf Webseiten

source: The look and feel of Firefox is similar to that of other browsers. It is shown in <xref linkend="fig.firefox.main"/>. At the top of the window you find the location bar for a Web address, and the search bar. Bookmarks are also available for quick access from the bookmarks toolbar. For more information about the various Firefox features, use the <guimenu>Help</guimenu> menu in the menu bar.
cs: Vzhled Firefoxu je podobný vzhledu jiných prohlížečů. Je zobrazen v <xref linkend="fig.firefox.main"/>. V horní části okna najdete lištu pro webovou adresu a lištu vyhledávání. Jsou také k dispozici záložky pro rychlý přístup z lišty nástrojů záložek. Další informace o různých funkcích Firefoxu najdete v menu <guimenu>Nápověda</guimenu> na liště/panelu nabídek.
de: Das Erscheinungsbild von Firefox ähnelt dem anderer Browser. Es wird in <xref linkend="fig.firefox.main"/> angezeigt. Oben im Fenster finden Sie die Positionsleiste für eine Webadresse und die Suchleiste. Lesezeichen sind auch für den schnellen Zugriff über die Lesezeichen-Symbolleiste verfügbar. Weitere Informationen zu den verschiedenen Firefox-Funktionen finden Sie im Menü <guimenu> Hilfe </guimenu> in der Menüleiste.

source: Using the Menu Bar
cs: Použití lišty nabídek
de: Verwenden der Menüleiste

source: While most functions of Firefox are available through the three-lines button (<inlinemediaobject><textobject role="description"><phrase>Three-lines button</phrase></textobject><imageobject role="fo"><imagedata fileref="hamburger_button.svg" width="0.8em" format="SVG"/></imageobject><imageobject role="html"><imagedata fileref="hamburger_button-fallback.png" width="1em" format="PNG"/></imageobject></inlinemediaobject>), some are only available from the menu bar.
cs: Většina funkcí Firefoxu je k dispozici prostřednictvím tlačítka se třemi řádky ("hamburger" - vpravo nahoře, <inlinemediaobject><textobject role="description"><phrase>Tlačítko se třemi řádky</phrase></textobject><imageobject role="fo"><imagedata fileref="hamburger_button.svg" width="0.8em" format="SVG"/></imageobject><imageobject role="html"><imagedata fileref="hamburger_button-fallback.png" width="1em" format="PNG"/></imageobject></inlinemediaobject>), některé jsou k dispozici pouze z hlavního menu.
de: Während die meisten Funktionen von Firefox verfügbar sind über die dreizeilige Schaltfläche (<inlinemediaobject> <textobject role="description"> <phrase> Dreizeilige Schaltfläche </phrase> </textobject> <imageobject role="fo"> <imagedata fileref="hamburger_button.svg" width = "0.8em" format = "SVG"/> </imageobject> <imageobject role="html"> <imagedata fileref="hamburger_button-fallback.png" width = "1em" format="PNG"/> </imageobject> </inlinemediaobject>), einige sind nur über die Menüleiste verfügbar.

source: The menu bar of Firefox is hidden by default. To temporarily show it, press <keycap function="alt"/>. It will then be displayed until you click elsewhere in the Firefox window.
cs: Lišta nabídek Firefoxu je ve výchozím nastavení skrytá. Chcete-li ji dočasně zobrazit, stiskněte <keycap function="alt"/>. Poté se lišta zobrazí, dokud nekliknete na jiné místo v okně Firefoxu.
de: Die Menüleiste von Firefox ist standardmäßig ausgeblendet. Um es vorübergehend anzuzeigen, drücken Sie <keycap function="alt"/>. Es wird dann angezeigt, bis Sie im Firefox-Fenster auf eine andere Stelle klicken.

source: To permanently enable the Firefox menu bar, first press <keycap function="alt"/>, then choose <menuchoice><guimenu>View</guimenu><guimenu>Toolbars</guimenu></menuchoice> and activate <guimenu>Menu Bar</guimenu>.
cs: Chcete-li trvale zobrazit lištu nabídek Firefox, nejprve stiskněte <keycap function="alt"/>, poté zvolte <menuchoice><guimenu>Zobrazit</guimenu><guimenu>Nástrojové lišty</guimenu></menuchoice> a aktivujte položku <guimenu>Hlavní nabídka</guimenu>.
de: Um die Firefox-Menüleiste dauerhaft zu aktivieren, drücken Sie zuerst <keycap function="alt"/>, wählen Sie dann <menuchoice> <guimenu>Ansicht</guimenu> <guimenu>Symbolleisten</guimenu> </menuchoice> und aktivieren Sie <guimenu>Menüleiste</guimenu>.

source: The Browser Window of Firefox
cs: Okno prohlížeče Firefox
de: Das Browserfenster von Firefox

source: The Location Bar
cs: Lišta umístění

source: When typing into the location bar, an auto-completion drop-down box opens. It shows all previous location addresses and bookmarks containing the characters you type. The matching phrase is highlighted in bold. Entries visited most frequently and recently are listed first.
cs: Při psaní na panelu umístění se otevře rozbalovací nabídka automatického dokončení. Zobrazuje všechny předchozí adresy a záložky, které obsahují zadané znaky. Odpovídající fráze je zvýrazněna tučně. Nejnavštěvovanější a naposledy zobrazené položky jsou uvedeny jako první.
de: Wenn Sie in die Positionsleiste tippen, öffnet sich ein Drop-Down-Feld zur automatischen Vervollständigung. Es zeigt alle früheren Standortadressen und Lesezeichen an, die die von Ihnen eingegebenen Zeichen enthalten. Der übereinstimmende Satz ist fett hervorgehoben. Die am häufigsten und in letzter Zeit besuchten Einträge werden zuerst aufgeführt.

source: List entries from the bookmark list are marked with a star. Bookmarks with tags are marked with an additional label followed by the tag names. List entries from the browsing history are not marked. To search in your bookmarks only, type <keycap>*</keycap> as the first character of your search.
cs: Položky seznamu ze seznamu záložek jsou označeny hvězdičkou (modrou, v ikoně). Záložky se značkami jsou označeny dalším štítkem následovaným názvy značek. Položky seznamu z historie procházení nejsou označeny. Chcete-li hledat pouze ve svých záložkách, zadejte jako první znak hledání <keycap>*</keycap>.
de: Listeneinträge aus der Lesezeichenliste sind mit einem Stern gekennzeichnet. Lesezeichen mit Tags werden mit einem zusätzlichen Label, gefolgt von den Namen der Tags, gekennzeichnet. Listeneinträge aus der Browsing-Geschichte werden nicht markiert. Um nur in Ihren Lesezeichen zu suchen, geben Sie <keycap>*</keycap> als erstes Zeichen Ihrer Suche ein.

source: Use <keycap function="up"/> and <keycap function="down"/> or the mouse wheel to navigate the list. Press <keycap function="enter"/> or click an entry to go to the selected page. <keycap function="delete"/> removes an entry from the list if it is an entry from the history. Bookmarked entries can only be removed by deleting the associated bookmark.
cs: K procházení seznamem použijte <keycap function="up"/> a <keycap function="down"/> nebo kolečko myši. Stisknutím klávesy <keycap function="enter"/> nebo kliknutím na položku přejdete na vybranou stránku. <keycap function="delete"/> odebere záznam ze seznamu (pouze záznam z historie; záznam ze záložky lze odstranit pouze odstraněním příslušné záložky).
de: Verwenden Sie <keycap function="up"/> und <keycap function="down"/> oder das Mausrad, um in der Liste zu navigieren. Drücken Sie <keycap function="enter"/> oder klicken Sie auf einen Eintrag, um zur ausgewählten Seite zu gelangen. <keycap function="delete"/> entfernt einen Eintrag aus der Liste, wenn es sich um einen Eintrag aus der Historie handelt. Mit Lesezeichen versehene Einträge können nur durch Löschen des zugehörigen Lesezeichens entfernt werden.

source: Zooming
cs: Změny velikosti (zoom)
de: Zoomen

source: Firefox offers two zooming options: page zoom, the default, and text zoom. Page zoom enlarges the entire page as is, with all elements of a page, including graphics, expanding equally while text zoom only changes the text size.
cs: Firefox nabízí dvě možnosti přiblížení: přiblížení stránky (výchozí) a přiblížení textu. Zvětšení stránky zvětšuje celou stránku tak, že se všechny prvky stránky, včetně grafiky, rovnoměrně zvětšují/zmenšují, zatímco zvětšení textu mění pouze velikost písma.
de: Firefox bietet zwei Zoom-Optionen: Seitenzoom, den Standard- und den Textzoom. Der Seitenzoom vergrößert die gesamte Seite so, wie sie ist, wobei alle Elemente einer Seite, einschließlich Grafiken, gleichmäßig vergrößert werden, während der Textzoom nur die Textgröße ändert.

source: To toggle between page and text zoom, from the menu bar, choose <menuchoice> <guimenu>View</guimenu> <guimenu>Zoom</guimenu> <guimenu>Zoom Text Only</guimenu></menuchoice>. To zoom in or out either use the mouse wheel while holding the <keycap function="control"/> key, or use <keycombo> <keycap function="control"/> <keycap>+</keycap> </keycombo> and <keycombo> <keycap function="control"/> <keycap>-</keycap></keycombo>. Reset the zoom factor with <keycombo> <keycap function="control"/> <keycap>0</keycap> </keycombo>.
cs: Chcete-li přepínat mezi přiblížením stránky a textu, zvolte v hlavní nabídce <menuchoice><guimenu>Zobrazení</guimenu> <guimenu>Velikost stránky</guimenu><guimenu>Pouze velikost textu</guimenu></menuchoice>. Pro přiblížení nebo oddálení použijte kolečko myši, zatímco držíte klávesu <keycap function="control"/>, nebo použijte <keycombo> <keycap function="control"/> <keycap>+</keycap> </keycombo> and <keycombo> <keycap function="control"/> <keycap>-</keycap></keycombo>. Vraťte velikost na 100% klávesami <keycombo> <keycap function="control"/> <keycap>0</keycap> </keycombo>.
de: Um zwischen Seiten- und Textzoom umzuschalten, wählen Sie in der Menüleiste <menuchoice> <guimenu>Ansicht</guimenu> <guimenu>Zoom</guimenu> <guimenu>Nur Text zoomen</guimenu></menuchoice>. Zum Vergrößern oder Verkleinern verwenden Sie entweder das Mausrad, während Sie die Taste <keycap function="control"/> gedrückt halten, oder Sie verwenden <keycombo> <keycap function="control"/> <keycap>+</keycap> </keycombo> und <keycombo> <keycap function="control"/> <keycap>-</keycap></keycombo>. Setzen Sie den Zoomfaktor mit <keycombo> <keycap function="control"/> <keycap>0</keycap> </keycombo> zurück.

source: Tabbed Browsing
cs: Prohlížení v záložkách

source: Tabbed browsing allows you to load multiple Web sites in a single window. To switch between pages in use, use the tabs at the top of the window. If you often use more than one Web page at a time, tabbed browsing makes it easier to switch between pages.
cs: Prohlížení v záložkách umožňuje načíst více webů v jednom okně. Chcete-li přepínat mezi používanými stránkami, použijte karty v horní části okna. Pokud často používáte více než jednu webovou stránku najednou, procházení mezi kartami usnadňuje přepínání mezi stránkami.
de: Beim Tabbed-Browsing können Sie mehrere Websites in einem einzigen Fenster laden. Um zwischen den verwendeten Seiten zu wechseln, verwenden Sie die Tabs am oberen Rand des Fensters. Wenn Sie häufig mehr als eine Webseite gleichzeitig verwenden, erleichtert das Tabbed-Browsing den Wechsel zwischen den Seiten.

source: Opening Tabs
cs: Otevírání záložek
de: Öffnen von Tabs

source: To open a new tab, from the menu bar, select <menuchoice> <guimenu>File</guimenu><guimenu>New Tab</guimenu> </menuchoice> or press <keycombo> <keycap function="control"/> <keycap>T</keycap> </keycombo>. This opens an empty tab in the Firefox window. To open a link on a Web page or a bookmark in a tab, middle-click it. Alternatively, right-click a link and select <guimenu>Open Link in New Tab</guimenu>. You may also open an address in the location bar in a new tab with a middle-click or by pressing <keycombo> <keycap function="control"/> <keycap function="enter"/> </keycombo>.
cs: Chcete-li otevřít novou kartu, na liště nabídek vyberte možnost <menuchoice> <guimenu>Soubor</guimenu><guimenu>Nový panel</guimenu> </menuchoice> nebo stiskněte <keycombo> <keycap function="control"/> <keycap>T</keycap> </keycombo>. Otevře se prázdná karta (panel) v okně Firefoxu. Chcete-li otevřít odkaz na webové stránce nebo záložku na kartě, klikněte na ni prostředním tlačítkem myši. Případně klepněte pravým tlačítkem myši na odkaz a vyberte <guimenu>Otevřít odkaz v novém panelu</guimenu>. Adresu můžete také otevřít na panelu umístění na nové kartě kliknutím prostředního tlačítka myši nebo stisknutím <keycombo> <keycap function="control"/> <keycap function="enter"/> </keycombo>.
de: Um einen neuen Tab zu öffnen, wählen Sie in der Menüleiste <menuchoice> <guimenu>Datei</guimenu><guimenu>Neuer Tab</guimenu> </menuchoice> oder drücken Sie <keycombo> <keycap function="control"/> <keycap>T</keycap> </keycombo>. Dies öffnet einen leeren Tab im Firefox-Fenster. Um einen Link auf einer Webseite oder ein Lesezeichen in einem Tab zu öffnen, klicken Sie mit der mittleren Maustaste darauf. Alternativ klicken Sie mit der rechten Maustaste auf einen Link und wählen Sie <guimenu>Link in neuem Tab öffnen</guimenu>. Sie können auch eine Adresse in der Adressleiste in einem neuen Tab mit einem Mittelklick oder durch Drücken von <keycombo> <keycap function="control"/> <keycap function="enter"/> </keycombo> in einem neuen Tab öffnen.

source: Closing Tabs
cs: Zavírání panelů
de: Schließen von Tabs

source: Right-click a tab to open a context menu, giving you access to tab managing options such as closing, reloading, or bookmarking. To close a tab, you may also use <keycombo> <keycap function="control"/> <keycap>W</keycap> </keycombo> or click the close button. Any closed tab can be restored by choosing from the menu bar, <menuchoice> <guimenu>History</guimenu> <guimenu>Recently Closed Tabs</guimenu> </menuchoice>. To reopen the last closed tab, either choose <guimenu>Undo Close Tab</guimenu> from the context menu or press <keycombo> <keycap function="control"/> <keycap function="shift"/> <keycap>T</keycap></keycombo>.
cs: Klepnutím pravým tlačítkem na záložku karty otevřete kontextovou nabídku, která vám umožní přístup k možnostem správy karet, jako je uzavření, opětovné načtení nebo práce se záložkou. Chcete-li kartu zavřít, můžete také použít <keycombo> <keycap function="control"/> <keycap>W</keycap> </keycombo> nebo kliknout na tlačítko Zavřít. Libovolnou uzavřenou kartu lze obnovit výběrem z panelu nabídek <menuchoice> <guimenu>Historie</guimenu> <guimenu>Nedávno uzavřené karty</guimenu> </menuchoice>. Chcete-li znovu otevřít poslední uzavřenou kartu, vyberte z kontextové nabídky <guimenu>Obnovit zavřený panel</guimenu> nebo stiskněte <keycombo> <keycap function="control"/> <keycap function="shift"/> <keycap>T</keycap> </keycombo>.
de: Klicken Sie mit der rechten Maustaste auf einen Tab, um ein Kontextmenü zu öffnen, das Ihnen Zugriff auf Optionen zur Tab-Verwaltung wie Schließen, Neuladen oder Lesezeichen bietet. Um ein Register zu schließen, können Sie auch <keycombo> <keycap function="control"/> <keycap>W</keycap> </keycombo> verwenden oder auf die Schaltfläche Schließen klicken. Jeder geschlossene Tab kann wiederhergestellt werden, indem Sie in der Menüleiste <menuchoice> <guimenu> <guimenu>Chronik</guimenu> <guimenu>Kürzlich geschlossene Tabs</guimenu> </menuchoice> wählen. Um den letzten geschlossenen Tab wieder zu öffnen, wählen Sie entweder <guimenu>Alle Tabs wiederherstellen</guimenu> aus dem Kontextmenü oder drücken Sie <keycombo> <keycap function="control"/> <keycap function="shift"/> <keycap>T</keycap></keycombo>.

source: Sorting Tabs
cs: Seřazení panelů
de: Sortieren von Tabs

source: By default, tabs are sorted in the order you opened them. Rearrange the tab order by dragging and dropping a tab to the desired position. If you have opened a large number of tabs, they cannot all be displayed in the tab bar at the same time. Use the arrows at the ends of the bar to move left or right-click the down arrow at the right end of the tab bar to get a list of all tabs.
cs: Ve výchozím nastavení jsou panely seřazeny v pořadí, v jakém jste je otevřeli. Uspořádejte pořadí panelů přetažením záložky panelu do požadované polohy. Pokud jste otevřeli velký počet panelů, nelze všechny jejich záložky zobrazit na liště panelů současně. Pomocí šipek na koncích lišty se pohybujte doleva nebo doprava - klikněte šipku dolů na pravém konci lišty panelů, abyste získali seznam všech panelů.
de: Standardmäßig werden die Tabs in der Reihenfolge sortiert, in der Sie sie geöffnet haben. Ordnen Sie die Tab-Reihenfolge neu an, indem Sie einen Tab per Drag & Drop an die gewünschte Position ziehen. Wenn Sie eine große Anzahl von Tabs geöffnet haben, können nicht alle gleichzeitig in der Tab-Leiste angezeigt werden. Verwenden Sie die Pfeile an den Enden der Leiste, um nach links zu gehen, oder klicken Sie mit der rechten Maustaste auf den Abwärtspfeil am rechten Ende der Tab-Leiste, um eine Liste aller Tabs zu erhalten.

source: Dragging and Dropping
cs: Drag a Drop (přetažení a položení)
de: Ziehen und Ablegen

source: Drag and drop also works with tabs. Drag a link onto an existing tab to open it in that tab or drag and drop a link on an empty space in the tab bar to open a new tab. Drag and drop a tab outside of the tab bar to open it in a new browser window.
cs: Drag and drop funguje také s kartami. Přetažením odkazu na existující kartu jej otevřete na této kartě nebo přetažením odkazu na prázdné místo na panelu karet otevřete novou kartu. Přetáhněte kartu mimo panel karet a otevřete ji v novém okně prohlížeče.
de: Drag und Drop funktioniert auch mit Tabs. Ziehen Sie einen Link auf ein vorhandenen Tab, um ihn in diesem Register zu öffnen, oder ziehen Sie einen Link auf eine leere Stelle in der Registerleiste, um ein neuen Tab zu öffnen. Ziehen Sie einen Tab außerhalb der Tab-Leiste, um ihn in einem neuen Browserfenster zu öffnen.

source: Using the Sidebar
cs: Použití postranní lišty
de: Verwenden der Seitenleiste

source: Use the left side of your browser window for viewing bookmarks or browsing history. Extensions may add new ways to use the sidebar as well. To display the sidebar, from the menu bar, select <menuchoice> <guimenu>View</guimenu> <guimenu>Sidebar</guimenu> </menuchoice> and select the desired contents.
cs: K prohlížení záložek nebo historie procházení použijte levou stranu okna prohlížeče. Rozšíření mohou přidat nové způsoby použití postranního panelu. Chcete-li zobrazit postranní panel, na panelu nabídek vyberte <menuchoice> <guimenu>Zobrazit</guimenu> <guimenu>Postranní panel</guimenu> </menuchoice> a vyberte požadovaný obsah.
de: Verwenden Sie die linke Seite Ihres Browser-Fensters, um Lesezeichen anzuzeigen oder den Verlauf zu durchsuchen. Erweiterungen können auch neue Möglichkeiten zur Verwendung der Seitenleiste hinzufügen. Um die Seitenleiste anzuzeigen, wählen Sie in der Menüleiste <menuchoice> <guimenu>Ansicht</guimenu> <guimenu>Seitenleiste</guimenu> </menuchoice> und wählen Sie den gewünschten Inhalt aus.

source: Finding Information
cs: Hledání informací
de: Informationen finden

source: There are two ways to find information in Firefox: to search the Internet with a search engine, use the search bar. To search the page currently displayed, use the find bar.
cs: Ve Firefoxu lze najít informace dvěma způsoby: Chcete-li hledat na internetu pomocí vyhledávače, použijte vyhledávací lištu. Chcete-li prohledat aktuálně zobrazenou stránku, použijte prohledávací lištu.

source: Finding Information on the Web
cs: Nalezení informace na webu
de: Informationen im Internet finden

source: Firefox has a search bar that can access different engines like Google, Yahoo, or Amazon. For example, if you want to find information about SUSE using the current engine, click in the search bar, type <literal>SUSE</literal>, and press <keycap function="enter"/>. The results appear in your window.
cs: Firefox má vyhledávací lištu, která umožňuje přístup k různým vyhledávačům, jako je Google, Yahoo nebo Amazon. Chcete-li například najít informace o SUSE pomocí aktuálního vyhledávače, klikněte do vyhledávací lišty, zadejte <literal>SUSE</literal> a stiskněte <keycap function="enter"/>. Výsledky se zobrazí v okně.
de: Firefox hat eine Suchleiste, die auf verschiedene Suchmaschinen wie Google, Yahoo oder Amazon zugreifen kann. Wenn Sie beispielsweise Informationen über SUSE mit der aktuellen Engine finden möchten, klicken Sie in die Suchleiste, geben Sie <literal>SUSE</literal> ein und drücken Sie <keycap function="enter"/>. Die Ergebnisse erscheinen in Ihrem Fenster.

source: To choose a different search engine, type your search term, then click one of the search provider icons at the bottom of the appearing pop-up.
cs: Chcete-li zvolit jiný vyhledávač, zadejte hledaný výraz a poté klikněte na jednu z ikon vyhledávačů ve spodní části zobrazené rozbalovací nabídky.
de: Um eine andere Suchmaschine auszuwählen, geben Sie Ihren Suchbegriff ein und klicken Sie dann auf eines der Suchanbieter-Symbole am unteren Rand des erscheinenden Popup-Fensters.

source: Customizing the Search Bar
cs: Přizpůsobení vyhledávací lišty
de: Anpassen der Suchleiste

source: If you want to change the order, add, or delete a search engine, proceed as follows.
cs: Chcete-li změnit pořadí, přidat nebo odstranit vyhledávač, postupujte takto.
de: Wenn Sie die Reihenfolge ändern, eine Suchmaschine hinzufügen oder löschen möchten, gehen Sie wie folgt vor.

source: Click the icon to the left of the search bar.
cs: Klikněte na ikonu vlevo od vyhledávacího pole (musí být zobrazeno).
de: Klicken Sie auf das Symbol links neben der Suchleiste.
