Repository: openSUSE/doc-sle-translations
Catalog: */po/apps_firefox.*.po
Languages: cs, de

source: From the pop-up, select <guimenu>Change Search Settings</guimenu>. The <guimenu>Search</guimenu> dialog shows the engine that is currently set as default search engine and other available search engines.
cs: V rozbalovací nabídce vyberte možnost <guimenu>Změnit nastavení vyhledávání</guimenu>. Dialogové okno <guimenu>Vyhledávání</guimenu> zobrazuje aktuálně nastavený výchozí vyhledávač a další dostupné vyhledávače.
de: Wählen Sie im Popup-Fenster <guimenu>Sucheinstellungen ändern</guimenu>. Das Dialogfeld <guimenu>Suchen</guimenu> zeigt die Maschine, die derzeit als Standardsuchmaschine eingestellt ist, sowie andere verfügbare Suchmaschinen.

source: To change the order of entries, use the mouse to drag them.
cs: Chcete-li změnit pořadí položek, přetahejte je myší.
de: Um die Reihenfolge der Einträge zu ändern, ziehen Sie sie mit der Maus.

source: To delete an entry, select it and click <guimenu>Remove</guimenu>.
cs: Chcete-li položku odstranit, vyberte ji a klikněte na <guimenu>Odstranit</guimenu>.
de: Um einen Eintrag zu löschen, wählen Sie ihn aus und klicken Sie auf <guimenu>Entfernen</guimenu>.

source: To add a search engine, click <guimenu>Add More Search Engines</guimenu>. Firefox displays a Web page with available search plug-ins. To install a search plug-in, select it and click <guimenu>Add to Firefox</guimenu>.
cs: Chcete-li přidat vyhledávač, klikněte na <guimenu>Přidat další vyhledávače</guimenu>. Firefox zobrazí webovou stránku s dostupnými vyhledávacími pluginy. Chcete-li nainstalovat vyhledávací zásuvný modul, vyberte jej a klikněte na <guimenu>Přidat do Firefoxu</guimenu>.
de: Um eine Suchmaschine hinzuzufügen, klicken Sie auf <guimenu>Weitere Suchmaschinen hinzufügen</guimenu>. Firefox zeigt eine Webseite mit verfügbaren Such-Plug-Ins an. Um ein Such-Plug-in zu installieren, wählen Sie es aus und klicken Sie auf <guimenu>Zu Firefox hinzufügen</guimenu>.

source: Firefox—Manage Search Engines
cs: Firefox - Správa vyhledávačů
de: Firefox-Suchmaschinen verwalten

source: Some Web sites offer search engines that you can add directly to the search bar. Whenever you are visiting such a Web site, the icon to the left of the search bar gains a <literal>+</literal> sign. Click the icon and select <guimenu>Add</guimenu>.
cs: Některé weby nabízejí vyhledávače, které můžete přidat přímo do vyhledávacího pole. Kdykoli navštívíte takový web, ikona vlevo od vyhledávacího panelu získá znaménko <literal>+</literal>. Klepněte na ikonu a vyberte možnost <guimenu>Přidat</guimenu>.
de: Einige Websites bieten Suchmaschinen an, die Sie direkt in die Suchleiste einfügen können. Immer wenn Sie eine solche Website besuchen, erhält das Symbol links von der Suchleiste das Zeichen <literal>+</literal>. Klicken Sie auf das Symbol und wählen Sie <guimenu>Hinzufügen</guimenu>.

source: Adding Keywords to Your Online Searches
cs: Přidání klíčových slov do online vyhledávání
de: Hinzufügen von Schlüsselwörtern zu Ihrer Online-Recherche

source: Firefox lets you define own <emphasis>keywords</emphasis>: abbreviations to use as a URL shortcut for a particular search engine. If you have defined <literal>ws</literal> as a keyword for the Wikipedia search for example, you can type <literal>ws <replaceable>SEARCHTERM</replaceable></literal> into the location bar to search Wikipedia for <replaceable>SEARCHTERM</replaceable>.
cs: Firefox vám umožňuje definovat vlastní <emphasis>klíčová slova</emphasis>: zkratky, které se mají použít jako zkratka URL pro konkrétní vyhledávač. Pokud jste jako klíčové slovo pro vyhledávání například na Wikipedii definovali <literal>ws</literal>, můžete do panelu umístění zadat <literal>ws <replaceable>VZOREK</replaceable></literal> a vyhledat <replaceable>VZOREK</replaceable>.
de: Firefox erlaubt es Ihnen, eigene <emphasis>Schlüsselwörter</emphasis>: Abkürzungen zu definieren, die als URL-Abkürzung für eine bestimmte Suchmaschine verwendet werden sollen. Wenn Sie z.B. <literal>ws</literal> als Schlüsselwort für die Wikipedia-Suche definiert haben, können Sie <literal>ws <replaceable>SEARCHTERM</replaceable></literal> in die Positionsleiste eingeben, um Wikipedia nach <replaceable>SEARCHTERM</replaceable> zu durchsuchen.

source: To assign a shortcut for a search engine from the search bar, click the icon to the left of the search bar and select <guimenu>Change Search Settings</guimenu>. Select a search engine, double-click its <guimenu>Keyword</guimenu> column, enter a keyword and press <keycap function="enter"/>.
cs: Chcete-li přiřadit zkratku vyhledávacímu nástroji z vyhledávacího panelu, klikněte na ikonu vlevo od vyhledávacího panelu a vyberte <guimenu>Změnit nastavení vyhledávání</guimenu>. Vyberte vyhledávač, dvakrát klikněte na jeho sloupec <guimenu>Klíčové slovo</guimenu>, zadejte klíčové slovo a stiskněte klávesu <keycap function="enter"/>.
de: Um eine Abkürzung für eine Suchmaschine aus der Suchleiste zuzuweisen, klicken Sie auf das Symbol links neben der Suchleiste und wählen Sie <guimenu>Sucheinstellungen ändern</guimenu>. Wählen Sie eine Suchmaschine, doppelklicken Sie auf ihre Spalte <guimenu>Schlüsselwort</guimenu>, geben Sie ein Schlüsselwort ein und drücken Sie <keycap function="enter"/>.

source: It is also possible to define a keyword for any search field on a Web site. Proceed as follows:
cs: Je také možné definovat klíčové slovo pro libovolné vyhledávací pole na webu. Postupujte takto:
de: Es ist auch möglich, ein Schlüsselwort für ein beliebiges Suchfeld auf einer Website zu definieren. Gehen Sie dazu wie folgt vor:

source: Right-click the search field and choose <guimenu>Add a Keyword for this Search</guimenu> from the menu that opens. The <guimenu>Add Bookmark</guimenu> dialog appears.
cs: Klepněte pravým tlačítkem myši na vyhledávací pole a z nabídky, která se otevře, vyberte <guimenu>Přidat klíčové slovo pro toto vyhledávání</guimenu>. Zobrazí se dialogové okno <guimenu>Přidat záložku</guimenu>.
de: Klicken Sie mit der rechten Maustaste auf das Suchfeld und wählen Sie <guimenu>Schlüsselwort für diese Suche hinzufügen</guimenu> aus dem sich öffnenden Menü. Das Dialogfeld <guimenu>Lesezeichen hinzufügen</guimenu> erscheint.

source: In <guimenu>Name</guimenu>, enter a descriptive name for this keyword.
cs: Do pole <guimenu>Název</guimenu> zadejte popisný název tohoto klíčového slova.
de: Geben Sie in <guimenu>Name</guimenu> einen beschreibenden Namen für dieses Schlüsselwort ein.

source: Enter your <guimenu>Keyword</guimenu> for this search.
cs: Zadejte <guimenu>klíčové slovo</guimenu> pro toto vyhledávání.
de: Geben Sie für diese Suche Ihr <guimenu>Schlüsselwort</guimenu> ein.

source: <guimenu>Save</guimenu> this keyword.
cs: <guimenu>Uložte</guimenu> toto klíčové slovo.
de: <guimenu>Speichern</guimenu> des Schlüsselwortes.

source: Keywords for Regular Web Sites
cs: Klíčová slova pro běžné webové stránky

source: Using keywords is not restricted to search engines. You can also add a keyword to a bookmark (via the bookmark's properties). For example, if you assign <literal>suse</literal> to the SUSE home page bookmark, you can open it by typing <literal>suse</literal> into the location bar.
cs: Používání klíčových slov není omezeno na vyhledávače. K záložce můžete také přidat klíčové slovo (ve vlastnostech záložky). Pokud například přiřadíte <literal>suse</literal> k záložce domovské stránky SUSE, můžete ji otevřít zadáním <literal>suse</literal> do panelu umístění.
de: Die Verwendung von Schlüsselwörtern ist nicht auf Suchmaschinen beschränkt. Sie können auch ein Schlüsselwort zu einem Lesezeichen hinzufügen (über die Eigenschaften des Lesezeichens). Wenn Sie beispielsweise dem SUSE-Startseiten-Lesezeichen <literal>suse</literal> zuweisen, können Sie es öffnen, indem Sie <literal>suse</literal> in die Positionsleiste eingeben.

source: Searching in the Current Page
cs: Hledání na aktuální stránce
de: Suche auf der aktuellen Seite

source: To search inside a Web page, in the menu bar, click <menuchoice> <guimenu>Edit</guimenu> <guimenu>Find</guimenu> </menuchoice> or press <keycombo> <keycap function="control"/> <keycap>F</keycap> </keycombo>. The find bar opens. It is usually displayed at the bottom of a window. Type your query in the text box. Firefox finds the first occurrence of this phrase as you type. You can find other occurrences of the phrase by pressing <keycap>F3</keycap> or the <guimenu>Next</guimenu> button in the find bar. Clicking the <guimenu>Highlight All</guimenu> button will highlight all occurrences of the phrase. Checking the <guimenu>Match Case</guimenu> option makes the query case-sensitive.
cs: Chcete-li hledat uvnitř webové stránky, klikněte na panelu nabídek na ikonu <menuchoice> <guimenu>Úpravy</guimenu> <guimenu>Najít</guimenu> </menuchoice> nebo stiskněte klávesu <keycombo> <keycap function="control"/> <keycap>F</keycap> </keycombo>. Otevře se prohledávací lišta. Obvykle se zobrazuje v dolní části okna. Do textového pole zadejte dotaz. Při psaní najde Firefox první výskyt této fráze. Další/předešlé (cyklicky) výskyty fráze můžete najít stisknutím <keycap>F3</keycap> nebo tlačítka <guimenu>Další</guimenu> na panelu hledání. Kliknutím na tlačítko <guimenu>Zvýraznit vše</guimenu> zvýrazníte všechny výskyty fráze. Zaškrtnutím možnosti <guimenu>Rozlišovat velikost</guimenu> bude dotaz rozlišovat písmena velké a malé abecedy.
de: Um innerhalb einer Webseite zu suchen, klicken Sie in der Menüleiste auf <menuchoice> <guimenu>Bearbeiten</guimenu> <guimenu>Finden</guimenu> </menuchoice> oder drücken Sie <keycombo> <keycap function="control"/> <keycap>F</keycap> </keycombo>. Die Suchleiste öffnet sich. Sie wird normalerweise unten in einem Fenster angezeigt. Geben Sie Ihre Suchanfrage in das Textfeld ein. Firefox findet das erste Vorkommen dieser Phrase, während Sie tippen. Sie können weitere Vorkommen der Phrase finden, indem Sie <keycap>F3</keycap> oder die Schaltfläche <guimenu>Next</guimenu> in der Suchleiste drücken. Wenn Sie auf die Schaltfläche <guimenu>alle hervorheben</guimenu> klicken, werden alle Vorkommen der Phrase hervorgehoben. Durch Aktivieren der Option <guimenu>Groß-/Kleinschreibung</guimenu> wird die Groß-/Kleinschreibung bei der Suche berücksichtigt.

source: Firefox also offers two quick-find options. Click anywhere you like to start a search on a Web page, type the key <keycap>/</keycap> immediately followed by the search term. The first occurrence of the search term will be highlighted as you type. Use <keycap>F3</keycap> to find the next occurrence. It is also possible to limit quick-find to links only. This search option is available by typing the key <keycap>'</keycap>.
cs: Firefox také nabízí dvě možnosti rychlého vyhledávání. Klepnutím na libovolné místo, kde chcete spustit vyhledávání na webové stránce, zadejte klíč <keycap>/</keycap>, za nímž následuje hledaný výraz. První výskyt hledaného výrazu bude při psaní zvýrazněn. Pomocí <keycap>F3</keycap> vyhledejte další výskyt. Je také možné omezit rychlé vyhledávání pouze na odkazy. Tato možnost vyhledávání je dostupná zadáním klávesy <keycap>'</keycap> a hledaného výrazu.
de: Firefox bietet außerdem zwei Schnellsuchoptionen. Klicken Sie auf eine beliebige Stelle, um eine Suche auf einer Webseite zu starten, geben Sie den Schlüssel <keycap>/</keycap> ein, unmittelbar gefolgt von dem Suchbegriff. Das erste Vorkommen des Suchbegriffs wird während der Eingabe hervorgehoben. Verwenden Sie <keycap>F3</keycap>, um das nächste Vorkommen zu finden. Es ist auch möglich, die Schnellsuche auf Links zu beschränken. Diese Suchoption ist verfügbar, indem Sie die Taste <keycap>'</keycap> eingeben.

source: Managing Bookmarks
cs: Správa záložek
de: Lesezeichen verwalten

source: Bookmarks offer a convenient way of saving links to your favorite Web sites. Firefox not only makes it very easy to add new bookmarks with just one mouse click, it also offers multiple ways to manage large bookmark collections. You can sort bookmarks into folders, classify them with tags, or filter them with smart bookmark folders.
cs: Záložky nabízejí pohodlný způsob uložení odkazů na vaše oblíbené webové stránky. Firefox nejen velmi usnadňuje přidávání nových záložek jediným kliknutím myši, ale také nabízí několik způsobů, jak spravovat velké sbírky záložek. Můžete třídit záložky do složek, třídit je pomocí značek nebo filtrovat pomocí inteligentních složek se záložkami.
de: Lesezeichen bieten eine bequeme Möglichkeit, Links zu Ihren Lieblings-Websites zu speichern. Firefox macht es nicht nur sehr einfach, neue Lesezeichen mit nur einem Mausklick hinzuzufügen, sondern bietet auch mehrere Möglichkeiten, große Lesezeichensammlungen zu verwalten. Sie können Lesezeichen in Ordner sortieren, mit Tags klassifizieren oder mit intelligenten Lesezeichenordnern filtern.

source: Add a bookmark by clicking the star in the location bar. The star will turn blue to indicate the page was bookmarked. The bookmark will be saved in the <guimenu>Unsorted Bookmarks</guimenu> folder under the page title. To change the name and folder of your bookmark or add tags, after bookmarking, click the star again. This will open a pop-up where you can make your changes.
cs: Přidejte záložku kliknutím na hvězdičku na panelu umístění. Hvězda se změní na modrou, což znamená, že stránka byla označena záložkou. Záložka bude uložena do složky <guimenu>Ostatní záložky</guimenu> pod názvem stránky. Chcete-li změnit název a složku záložky nebo přidat značky, klikněte znovu na záložku. Otevře se vyskakovací okno, ve kterém můžete provést změny.
de: Fügen Sie ein Lesezeichen hinzu, indem Sie auf den Stern in der Standortleiste klicken. Der Stern wird blau, um anzuzeigen, dass die Seite mit einem Lesezeichen versehen wurde. Das Lesezeichen wird im Ordner <guimenu>Unsortierte Lesezeichen</guimenu> unter dem Seitentitel gespeichert. Um den Namen und Ordner Ihres Lesezeichens zu ändern oder Tags hinzuzufügen, klicken Sie nach dem Setzen des Lesezeichens erneut auf den Stern. Dadurch öffnet sich ein Pop-up-Fenster, in dem Sie Ihre Änderungen vornehmen können.

source: To bookmark all open tabs, right-click in a tab and choose <guimenu>Bookmark All Tabs</guimenu>. Firefox asks you to create a new folder for the tab links.
cs: Chcete-li uložit do záložek všechny otevřené karty, klepněte na kartu pravým tlačítkem myši a vyberte příkaz <guimenu>Přidat všechny záložky</guimenu>. Firefox vás požádá o vytvoření nové složky záložek pro odkazy na karty.
de: Um alle geöffneten Tabs mit einem Lesezeichen zu versehen, klicken Sie mit der rechten Maustaste in eine Registerkarte und wählen Sie <guimenu>Alle Tabs mit einem Lesezeichen versehen</guimenu>. Firefox fordert Sie auf, einen neuen Ordner für die Tab-Links anzulegen.

source: To remove a bookmark, open the bookmarked location. Then, click the star and click <guimenu>Remove Bookmark</guimenu>.
cs: Chcete-li záložku odebrat, otevřete umístění označené záložkou. Poté klikněte na hvězdičku a klikněte na <guimenu>Odstranit záložku</guimenu>.
de: Um ein Lesezeichen zu entfernen, öffnen Sie den mit einem Lesezeichen versehenen Ort. Klicken Sie dann auf den Stern und klicken Sie auf <guimenu>Lesezeichen entfernen</guimenu>.

source: Organizing Bookmarks
cs: Správa záložek
de: Organisieren von Lesezeichen

source: The <guimenu>Library</guimenu> can be used to manage the properties (name and address location) for each bookmark and organize the bookmarks into folders and sections. It resembles <xref linkend="fig.firefox.library"/>.
cs: Menu <guimenu>Knihovna</guimenu> lze použít ke správě vlastností (umístění jména a adresy) pro každou záložku a uspořádání záložek do složek a oddílů. Připomíná <xref linkend="fig.firefox.library"/>.
de: Mit <guimenu>Bibliothek</guimenu> können Sie die Eigenschaften (Name und Speicherort der Adresse) für jedes Lesezeichen verwalten und die Lesezeichen in Ordnern und Abschnitten organisieren. Es ähnelt <xref linkend="fig.firefox.library"/>.

source: The Firefox Bookmark Library
cs: Knihovna záložek Firefox

source: To open the <guimenu>Library</guimenu>, in the menu bar, click <menuchoice> <guimenu>Bookmarks</guimenu> <guimenu>Show All Bookmarks</guimenu> </menuchoice>. The library window is split into two parts: the left pane shows the folder tree view, the right pane the subfolders and bookmarks of the selected folder. Use <guimenu>Views</guimenu> to customize the right pane. The left pane contains three main folders:
cs: Chcete-li otevřít <guimenu>Knihovnu</guimenu>, klepněte v hlavním menu na <menuchoice> <guimenu>Záložky</guimenu> a <guimenu>Zobrazit všechny záložky</guimenu> </menuchoice>. Okno knihovny je rozděleno na dvě části: v levém podokně je zobrazeno stromové zobrazení složek, v pravém podokně podsložky a záložky vybrané složky. K přizpůsobení pravého panelu použijte <guimenu>Pohledy</guimenu>. Levý panel obsahuje tři hlavní složky:
de: Um das Menü <guimenu>Bibliothek</guimenu> zu öffnen, klicken Sie in der Menüleiste auf <menuchoice> <guimenu>Lesezeichen</guimenu> <guimenu>Lesezeichen verwalten</guimenu> </menuchoice>. Das Bibliotheksfenster ist in zwei Teile geteilt: Das linke Fenster zeigt die Ordnerstrukturansicht, das rechte Fenster die Unterordner und Lesezeichen des ausgewählten Ordners. Verwenden Sie <guimenu>Ansichten</guimenu>, um das rechte Fenster anzupassen. Das linke Fenster enthält drei Hauptordner:

source: History
cs: Historie
de: Chronik

source: Contains your complete browsing history. You cannot alter this list other than by deleting entries from it.
cs: Obsahuje úplnou historii prohlížení. Tento seznam nemůžete změnit jinak než odstraněním jeho položek.
de: Enthält Ihren vollständigen Browserverlauf. Sie können diese Liste nur ändern, indem Sie Einträge aus ihr löschen.

source: Tags
cs: Štítky
de: Schlagwörter

source: Lists bookmarks for each tag you have specified. See <xref linkend="sec.firefox.bookmarks.tags"/> for more information on tags.
cs: Uvádí záložky pro každý štítek, který jste zadali. Další informace o štítcích najdete v <xref linkend="sec.firefox.bookmarks.tags"/>.

source: All Bookmarks
cs: Všechny záložky
de: Alle Lesezeichen

source: This category contains the three main bookmark folders:
cs: Tato kategorie obsahuje tři hlavní složky záložek:
de: Diese Kategorie enthält die drei Hauptordner für Lesezeichen:

source: Bookmarks Toolbar
cs: Lišta nástrojů záložek

source: Contains the bookmarks and folders displayed beneath the location bar. See <xref linkend="sec.firefox.bookmarks.toolbar"/> for more information.
cs: Obsahuje záložky a složky zobrazené pod panelem umístění. Další informace viz <xref linkend="sec.firefox.bookmarks.toolbar"/>.
de: Enthält die Lesezeichen und Ordner, die unterhalb der Adressleiste angezeigt werden. Siehe <xref linkend="sec.firefox.bookmarks.toolbar"/> für weitere Informationen.

source: Bookmarks Menu
cs: Nabídka (menu) záložek

source: Holds the bookmarks and folder accessible via the <guimenu>Bookmarks</guimenu> entry in the main menu or the bookmarks side menu.
cs: Uchovává záložky a složku přístupnou prostřednictvím položky <guimenu>Záložky</guimenu> v hlavní nabídce nebo v postranní nabídce záložek.
de: Enthält die Lesezeichen und Ordner, die über den Eintrag <guimenu>Lesezeichen</guimenu> im Hauptmenü oder im Seitenmenü der Lesezeichen zugänglich sind.

source: Unsorted Bookmarks
cs: Ostatní záložky

source: Contains all bookmarks created with a single click the star in the location bar. This folder is only visible in the library and the bookmarks sidebar.
cs: Obsahuje všechny záložky vytvořené kliknutím na hvězdičku v panelu umístění. Tato složka je viditelná pouze v knihovně a na postranním panelu záložek.
de: Enthält alle Lesezeichen, die mit einem einzigen Klick auf den Stern in der Standortleiste erstellt wurden. Dieser Ordner ist nur in der Bibliothek und in der Lesezeichen-Seitenleiste sichtbar.

source: Organize your bookmarks using the right pane. Choose actions for folders or bookmarks either from the context menu that opens when you right-click an item or from the <guimenu>Organize</guimenu> menu. The properties of a chosen folder or bookmark can be edited in the bottom part of the right pane. By default, only <guimenu>Name</guimenu>, <guimenu>Location</guimenu>, and <guimenu>Tags</guimenu> are displayed for a bookmark. Click the arrow next to <guimenu>More</guimenu> to gain access to all properties.
cs: Uspořádejte si záložky pomocí pravého panelu. Vyberte akce pro složky nebo záložky buď z místní nabídky, která se otevře, když kliknete pravým tlačítkem myši na položku, nebo z nabídky <guimenu>Uspořádat</guimenu>. Vlastnosti vybrané složky nebo záložky lze upravit v dolní části pravého panelu. Ve výchozím nastavení se pro záložku zobrazí pouze <guimenu>Název</guimenu>, <guimenu>Umístění</guimenu> a <guimenu>Štítky</guimenu>. Kliknutím šipky vedle <guimenu>Další</guimenu> získáte přístup ke všem vlastnostem.
de: Organisieren Sie Ihre Lesezeichen im rechten Fensterbereich. Wählen Sie Aktionen für Ordner oder Lesezeichen entweder aus dem Kontextmenü, das sich öffnet, wenn Sie mit der rechten Maustaste auf ein Element klicken, oder aus dem Menü <guimenu>Organisieren</guimenu>. Die Eigenschaften eines ausgewählten Ordners oder Lesezeichens können im unteren Teil des rechten Fensters bearbeitet werden. Standardmäßig werden für ein Lesezeichen nur <guimenu>Name</guimenu>, <guimenu>Adresse</guimenu> und <guimenu>Schlagwörter</guimenu> angezeigt. Klicken Sie auf den Pfeil neben <guimenu>More</guimenu>, um Zugriff auf alle Eigenschaften zu erhalten.

source: To rearrange your bookmarks, use the mouse to drag them. You can use this to move a bookmark or a folder to a different folder, or to change the order of bookmarks in a folder.
cs: Chcete-li změnit uspořádání záložek, přetahejte je myší. Můžete ji použít k přesunutí či kopii (s Ctrl) záložky nebo složky do jiné složky, nebo ke změně pořadí záložek ve složce.
de: Um Ihre Lesezeichen neu anzuordnen, ziehen Sie sie mit der Maus. Sie können damit ein Lesezeichen oder einen Ordner in einen anderen Ordner verschieben oder die Reihenfolge der Lesezeichen in einem Ordner ändern.

source: Tags offer a convenient way to file a bookmark under several categories. You can tag a bookmark with as many terms as you want. For example, to access all sites tagged with <literal>suse</literal>, enter <literal>suse</literal> into the location bar. For each tag, an item is automatically created in the <systemitem>Recent Tags</systemitem> folder of the library. Drag and drop an item for a tag onto the bookmark toolbar to easily access it.
cs: Štítky nabízejí pohodlný způsob, jak uložit záložku do několika kategorií. Záložky můžete označit libovolným počtem výrazů. Chcete-li například přistupovat ke všem webům označeným <literal>suse</literal>, zadejte do panelu umístění <literal>suse</literal>. Pro každý štítek se automaticky vytvoří položka ve složce <systemitem>Poslední štítky</systemitem> v knihovně. Chcete-li k ní snadno přistupovat, přetáhněte položku štítku na panel nástrojů záložek.
de: Tags bieten eine bequeme Möglichkeit, ein Lesezeichen unter mehreren Kategorien abzulegen. Sie können ein Lesezeichen mit so vielen Begriffen wie Sie wollen taggen. Um zum Beispiel auf alle Sites zuzugreifen, die mit <literal>suse</literal> getaggt sind, geben Sie <literal>suse</literal> in die Standortleiste ein. Für jedes Tag wird automatisch ein Element im Ordner <systemitem>Recent Tags</systemitem> der Bibliothek erstellt. Ziehen Sie ein Element für ein Tag per Drag & Drop auf die Lesezeichen-Symbolleiste, um einfach darauf zuzugreifen.
