Repository: openSUSE/doc-sle-translations
Catalog: */po/apps_pidgin.*.po
Languages: cs, de

# _
source: translator-credits
cs: překladatelské kredity alkas alkas@volny.cz, 2016, 2020
de: Übersetzer-Credits

source: Pidgin: Instant Messaging
cs: Pidgin: Okamžité zprávy

source: yes
cs: ano
de: Ja

source: Pidgin is an instant messaging (IM) client that allows you to connect to multiple accounts simultaneously. Chat live with your contacts, regardless of which IM system they use.
cs: Pidgin je klient pro rychlé zasílání zpráv (IM), který vám umožňuje připojit se k více účtům současně. Besedujte živě se svými kontakty, bez ohledu na to, který systém chatu používají.
de: Pidgin ist ein Instant Messaging-Client (IM), mit dem Sie gleichzeitig eine Verbindung zu mehreren Konten herstellen können. Chatten Sie live mit Ihren Kontakten, unabhängig davon, welches IM-System sie verwenden.

source: Pidgin supports the following instant messaging protocols: AIM, Bonjour, Gadu-Gadu, Google Talk, Groupwise, ICQ, IRC, SIMPLE, XMPP, and Zephyr. Microsoft Office Communicator is also supported if you install the additional package <package>pidgin-plugin-sipe</package>.
cs: Pidgin podporuje následující protokoly pro rychlé zasílání zpráv: AIM, Bonjour, Gadu-Gadu, Google Talk, Groupwise, ICQ, IRC, SIMPLE, XMPP a Zephyr. Microsoft Office Communicator je také podporován, když nainstalujete přídavný balíček <package>pidgin-plugin-sipe</package>.
de: Pidgin unterstützt die folgenden Instant Messaging-Protokolle: AIM, Bonjour, Gadu-Gadu, Google Talk, Groupwise, ICQ, IRC, SIMPLE, XMPP und Zephyr. Microsoft Office Communicator wird auch unterstützt, wenn Sie das zusätzliche Paket <package> pidgin-plugin-sipe </package> installieren.

source: In the following, learn how to set up Pidgin and how to communicate with your contacts.
cs: V následující části se dozvíte, jak nastavit Pidgin a jak komunikovat se svými kontakty.
de: Im Folgenden erfahren Sie, wie Sie Pidgin einrichten und mit Ihren Kontakten kommunizieren.

source: Starting Pidgin
cs: Spuštění Pidgin
de: Pidgin starten

source: To start Pidgin, open the Activities Overview by pressing <keycap function="meta"/> and search for <literal>pid</literal>.
cs: Chcete-li spustit Pidgin, otevřete Přehled aktivit stisknutím <keycap function="meta"/> a vyhledejte <literal>pid</literal>.
de: Um Pidgin zu starten, öffnen Sie die Aktivitätenübersicht, indem Sie <keycap function="meta"/> drücken und nach <literal> pid </literal> suchen.

source: Configuring Accounts
cs: Konfigurace účtů
de: Konten konfigurieren

source: To use Pidgin, you must already have an account for the messaging service you want to use. For example, to use Pidgin to chat via AIM, you must first have an AIM account.
cs: Chcete-li používat Pidgin, musíte již mít účet pro službu zasílání zpráv, kterou chcete použít. Chcete-li například použít Pidgin pro chatování přes AIM, musíte mít nejprve účet AIM.
de: Um Pidgin verwenden zu können, müssen Sie bereits über ein Konto für den Nachrichtendienst verfügen, den Sie verwenden möchten. Um beispielsweise mit Pidgin über AIM chatten zu können, müssen Sie zunächst über ein AIM-Konto verfügen.

source: Adding and Editing Accounts in Pidgin
cs: Přidávání a úpravy účtů v Pidgin
de: Hinzufügen und Bearbeiten von Konten in Pidgin

source: If you start Pidgin for the first time, a message appears, prompting you to configure an account. Proceed with <guimenu>Add</guimenu> to add a new account.
cs: Spustíte-li Pidgin poprvé, zobrazí se zpráva s výzvou ke konfiguraci účtu. Chcete-li přidat nový účet, pokračujte pomocí <guimenu>Přidat</guimenu>.
de: Wenn Sie Pidgin zum ersten Mal starten, wird eine Meldung angezeigt, in der Sie aufgefordert werden, ein Konto zu konfigurieren. Fahren Sie mit <guimenu> Hinzufügen </guimenu> fort, um ein neues Konto hinzuzufügen.

source: If you have already configured an account and want to add a new one or modify existing ones, open this dialog via <menuchoice> <guimenu>Accounts</guimenu> <guimenu>Manage Accounts</guimenu> </menuchoice>. Either <guimenu>Add</guimenu> a new account, or <guimenu>Modify</guimenu> or <guimenu>Delete</guimenu> existing ones.
cs: Jestliže jste již nakonfigurovali účet a chcete přidat nový nebo upravit stávající, otevřete tento dialog pomocí <menuchoice> <guimenu>Účty</guimenu> <guimenu>Spravovat účty</guimenu> </menuchoice>. Můžete <guimenu>Přidat</guimenu> nový účet, nebo <guimenu>Upravit</guimenu> nebo <guimenu>Odstranit</guimenu> existující účty.
de: Wenn Sie bereits ein Konto konfiguriert haben und ein neues hinzufügen oder vorhandene ändern möchten, öffnen Sie diesen Dialog über <menuchoice> <guimenu> Accounts </guimenu> <guimenu> Accounts verwalten </guimenu> </menuchoice>. Entweder <guimenu> Hinzufügen </guimenu> eines neuen Kontos oder <guimenu> Ändern </guimenu> oder <guimenu> Löschen </guimenu> vorhandener Konten.

source: The Add/Modify Account dialog opens. Use the <guimenu>Basic</guimenu> tab to select a protocol and enter or modify your login credentials.
cs: Otevře se dialogové okno Přidat/Upravit účet. Na kartě <guimenu>Základní</guimenu> vyberte protokol a zadejte nebo změňte své přihlašovací údaje.
de: Das Dialogfeld Konto hinzufügen / ändern wird geöffnet. Verwenden Sie die Registerkarte <guimenu> Basic </guimenu>, um ein Protokoll auszuwählen und Ihre Anmeldeinformationen einzugeben oder zu ändern.

source: The availability of other tabs and the data you are required to enter depends on the protocol you have chosen. In most cases, server details such as address and port number need to be entered on the <guimenu>Advanced</guimenu> tab.
cs: Dostupnost dalších karet a data, která musíte zadat, závisí na zvoleném protokolu. Ve většině případů je třeba na kartě <guimenu>Upřesnit</guimenu> zadat podrobnosti o serveru, jako je adresa a číslo portu.
de: Die Verfügbarkeit anderer Registerkarten und die Daten, die Sie eingeben müssen, hängen vom ausgewählten Protokoll ab. In den meisten Fällen müssen Serverdetails wie Adresse und Portnummer auf der Registerkarte <guimenu> Erweitert </guimenu> eingegeben werden.

source: On the <guimenu>Proxy</guimenu> tab you can enter a custom proxy configuration for the chosen protocol. By default the system settings (<guimenu>Use Global Proxy Settings</guimenu>) are preselected. This default should be sufficient for most users.
cs: Na kartě <guimenu>Proxy</guimenu> můžete zadat vlastní konfiguraci serveru proxy pro vybraný protokol. Ve výchozím nastavení jsou předvolena nastavení systému (<guimenu>Použít globální nastavení proxy</guimenu>). Tato výchozí hodnota by měla být dostatečná pro většinu uživatelů.
de: Auf der Registerkarte <guimenu> Proxy </guimenu> können Sie eine benutzerdefinierte Proxy-Konfiguration für das ausgewählte Protokoll eingeben. Standardmäßig sind die Systemeinstellungen (<guimenu> Globale Proxy-Einstellungen verwenden </guimenu>) vorausgewählt. Diese Standardeinstellung sollte für die meisten Benutzer ausreichend sein.

source: Continue with <guimenu>Add</guimenu> or <guimenu>Save</guimenu>. Make sure all accounts you want to use are set to <guimenu>Enabled</guimenu> in the resulting <guimenu>Accounts</guimenu> window. If you want to temporarily disable an account, deselect it in the <guimenu>Enabled</guimenu> column.
cs: Pokračujte akcí <guimenu>Přidat</guimenu> nebo <guimenu>Uložit</guimenu>. Ve výsledném okně <guimenu>Účty</guimenu> zkontrolujte, zda jsou všechny účty, které chcete použít, nastaveny na <guimenu>Povoleno</guimenu>. Chcete-li účet dočasně zakázat, zrušte výběr ve sloupci <guimenu>Povoleno</guimenu>.
de: Fahren Sie mit <guimenu> Hinzufügen </guimenu> oder <guimenu> Speichern </guimenu> fort. Stellen Sie sicher, dass alle Konten, die Sie verwenden möchten, im daraufhin angezeigten Fenster <guimenu> Konten </guimenu> auf <guimenu> Aktiviert </guimenu> eingestellt sind. Wenn Sie ein Konto vorübergehend deaktivieren möchten, deaktivieren Sie es in der Spalte <guimenu> Aktiviert </guimenu>.

source: Managing Contacts
cs: Správa kontaktů
de: Kontakte verwalten

source: Use the <guimenu>Contact List</guimenu> to manage your contacts (so-called <quote>Buddies</quote>). You can add and remove contacts and organize them in groups, so they are easy to find.
cs: Pomocí <guimenu>Seznamu kontaktů</guimenu> můžete spravovat své kontakty (tzv. <quote>Kamarádi</quote>). Můžete přidat a odebrat kontakty a uspořádat je do skupin, aby je bylo možné snadno najít.
de: Verwenden Sie die <guimenu> Kontaktliste </guimenu>, um Ihre Kontakte zu verwalten (sogenannte <quote> Buddies </quote>). Sie können Kontakte hinzufügen, entfernen und in Gruppen organisieren, damit sie leicht zu finden sind.

source: Adding Contacts
cs: Přidávání kontaktů
de: Kontakte hinzufügen

source: To add a contact, click <menuchoice> <guimenu>Buddies</guimenu> <guimenu>Add Buddy</guimenu> </menuchoice>.
cs: Chcete-li přidat kontakt, klikněte na <menuchoice> <guimenu>Kamarádi</guimenu> <guimenu>Přidat kamaráda</guimenu> </menuchoice>.
de: Um einen Kontakt hinzuzufügen, klicken Sie auf <menuchoice> <guimenu> Buddies </guimenu> <guimenu> Buddy hinzufügen </guimenu> </menuchoice>.

source: Select the <guimenu>Account</guimenu> for which you want to add a contact.
cs: Vyberte <guimenu>Účet</guimenu>, pro který chcete přidat kontakt.
de: Wählen Sie das <guimenu> Konto </guimenu> aus, für das Sie einen Kontakt hinzufügen möchten.

source: Enter the contact's user name under <guimenu>Buddy' username</guimenu>. Ask your contact for this name prior to adding the contact—this data is required and usually depends on the protocol.
cs: Zadejte uživatelské jméno kontaktu do <guimenu>Uživatelské jméno kamaráda</guimenu>. Před přidáním kontaktu požádejte svůj kontakt o toto jméno - tato data jsou vyžadována a obvykle závisí na protokolu.
de: Geben Sie den Benutzernamen des Kontakts unter <guimenu> Buddy 'Benutzername </guimenu> ein. Fragen Sie Ihren Kontakt nach diesem Namen, bevor Sie den Kontakt hinzufügen. Diese Daten sind erforderlich und hängen normalerweise vom Protokoll ab.

source: By default, the contact is shown under the name they have provided with their account. Use <guimenu>(Optional): Alias</guimenu> to display the contact with a custom name. With some protocols you can also send the contact an invite message with <guimenu>(Optional): Invite Message</guimenu>.
cs: Ve výchozím nastavení je kontakt zobrazen pod jménem, které poskytl ke svému účtu. Pomocí <guimenu>(Volitelné): Alias</guimenu> zobrazte kontakt s vlastním jménem. U některých protokolů můžete kontaktu také odeslat zprávu s výzvou <guimenu>(Volitelné): Uvítací zpráva</guimenu>.
de: Standardmäßig wird der Kontakt unter dem Namen angezeigt, den er mit seinem Konto angegeben hat. Verwenden Sie <guimenu> (optional): Alias </guimenu>, um den Kontakt mit einem benutzerdefinierten Namen anzuzeigen. Bei einigen Protokollen können Sie dem Kontakt auch eine Einladungsnachricht mit <guimenu> (optional) senden: Nachricht einladen </guimenu>.

source: If you have sorted your contacts by group, choose an existing group from the drop-down text box or enter a new group name.
cs: Pokud jste kontakty seřadili podle skupiny, vyberte existující skupinu z rozevíracího pole nebo zadejte nový název skupiny.
de: Wenn Sie Ihre Kontakte nach Gruppen sortiert haben, wählen Sie eine vorhandene Gruppe aus dem Dropdown-Textfeld aus oder geben Sie einen neuen Gruppennamen ein.

source: Proceed with <guimenu>Add</guimenu>.
cs: Pokračujte akcí <guimenu>Přidat</guimenu>.
de: Fahren Sie mit <guimenu>Hinzufügen</guimenu> fort.

source: In case the groups or the newly added contacts are not displayed in the contact list, check the display preferences by clicking <menuchoice> <guimenu>Buddies</guimenu> <guimenu>Show</guimenu> </menuchoice>. Activate <guimenu>Offline Buddies</guimenu> and <guimenu>Empty Groups</guimenu> to make all contacts and groups appear in the <guimenu>Contact List</guimenu>.
cs: V případě, že se skupiny nebo nově přidané kontakty nezobrazí v seznamu kontaktů, zkontrolujte předvolby zobrazení kliknutím na <menuchoice> <guimenu>Kamarádi</guimenu> <guimenu>Zobrazit</guimenu> </menuchoice>. Aktivujte <guimenu>Kamarádi offline</guimenu> a <guimenu>Prázdné skupiny</guimenu>, aby se všechny kontakty a skupiny zobrazily v <guimenu>Seznamu kontaktů</guimenu>.
de: Falls die Gruppen oder die neu hinzugefügten Kontakte nicht in der Kontaktliste angezeigt werden, überprüfen Sie die Anzeigeeinstellungen, indem Sie auf <menuchoice> <guimenu> Buddies </guimenu> <guimenu> Show </guimenu> </menuchoice> klicken. Aktivieren Sie <guimenu> Offline-Freunde </guimenu> und <guimenu> Leere Gruppen </guimenu>, damit alle Kontakte und Gruppen in der <guimenu> Kontaktliste </guimenu> angezeigt werden.

source: To remove a contact from the list, right-click the name of that contact, select <guimenu>Remove</guimenu> and confirm your choice.
cs: Chcete-li odebrat kontakt ze seznamu, klepněte pravým tlačítkem myši na jeho jméno, vyberte <guimenu>Odstranit</guimenu> a potvrďte svůj výběr.
de: Um einen Kontakt aus der Liste zu entfernen, klicken Sie mit der rechten Maustaste auf den Namen dieses Kontakts, wählen Sie <guimenu> Entfernen </guimenu> und bestätigen Sie Ihre Auswahl.

source: Chatting with Friends
cs: Chatování (plkání) s přáteli
de: Mit Freunden chatten

source: To chat with other participants, you need to be connected to the Internet. After a successful login, you are usually marked as <guimenu>Available</guimenu> in the <guimenu>Contact List</guimenu>, and are visible to others. To change your status, click the drop-down box at the bottom of the <guimenu>Contact List</guimenu> and select another option.
cs: Chcete-li chatovat s ostatními účastníky, musíte být připojeni k internetu. Po úspěšném přihlášení jste obvykle označeni jako <guimenu>Dostupný</guimenu> v <guimenu>Seznamu kontaktů</guimenu> a ostatní jsou viditelní. Chcete-li změnit svůj stav, klikněte na rozbalovací pole v dolní části <guimenu>Seznamu kontaktů</guimenu> a vyberte jinou možnost.
de: Um mit anderen Teilnehmern zu chatten, müssen Sie mit dem Internet verbunden sein. Nach einer erfolgreichen Anmeldung werden Sie normalerweise in der <guimenu> Kontaktliste </guimenu> als <guimenu> Verfügbar </guimenu> markiert und sind für andere sichtbar. Um Ihren Status zu ändern, klicken Sie auf das Dropdown-Feld unten in der <guimenu> Kontaktliste </guimenu> und wählen Sie eine andere Option aus.

source: To open a chat session, double-click a contact name in the <guimenu>Contact List</guimenu>. The chat screen opens. Type your message, then press <keycap function="enter"/> to send.
cs: Chcete-li otevřít relaci chatu, dvakrát klikněte na jméno kontaktu v <guimenu>Seznamu kontaktů</guimenu>. Otevře se obrazovka chatu. Napište zprávu a poté stiskněte <keycap function="enter"/> pro odeslání.
de: Doppelklicken Sie zum Öffnen einer Chat-Sitzung auf einen Kontaktnamen in der <guimenu> Kontaktliste </guimenu>. Der Chat-Bildschirm wird geöffnet. Geben Sie Ihre Nachricht ein und drücken Sie zum Senden <keycap function="enter"/>.

source: If you open more than one chat session, the new session appears as a tab in the existing chat window. To see all messages of a session and to be able to write a reply, click the tab of that session. To see multiple session side by side, use the mouse to drag a tab out of the window. A second window will open.
cs: Pokud otevřete více než jednu relaci chatu, nová relace se zobrazí jako karta v existujícím okně chatu. Chcete-li zobrazit všechny zprávy relace a napsat odpověď, klikněte na kartu této relace. Chcete-li zobrazit více relací vedle sebe, přetáhněte kartu z okna myší. Otevře se druhé okno.
de: Wenn Sie mehr als eine Chat-Sitzung öffnen, wird die neue Sitzung als Registerkarte im vorhandenen Chat-Fenster angezeigt. Klicken Sie auf die Registerkarte dieser Sitzung, um alle Nachrichten einer Sitzung anzuzeigen und eine Antwort schreiben zu können. Um mehrere Sitzungen nebeneinander anzuzeigen, ziehen Sie mit der Maus eine Registerkarte aus dem Fenster. Ein zweites Fenster wird geöffnet.

source: To close a chat session, close the tab or window for it.
cs: Chcete-li relaci chatu zavřít, zavřete pro ni kartu nebo okno.
de: Um eine Chat-Sitzung zu schließen, schließen Sie die Registerkarte oder das Fenster dafür.

source: Finding a Contact
cs: Nalezení kontaktu
de: Kontakt finden

source: In case you contact list is very long, contacts may be hard to find. Use <keycombo> <keycap function="control"/> <keycap>F</keycap> </keycombo> to open a search box at the bottom of the contact list. Type one or more letters to find a contact. Use <keycap function="down"/> to move to the next result, or <keycap function="up"/> to move to the previous result.
cs: V případě, že je seznam kontaktů velmi dlouhý, je obtížné najít kontakty. Pomocí <keycombo> <keycap function="control"/> <keycap>F</keycap> </keycombo> otevřete vyhledávací pole v dolní části seznamu kontaktů. Zadejte jedno nebo více písmen a vyhledejte kontakt. Pomocí <keycap function="down"/> přejděte na další výsledek, nebo <keycap function="up"/> přejděte na předchozí výsledek.
de: Wenn Ihre Kontaktliste sehr lang ist, sind Kontakte möglicherweise schwer zu finden. Verwenden Sie <keycombo> <keycap function="control"/> <keycap> F </ keycap> </keycombo>, um ein Suchfeld am Ende der Kontaktliste zu öffnen. Geben Sie einen oder mehrere Buchstaben ein, um einen Kontakt zu finden. Verwenden Sie <keycap function="down"/>, um zum nächsten Ergebnis zu gelangen, oder <keycap function="up"/>, um zum vorherigen Ergebnis zu gelangen.

source: For More Information
cs: Další informace
de: Für mehr Informationen

source: This chapter only explains the basic configuration and usage option of Pidgin. For more information, click <menuchoice> <guimenu>Help</guimenu> <guimenu>Online Help</guimenu> </menuchoice> to open the FAQs in a browser.
cs: Tato kapitola vysvětluje pouze základní konfiguraci a možnosti použití programu Pidgin. Další informace získáte kliknutím na <menuchoice> <guimenu>Nápověda</guimenu> <guimenu>Online nápověda</guimenu> </menuchoice> a otevřete Často kladené otázky (FAQ) v prohlížeči.
de: In diesem Kapitel werden nur die grundlegenden Konfigurations- und Verwendungsoptionen von Pidgin erläutert. Für weitere Informationen klicken Sie auf <menuchoice> <guimenu> Hilfe </guimenu> <guimenu> Online-Hilfe </guimenu> </menuchoice>, um die FAQs in einem Browser zu öffnen.

source: For updates about new features and for the latest information, refer to the home page of the project at <link xlink:href="https://pidgin.im/"/>.
cs: Aktualizace nových funkcí a nejnovější informace najdete na domovské stránce projektu na <link xlink:href="https://pidgin.im/"/>.
de: Aktualisierungen zu neuen Funktionen und die neuesten Informationen finden Sie auf der Homepage des Projekts unter <link xlink: href="https://pidgin.im/"/>.
