Repository: openSUSE/doc-sle-translations
Catalog: */po/apps_firefox.*.po
Languages: cs, de

source: To add tags to a bookmark, open the bookmark in Firefox and click the yellow star in the location bar. The <guimenu>Edit This Bookmark</guimenu> dialog opens where you can add a comma separated list of tags. It is also possible to add tags via the bookmark's properties dialog which you can open in the library or by right-clicking a bookmark in the menu or the toolbar.
cs: Chcete-li k záložce přidat značky, otevřete záložku v prohlížeči Firefox a klikněte na žlutou hvězdu na panelu umístění. Otevře se dialogové okno <guimenu>Úprava této záložky</guimenu>, kde můžete přidat seznam značek oddělených čárkami. Značky lze také přidat prostřednictvím dialogu vlastností záložky, který můžete otevřít v knihovně nebo klepnutím pravým tlačítkem myši na záložku v nabídce nebo na panelu nástrojů.
de: Um Tags zu einem Lesezeichen hinzuzufügen, öffnen Sie das Lesezeichen in Firefox und klicken Sie auf den gelben Stern in der Positionsleiste. Das Dialogfeld <guimenu>Dieses Lesezeichen bearbeiten</guimenu> öffnet sich, in dem Sie eine durch Kommata getrennte Liste von Tags hinzufügen können. Es ist auch möglich, Tags über den Eigenschaften-Dialog des Lesezeichens hinzuzufügen, den Sie in der Bibliothek öffnen können, oder indem Sie mit der rechten Maustaste auf ein Lesezeichen im Menü oder in der Symbolleiste klicken.

source: Importing and Exporting Bookmarks
cs: Import a export záložek
de: Importieren und Exportieren von Lesezeichen

source: To import bookmarks from another browser or from a file in HTML format, open the library by choosing from the menu bar, <menuchoice> <guimenu>Bookmarks</guimenu> <guimenu>Show All Bookmarks</guimenu> </menuchoice>. To start the Import Wizard, click <menuchoice> <guimenu>Import and Backup</guimenu> <guimenu>Import Bookmarks from HTML</guimenu> </menuchoice> and choose an import location. Start the import by clicking <guimenu>Next</guimenu>. Imports from an HTML file are imported as is.
cs: Chcete-li importovat záložky z jiného prohlížeče nebo ze souboru ve formátu HTML, otevřete knihovnu výběrem z panelu nabídek <menuchoice> <guimenu>Záložky</guimenu> <guimenu>Zobrazit všechny záložky</guimenu> </menuchoice>. Chcete-li spustit Průvodce importem, klikněte v okně knihovny na <menuchoice> <guimenu>Import a záloha</guimenu> <guimenu>Importovat záložky z HTML</guimenu> </menuchoice> a vyberte umístění importu. Zahajte import kliknutím na <guimenu>Další</guimenu>. Vstup ze souboru HTML se importuje bez úprav.
de: Um Lesezeichen aus einem anderen Browser oder aus einer Datei im HTML-Format zu importieren, öffnen Sie die Bibliothek, indem Sie in der Menüleiste <menuchoice> <guimenu>Lesezeichen</guimenu> <guimenu> Alle Lesezeichen anzeigen</guimenu> </menuchoice> wählen. Um den Import-Assistenten zu starten, klicken Sie auf <menuchoice> <guimenu>Import und Sicherung</guimenu> <guimenu>Lesezeichen aus HTML importieren</guimenu> </menuchoice> und wählen Sie einen Importort. Starten Sie den Import, indem Sie auf <guimenu>Weiter</guimenu> klicken. Importe aus einer HTML-Datei werden unverändert importiert.

source: Exporting bookmarks is also done via <guimenu>Import and Backup</guimenu> in the library window. To save your bookmarks as an HTML file, choose <guimenu>Export Boomarks to HTML</guimenu>. To create a backup of your bookmarks, choose <guimenu>Backup</guimenu>. Firefox uses a JavaScript Object Notation file format (<filename>.json</filename>) for backups.
cs: Export záložek se provádí také pomocí <guimenu>Import a záloha</guimenu> v okně knihovny. Chcete-li uložit záložky jako soubor HTML, zvolte <guimenu>Exportovat záložky do HTML</guimenu>. Chcete-li vytvořit zálohu záložek, zvolte <guimenu>Záloha</guimenu>. Firefox používá pro zálohování formát souboru JavaScript Object Notation (<filename>.json</filename>).
de: Das Exportieren von Lesezeichen erfolgt ebenfalls über <guimenu>Import und Backup</guimenu> im Bibliotheksfenster. Um Ihre Lesezeichen als HTML-Datei zu sichern, wählen Sie <guimenu>Lesezeichen nach HTML exportieren</guimenu>. Um ein Backup Ihrer Lesezeichen zu erstellen, wählen Sie <guimenu>Backup</guimenu>. Firefox verwendet ein JavaScript Object Notation-Dateiformat (<filename>.json</filename>) für Sicherungen.

source: To restore a bookmark backup, click <menuchoice><guimenu>Import and Backup</guimenu> <guimenu>Restore</guimenu></menuchoice>. Then locate the backup you want to restore from.
cs: Chcete-li obnovit zálohu záložek, klikněte na <menuchoice><guimenu>Import a záloha</guimenu> <guimenu>Obnova</guimenu></menuchoice>. Vyhledejte soubor zálohy, ze které chcete obnovit.
de: Um ein Lesezeichen-Backup wiederherzustellen, klicken Sie auf <menuchoice><guimenu>Importieren und sichern</guimenu> <guimenu>Wiederherstellen</guimenu></menuchoice>. Suchen Sie dann die Sicherung, von der Sie wiederherstellen möchten.

source: Live Bookmarks
cs: Živé záložky

source: Live Bookmarks display headlines in your bookmark menu and keep you up to date with the latest news. This enables you to save time with one glance at your favorite sites. Live bookmarks update automatically. Many sites and blogs support this format.
cs: Živé záložky zobrazují titulky zpráv v nabídce záložek a průběžně vás informují o nejnovějších zprávách. To vám umožní ušetřit čas jediným pohledem na vašich oblíbených webech. Živé záložky se aktualizují automaticky. Tento formát podporuje mnoho webů a blogů.
de: Live Bookmarks zeigen Schlagzeilen in Ihrem Lesezeichen-Menü an und halten Sie über die neuesten Nachrichten auf dem Laufenden. So können Sie mit einem Blick auf Ihre Lieblingsseiten Zeit sparen. Live-Lesezeichen werden automatisch aktualisiert. Viele Websites und Blogs unterstützen dieses Format.

source: To create a Live Bookmark, look for orange buttons on Web sites that either read <literal>RSS</literal> or consist of a dot and three nested quarter circles. Click the icon. Usually, that will lead you to a page where all the headlines of the page are displayed. On that page, choose <guimenu>Subscribe Now</guimenu>. A dialog opens in which to select the name and location of your live bookmark. Confirm with <guimenu>Add</guimenu>. This page also lets you choose alternative applications to subscribe with, such as <guimenu>My Yahoo</guimenu>.
cs: Chcete-li vytvořit živou záložku, podívejte se na oranžová tlačítka na webech buď s nápisem <literal>RSS</literal>, nebo s ikonou tečky a tří vnořených čtvrtkruhů. Klikněte na ikonu. To obvykle vede na stránku, kde jsou zobrazeny všechny nadpisy stránky. Na této stránce zvolte <guimenu>Přihlásit se nyní</guimenu>. Otevře se dialogové okno, ve kterém můžete vybrat název a umístění živé záložky. Potvrďte pomocí <guimenu>Přidat</guimenu>. Tato stránka vám také umožňuje zvolit alternativní aplikace, k jejichž odběru se můžete přihlásit, například <guimenu>Moje Yahoo</guimenu>.
de: Um ein Live-Lesezeichen zu erstellen, suchen Sie auf Websites nach orangefarbenen Schaltflächen, die entweder <literal>RSS</literal> lauten oder aus einem Punkt und drei verschachtelten Viertelkreisen bestehen. Klicken Sie auf das Symbol. Normalerweise führt Sie das zu einer Seite, auf der alle Überschriften der Seite angezeigt werden. Wählen Sie auf dieser Seite <guimenu>Jetzt abonnieren</guimenu>. Es öffnet sich ein Dialog, in dem Sie den Namen und den Ort Ihres Live-Lesezeichens auswählen können. Bestätigen Sie mit <guimenu>Hinzufügen</guimenu>. Auf dieser Seite können Sie auch alternative Anwendungen zum Abonnieren auswählen, wie z.B. <guimenu>Mein Yahoo</guimenu>.

source: Smart Bookmark Folders
cs: Složky inteligentních záložek

source: Smart bookmark folders are virtual bookmark folders that are dynamically updated. There are three smart bookmark folders: The <guimenu>Most Visited</guimenu> links are available from your bookmarks toolbar. <guimenu>Recently Bookmarked</guimenu> links and <guimenu>Recent Tags</guimenu> are located in the bookmarks menu.
cs: Složky inteligentních záložek jsou virtuální složky záložek, které jsou dynamicky aktualizovány. Existují tři složky inteligentních záložek: Odkazy <guimenu>Nejnavštěvovanější</guimenu> jsou k dispozici na panelu nástrojů záložek. Odkazy <guimenu>Naposledy přidané</guimenu> a <guimenu>Poslední štítky</guimenu> jsou umístěny v nabídce záložek.

source: The Bookmarks Toolbar
cs: (Nástrojová) Lišta záložek

source: The <literal>Bookmarks Toolbar</literal> is displayed beneath the location bar and lets you quickly access bookmarks. You can also add, organize, and edit bookmarks directly. By default, the <literal>Bookmarks Toolbar</literal> is populated with a predefined set of bookmarks organized into several folders (see <xref linkend="fig.firefox.main"/>).
cs: Pod panelem umístění se zobrazí <literal>Lišta záložek</literal>, která umožňuje rychlý přístup k záložkám. Můžete také přidávat, organizovat a upravovat záložky přímo. Ve výchozím nastavení je <literal>Lišta záložek</literal> naplněna předem definovanou sadou záložek uspořádaných do několika složek (viz <xref linkend="fig.firefox.main"/>).
de: Die <literal>Lesezeichen-Symbolleiste</literal> wird unterhalb der Positionsleiste angezeigt und ermöglicht Ihnen den schnellen Zugriff auf Lesezeichen. Sie können Lesezeichen auch direkt hinzufügen, organisieren und bearbeiten. Standardmäßig ist die <literal>Lesezeichen-Symbolleiste</literal> mit einem vordefinierten Satz von Lesezeichen gefüllt, die in mehreren Ordnern organisiert sind (siehe <xref linkend="fig.firefox.main"/>).

source: To manage the <literal>Bookmarks Toolbar</literal> you can use the library as described in <xref linkend="sec.firefox.bookmarks.organise"/>. Its content is located in the folder <guimenu>Bookmarks Toolbar</guimenu>. It is also possible to manage the toolbar directly. To add a folder, bookmark, or separator, right-click an empty space in the toolbar and select the appropriate entry from the pop-up menu. To add the current page to the bar, click the icon of the Web page in the location bar and drag it to the desired position on the bookmarks toolbar. Hovering over an existing bookmark folder will automatically open it, enabling you to place the bookmark within this folder.
cs: Chcete-li spravovat <literal>Lištu záložek</literal>, můžete použít knihovnu, jak je popsáno v <xref linkend="sec.firefox.bookmarks.organise"/>. Její obsah je umístěn ve složce <guimenu>Bookmarks Toolbar</guimenu> (Panel nástrojů záložek). Je také možné spravovat panel nástrojů přímo. Chcete-li přidat složku, záložku nebo oddělovač, klepněte pravým tlačítkem myši na prázdné místo na panelu nástrojů a vyberte příslušnou položku z rozbalovací nabídky. Chcete-li přidat aktuální stránku na lištu, klikněte na ikonu webové stránky na panelu umístění a přetáhněte ji na požadované místo na panelu nástrojů záložek. Umístěním kurzoru na existující složku záložek se ta automaticky otevře, což vám umožní umístit záložku do této složky.

source: To manage a certain folder or bookmark, right-click it. A menu opens which lets you <guimenu>Delete</guimenu> it or change its <guimenu>Properties</guimenu>. To move or copy an entry, choose <guimenu>Cut</guimenu> or <guimenu>Copy</guimenu> and <guimenu>Paste</guimenu> it to the desired position.
cs: Chcete-li spravovat určitou složku nebo záložku, klepněte na ni pravým tlačítkem. Otevře se nabídka, která vám umožní <guimenu>Odstranit</guimenu> nebo změnit její <guimenu>Vlastnosti</guimenu>. Chcete-li položku přesunout nebo zkopírovat, vyberte <guimenu>Vyjmout</guimenu> nebo <guimenu>Kopírovat</guimenu> a pak <guimenu>Vložit</guimenu> na požadované místo.
de: Um einen bestimmten Ordner oder ein Lesezeichen zu verwalten, klicken Sie mit der rechten Maustaste darauf. Es öffnet sich ein Menü, in dem Sie <guimenu>Löschen</guimenu> es oder seine <guimenu>Eigenschaften</guimenu> ändern können. Um einen Eintrag zu verschieben oder zu kopieren, wählen Sie <guimenu>Ausschneiden</guimenu> oder <guimenu>Kopieren</guimenu> und <guimenu>Einfügen</guimenu> ihn an die gewünschte Stelle.

source: Using the Download Manager
cs: Použití Správce stahování
de: Verwendung des Download-Managers

source: Keep track of your current and past downloads with the download manager. To start the download manager, in the menu bar, click <menuchoice> <guimenu>Tools</guimenu> <guimenu>Downloads</guimenu> </menuchoice>. While downloading a file, a progress bar indicates the download status. If necessary, pause the download and resume it later. To open a downloaded file with the associated application, click <guimenu>Open</guimenu>. To open the location to which the file was saved, choose <guimenu>Open Containing Folder</guimenu>. <guimenu>Remove From History</guimenu> only deletes the entry from the download manager, however, it does not delete the file from the hard disk.
cs: Sledujte své aktuální a minulé stahování pomocí správce stahování. Chcete-li spustit Správce stahování, klikněte na panelu nabídek na ikonu <menuchoice> <guimenu>Nástroje</guimenu> <guimenu>Stahování</guimenu> </menuchoice>. Během stahování souboru zobrazuje indikátor průběhu stav stahování. V případě potřeby pozdržte stahování a pokračujte později. Chcete-li otevřít stažený soubor přidruženou aplikací, klikněte na <guimenu>Otevřít</guimenu>. Chcete-li otevřít umístění, kam byl soubor uložen, zvolte <guimenu>Otevřít obsahující složku</guimenu>. <guimenu>Odstranit z historie</guimenu> odstraní položku pouze ze Správce stahování, ale neodstraní soubor z pevného disku.
de: Behalten Sie mit dem Download-Manager den Überblick über Ihre aktuellen und vergangenen Downloads. Um den Download-Manager zu starten, klicken Sie in der Menüleiste auf <menuchoice> <guimenu>Extras</guimenu> <guimenu>Downloads</guimenu> </menuchoice>. Während des Herunterladens einer Datei zeigt ein Fortschrittsbalken den Download-Status an. Unterbrechen Sie gegebenenfalls den Download und setzen Sie ihn später fort. Um eine heruntergeladene Datei mit der zugehörigen Anwendung zu öffnen, klicken Sie auf <guimenu>Öffnen</guimenu>. Um den Speicherort zu öffnen, an dem die Datei gespeichert wurde, wählen Sie <guimenu>Ziel-Ordner öffnen</guimenu>. <guimenu>Aus Chronik entfernen</guimenu> löscht nur den Eintrag aus dem Download-Manager, löscht aber nicht die Datei von der Festplatte.

source: By default, all files are downloaded to <filename>~/Downloads</filename>. To change this behavior, in the menu bar, click <menuchoice> <guimenu>Edit</guimenu> <guimenu>Preferences</guimenu> </menuchoice>. Go to <guimenu>General</guimenu>. Under <guimenu>Downloads</guimenu>, either choose another location or <guimenu>Always ask me where to save files</guimenu>.
cs: Výchozí cíl ukládání stahovaných souborů je <filename>~/Downloads</filename> (Stažené). To lze změnit v hlavním menu: klikněte <menuchoice> <guimenu>Úpravy</guimenu>, <guimenu>Předvolby</guimenu> </menuchoice>. Najděte menu <guimenu>Obecné</guimenu>. Pod nadpisem <guimenu>Stahování</guimenu> buď zvolte jiný cíl nebo <guimenu>U každého souboru se zeptat, kam ho uložit</guimenu>.
de: Standardmäßig werden alle Dateien unter <filename>~/Downloads</filename> heruntergeladen. Um dieses Verhalten zu ändern, klicken Sie in der Menüleiste auf <menuchoice><guimenu>Bearbeiten</guimenu> <guimenu>Einstellungen</guimenu> </menuchoice>. Gehen Sie zu <guimenu>Allgemein</guimenu>. Wählen Sie unter <guimenu>Downloads</guimenu> entweder einen anderen Speicherort oder <guimenu>Jedes Mal nachfragen, wo eine Datei gespeichert werden soll</guimenu>.

source: Resuming Downloads
cs: Pokračovat ve stahování
de: Downloads fortsetzen

source: If your browser crashes or is closed while downloading, all pending downloads will automatically be resumed in the background when starting Firefox the next time. A download that was paused before the browser was closed can manually be resumed via the download manager.
cs: Pokud během stahování prohlížeč havaruje nebo se ukončí, budou při příštím spuštění aplikace Firefox automaticky obnovena všechna čekající stahování. Stahování, které bylo pozastaveno před zavřením prohlížeče, lze ručně obnovit správcem stahování.
de: Wenn Ihr Browser während des Herunterladens abstürzt oder geschlossen wird, werden alle ausstehenden Downloads automatisch im Hintergrund fortgesetzt, wenn Firefox das nächste Mal gestartet wird. Ein Download, der vor dem Schließen des Browsers angehalten wurde, kann manuell über den Download-Manager wieder aufgenommen werden.

source: Security
cs: Zabezpečení
de: Sicherheit

source: Since browsing the Internet has become more risky, Firefox offers various measures to make browsing safer. It automatically checks whether you are trying to access a site known to contain harmful software (malware) or a site known to steal sensitive data (phishing) and stops you from entering these sites. The Instant Web Site ID lets you easily check a site's legitimacy, and a password manager and the pop-up blocker offer additional security. With Private Browsing, you can surf the Internet without Firefox recording data on your computer.
cs: Protože se procházení Internetu stalo rizikovějším, nabízí Firefox různá opatření, která zvyšují bezpečnost procházení. Automaticky zkontroluje, zda se pokoušíte vstoupit na web, o kterém je známo, že obsahuje škodlivý software (malware) nebo na web, o kterém je známo, že krade citlivá data (phishing), a zabrání vám v přístupu na tyto stránky. Okamžitý ID webového serveru (Instant Web Site ID) umožňuje snadno zkontrolovat legitimitu webu; správce hesel a blokování vyskakovacích oken nabízejí další zabezpečení. Se soukromým prohlížením (Private Browsing) surfujete po internetu, aniž Firefox zapisuje jakákoli data do počítače.
de: Da das Surfen im Internet risikoreicher geworden ist, bietet Firefox verschiedene Maßnahmen an, um das Surfen sicherer zu machen. Er überprüft automatisch, ob Sie versuchen, auf eine Website zuzugreifen, von der bekannt ist, dass sie schädliche Software (Malware) enthält, oder auf eine Website, von der bekannt ist, dass sie sensible Daten stiehlt (Phishing), und hält Sie davon ab, diese Websites zu betreten. Mit der Instant-Web-Site-ID können Sie die Legitimität einer Site leicht überprüfen, und ein Passwortmanager und der Pop-up-Blocker bieten zusätzliche Sicherheit. Mit Private Browsing können Sie im Internet surfen, ohne dass Firefox Daten auf Ihrem Computer aufzeichnet.

source: Firefox allows you to check the identity of a Web page with a single glance. The icon in the location bar next to the address indicates which identity information is available and whether communication is encrypted:
cs: Firefox vám umožňuje zkontrolovat identitu webové stránky jediným pohledem. Ikona v panelu umístění vedle adresy označuje, které informace o identitě jsou k dispozici a zda je komunikace šifrována:
de: Mit Firefox können Sie die Identität einer Webseite mit einem einzigen Blick überprüfen. Das Symbol in der Standortleiste neben der Adresse zeigt an, welche Identitätsinformationen verfügbar sind und ob die Kommunikation verschlüsselt ist:

source: Gray Globe
cs: Šedý glóbus

source: The site does not provide any identity information and communication between Web server and browser is not encrypted. Do not exchange sensitive information with such sites.
cs: Stránka neposkytuje žádné informace o totožnosti a komunikace mezi webovým serverem a prohlížečem není šifrována. S těmito weby si nevyměňujte citlivé informace.
de: Die Website bietet keine Identitätsinformationen, und die Kommunikation zwischen Webserver und Browser ist nicht verschlüsselt. Tauschen Sie keine sensiblen Informationen mit solchen Websites aus.

source: Gray Triangle
cs: Šedý trojúhelník
de: Graues Dreieck

source: This site is from a domain that has been verified by a certificate, so you can be sure that you are really connected to the very site it claims to be. However, the site tried to load additional elements, such as images or scripts over an insecure connection. Firefox has blocked these items. Therefore, the page can look broken.
cs: Tento web pochází z domény, která byla ověřena certifikátem, takže si můžete být jisti, že jste skutečně připojeni k tomu webu, za který se prohlašuje. Web se však pokusil načíst další prvky, například obrázky nebo skripty, přes nezabezpečené připojení. Firefox tyto položky zablokoval. Stránka proto může vypadat rozbitá.
de: Diese Website stammt von einer Domain, die durch ein Zertifikat verifiziert wurde, so dass Sie sicher sein können, dass Sie wirklich mit genau der Website verbunden sind, für die sie sich ausgibt. Die Site hat jedoch versucht, zusätzliche Elemente wie Bilder oder Skripte über eine unsichere Verbindung zu laden. Firefox hat diese Elemente blockiert. Daher kann die Seite defekt aussehen.

source: Gray Padlock
cs: Šedý visací zámek
de: Graues Vorhängeschloss

source: This site is from a domain that has been verified by a certificate, so you can be sure that you are really connected to the very site it claims to be. Communication with a <quote>gray-padlock</quote> site is always encrypted.
cs: Tento web pochází z domény, která byla ověřena certifikátem, takže si můžete být jisti, že jste skutečně připojeni k tomu webu, za který se sám prohlašuje. Komunikace s webem s označením <quote>šedý zámek</quote> je vždy šifrována.

source: Green Padlock
cs: Zelený visací zámek
de: Grünes Vorhängeschloss

source: This site completely identifies itself by a certificate that ensures a site is owned by the person or organization it claims to be. This is especially important when exchanging very sensitive data (for example when doing money transactions over the Internet). In this case you can be sure to be on the Web site of your bank when it sends complete identity information. Communication with a <quote>green-padlock</quote> server is always encrypted.
cs: Tato stránka se zcela identifikuje certifikátem, který zajišťuje, že je web ve vlastnictví osoby nebo organizace, za niž se prohlašuje. To je zvláště důležité při výměně velmi citlivých dat (například při provádění peněžních transakcí přes internet - v takovém případě si můžete být jisti, že jste při odesílání úplných informací o totožnosti na webu své banky.) Komunikace se serverem <quote>zelený zámek</quote> je vždy šifrována.
de: Diese Site identifiziert sich vollständig durch ein Zertifikat, das sicherstellt, dass eine Site der Person oder Organisation gehört, für die sie sich ausgibt. Dies ist besonders wichtig beim Austausch sehr sensibler Daten (z.B. bei Geldtransaktionen über das Internet). In diesem Fall können Sie sicher sein, dass Sie sich auf der Website Ihrer Bank befinden, wenn diese vollständige Identitätsinformationen sendet. Die Kommunikation mit einem <quote>Grünes-Vorhängeschloss</quote>-Server ist immer verschlüsselt.

source: To view detailed identity information, click the icon of the Web site in the location bar. In the opening pop-up, click <guimenu>More Information</guimenu> to open the <guimenu>Page Info</guimenu> window. Here, you can view the site's certificate, the encryption level, and information about stored passwords and cookies.
cs: Chcete-li zobrazit podrobné informace o identitě, klikněte na ikonu webu na liště umístění. V úvodním vyskakovacím okně klikněte <guimenu>Další informace</guimenu> a otevřete okno <guimenu>Informace o stránce</guimenu>. Zde si můžete prohlédnout certifikát webu, úroveň šifrování a informace o uložených heslech a cookies.
de: Um detaillierte Identitätsinformationen anzuzeigen, klicken Sie auf das Symbol der Website in der Standortleiste. Klicken Sie im sich öffnenden Pop-up-Fenster auf <guimenu>Weitere Informationen</guimenu>, um das Fenster <guimenu>Seiteninfo</guimenu> zu öffnen. Hier können Sie das Zertifikat der Website, den Verschlüsselungsgrad und Informationen über gespeicherte Passwörter und Cookies einsehen.
