Repository: openSUSE/doc-sle-translations
Catalog: */po/apps_firefox.*.po
Languages: cs, de

source: With the <guimenu>Permissions</guimenu> view you can set per-site permissions for image loading, pop-ups, cookies and installation permissions. The <guimenu>Media</guimenu> view lists all images, background graphics and embedded objects from a site and displays further information on each item together with a preview. It also lets you save individual items.
cs: V zobrazení <guimenu>Oprávnění</guimenu> můžete nastavit oprávnění pro jednotlivé stránky pro načítání obrázků, vyskakovací okna, soubory cookie a oprávnění k instalaci. Zobrazení <guimenu>Média</guimenu> uvádí všechny obrázky, grafiku na pozadí a vložené objekty z webu a zobrazuje další informace o každé položce spolu s náhledem. Umožňuje také ukládat jednotlivé položky.
de: Mit der Ansicht <guimenu>Berechtigungen</guimenu> können Sie pro Site Berechtigungen für das Laden von Bildern, Pop-ups, Cookies und Installationsberechtigungen festlegen. Die Ansicht <guimenu>Medien</guimenu> listet alle Bilder, Hintergrundgrafiken und eingebetteten Objekte einer Site auf und zeigt weitere Informationen zu jedem Objekt zusammen mit einer Vorschau an. Sie können auch einzelne Objekte speichern.

source: The Firefox Page Info Window
cs: Firefox - okno informací o stránce

source: Importing Certificates
cs: Import certifikátů
de: Importieren von Zertifikaten

source: Firefox comes with a certificate store for identifying certificate authorities (CA). Using these certificates enables the browser to automatically verify certificates issued by Web sites. If a Web site issues a certificate that has not been signed by one of the CAs from the certificate store, it is not trusted. This ensures that no spoofed certificates are accepted.
cs: Firefox je dodáván s úložištěm certifikátů pro identifikaci certifikačních autorit (CA). Použití těchto certifikátů umožňuje prohlížeči automaticky ověřovat certifikáty vydané webovými servery. Pokud webový server vydá certifikát, který nebyl podepsán jedním z certifikačních autorit z úložiště certifikátů, není důvěryhodný. Tím je zajištěno, že nebudou přijímány žádné falešné certifikáty.
de: Firefox wird mit einem Zertifikatsspeicher zur Identifizierung von Zertifizierungsstellen (CA) geliefert. Die Verwendung dieser Zertifikate ermöglicht es dem Browser, von Websites ausgestellte Zertifikate automatisch zu überprüfen. Wenn eine Website ein Zertifikat ausstellt, das nicht von einer der CAs aus dem Zertifikatsspeicher signiert wurde, ist es nicht vertrauenswürdig. Dadurch wird sichergestellt, dass keine gefälschten Zertifikate akzeptiert werden.

source: Large organizations usually use their own certificate authorities in-house and distribute the respective certificates via the system-wide certificate store located at <filename>/etc/pki/nssdb</filename>. To configure Firefox (and other Mozilla tools, such as Thunderbird) to use this system-wide CA store in addition to its own, export the <envar>NSS_USE_SHARED_DB</envar> variable. For example, you can add the following line to <filename>~/.bashrc</filename>:
cs: Velké organizace obvykle používají vlastní interní certifikační autority a distribuují příslušné certifikáty prostřednictvím úložiště certifikátů pro celý systém, umístěného na <filename>/etc/pki/nssdb</filename>. Chcete-li zkonfigurovat Firefox (a další nástroje Mozilla, například Thunderbird) tak, aby používal toto systémové úložiště CA kromě svého vlastního, exportujte proměnnou <envar>NSS_USE_SHARED_DB</envar>. Můžete například přidat následující řádek do <filename>~/.bashrc</filename>:
de: Große Organisationen verwenden in der Regel ihre eigenen Zertifizierungsstellen intern und verteilen die entsprechenden Zertifikate über den systemweiten Zertifikatsspeicher unter <filename>/etc/pki/nssdb</filename>. Um Firefox (und andere Mozilla-Tools, wie z.B. Thunderbird) so zu konfigurieren, dass dieser systemweite CA-Speicher zusätzlich zu seinem eigenen verwendet wird, exportieren Sie die Variable <envar>NSS_USE_SHARED_DB</envar>. Sie können zum Beispiel die folgende Zeile zu <filename>~/.bashrc</filename> hinzufügen:

source: Alternatively or additionally you can manually import certificates. To do so, in the menu bar, open the <guimenu>Preferences</guimenu> dialog by clicking <menuchoice><guimenu>Edit</guimenu><guimenu>Preferences</guimenu> </menuchoice>. Select <menuchoice><guimenu>Advanced</guimenu> <guimenu>Certificates</guimenu><guimenu>View Certificates</guimenu> <guimenu>Your Certificates</guimenu><guimenu>Import</guimenu></menuchoice> and select the certificate to import. Only import certificates you absolutely trust!
cs: Alternativně nebo navíc můžete certifikáty importovat ručně. Chcete-li tak učinit, otevřete v panelu nabídek dialogové okno <guimenu>Předvolby</guimenu> kliknutím na <menuchoice><guimenu>Úpravy</guimenu> <guimenu>Předvolby</guimenu> </menuchoice>. Vyberte <menuchoice> <guimenu>Upřesnit</guimenu> <guimenu>Certifikáty</guimenu> <guimenu>Zobrazit certifikáty</guimenu> <guimenu>Vaše certifikáty</guimenu> <guimenu>Importovat</guimenu> </menuchoice> a vyberte certifikát, který chcete importovat. Importujte pouze certifikáty, kterým naprosto důvěřujete!

source: Password Management
cs: Správa hesel

source: Each time you enter a user name and a password on a Web site, Firefox offers to store this data. A pop-up at the top of the page opens, asking you whether you want Firefox to remember the password. If you accept by clicking <guimenu>Remember</guimenu>, the password will be stored on your hard disk in an encrypted format. The next time you access this site, Firefox will automatically fill in the login data.
cs: Při každém zadání uživatelského jména a hesla na webu nabízí Firefox uložení těchto údajů. V horní části stránky se otevře vyskakovací okno s dotazem, zda chcete, aby si Firefox zapamatoval heslo. Pokud souhlasíte kliknutím na <guimenu>Zapamatovat</guimenu>, heslo bude uloženo na pevný disk v šifrovaném formátu. Při příštím přístupu na tento web Firefox automaticky vyplní přihlašovací údaje.

source: To review or manage your passwords, open the password manager by clicking <menuchoice> <guimenu>Edit</guimenu> <guimenu>Preferences</guimenu> <guimenu>Security</guimenu> <guimenu>Saved Passwords</guimenu> </menuchoice> in the menu bar. The password manager opens with a list of sites and their corresponding user names. By default, the passwords are not displayed. You can click <guimenu>Show Passwords</guimenu> to display them. To delete single or all entries from the list, click <guimenu>Remove</guimenu> or <guimenu>Remove All</guimenu>, respectively.
cs: Chcete-li zkontrolovat nebo spravovat svá hesla, otevřete správce hesel kliknutím na <menuchoice> <guimenu>Úpravy</guimenu> <guimenu>Předvolby</guimenu> <guimenu>Zabezpečení</guimenu> <guimenu>Uložená hesla</guimenu></menuchoice> v panelu nabídek. Otevře se správce hesel se seznamem webů a jejich odpovídajícími uživatelskými jmény. Ve výchozím nastavení se hesla nezobrazují. Kliknutím na <guimenu>Ukázat hesla</guimenu> hesla zobrazíte. Chcete-li odstranit jednotlivé nebo všechny položky ze seznamu, klikněte na <guimenu>Odstranit</guimenu> nebo <guimenu>Odstranit vše</guimenu>.

source: To protect your passwords from unauthorized access, you can set a master password that is required when managing or adding passwords. In the menu bar, click <menuchoice><guimenu>Edit</guimenu> <guimenu>Preferences</guimenu></menuchoice>, choose the category <guimenu>Security</guimenu> and activate <guimenu>Use a Master Password</guimenu>.
cs: Chcete-li chránit svá hesla před neoprávněným přístupem, můžete nastavit hlavní heslo, které je vyžadováno při správě nebo přidávání hesel. Na panelu nabídek klikněte na <menuchoice> <guimenu>Úpravy</guimenu> <guimenu>Předvolby</guimenu> </menuchoice>, vyberte kategorii <guimenu>Zabezpečení</guimenu> a aktivujte <guimenu>Použít hlavní heslo</guimenu>.
de: Um Ihre Passwörter vor unbefugtem Zugriff zu schützen, können Sie ein Master-Passwort festlegen, das beim Verwalten oder Hinzufügen von Passwörtern erforderlich ist. Klicken Sie in der Menüleiste auf <menuchoice><guimenu>Bearbeiten</guimenu> <guimenu>Einstellungen</guimenu></menuchoice>, wählen Sie die Kategorie <guimenu>Datenschutz & Sicherheit</guimenu> und aktivieren Sie <guimenu>Master-Passwort verwenden</guimenu>.

source: Private Browsing
cs: Soukromé prohlížení

source: By default, Firefox keeps track of your browsing history by storing content and links of visited Web sites, cookies, downloads, passwords, search terms and formula data. Collecting and storing this data makes browsing faster and more convenient. However, when you use a public terminal or a friend's computer, for example, you could turn this behavior off. In Private Browsing mode Firefox will not keep track of your browsing history nor will it cache the content of pages you have visited.
cs: Ve výchozím nastavení Firefox sleduje vaši historii prohlížení ukládáním obsahu a odkazů navštěvovaných webových stránek, souborů cookie, stahování, hesel, hledaných výrazů a vzorců. Shromažďování a ukládání těchto údajů umožňuje rychlejší a pohodlnější prohlížení. Pokud například používáte veřejný terminál nebo počítač přítele, můžete toto chování vypnout. V režimu soukromého prohlížení nebude Firefox sledovat vaši historii prohlížení ani nebude ukládat do mezipaměti obsah stránek, které jste navštívili.

source: To enable the Private Browsing mode, in the menu bar, click <menuchoice><guimenu>File</guimenu> <guimenu>New Private Window</guimenu></menuchoice>. The current Web site and all open tabs will be replaced by the Private Browsing information screen. As long as you will browse in private mode, the string <literal>(Private Browsing)</literal> will be displayed in the titlebar of the window.
cs: Chcete-li povolit režim soukromého prohlížení, v panelu nabídek klikněte na <menuchoice> <guimenu>Soubor</guimenu> <guimenu>Nové soukromé okno</guimenu> </menuchoice>. Aktuální web a všechny otevřené karty budou nahrazeny obrazovkou s informacemi o soukromém prohlížení. Pokud budete brouzdat v soukromém režimu, zobrazí se v záhlaví okna řetězec <literal>(Soukromé prohlížení)</literal>.

source: Disable Private Browsing by closing the private window.
cs: Soukromé prohlížení ukončíte zavřením soukromého okna.

source: To make Private Browsing the default mode, open the <guimenu>Privacy</guimenu> tab in the Preference window as described in <xref linkend="sec.firefox.preferences"/>, set the option <guimenu>Firefox will:</guimenu> to <guimenu>Use custom settings for history</guimenu> and then choose <guimenu>Always use private browsing mode</guimenu>.
cs: Chcete-li nastavit soukromé prohlížení jako výchozí režim, otevřete kartu <guimenu>Soukromí</guimenu> v okně Předvolby, jak je popsáno v <xref linkend="sec.firefox.preferences"/> a nastavte možnost <guimenu>Firefox bude:</guimenu> na <guimenu>Používat přizpůsobení pro historii</guimenu> a pak zvolte <guimenu>Vždy použít režim soukromého prohlížení</guimenu>.

source: Bookmarks and Downloads
cs: Záložky a stahování

source: Downloads and bookmarks you made during Private Browsing mode will be kept.
cs: Stažené soubory a záložky, které jste vytvořili v režimu soukromého prohlížení, zůstanou zachovány.

source: Customizing Firefox
cs: Přizpůsobení Firefoxu

source: Firefox can be customized extensively.
cs: Firefox lze rozsáhle přizpůsobit.

source: Change the way Firefox behaves by altering its preferences.
cs: Změňte chování Firefoxu změnou jeho preferencí.

source: Add functionality by installing extensions.
cs: Přidejte funkčnost instalací doplňků.

source: Change the look and feel by installing themes.
cs: Instalací motivů změňte vzhled a dojem.

source: To manage extensions, themes and plug-ins, Firefox has an add-on manager.
cs: Na správu rozšíření, motivů a doplňků má Firefox správce přídavků.

source: Preferences
cs: Předvolby

source: Firefox offers a wide range of configuration options. These are available by choosing <menuchoice> <guimenu>Edit</guimenu> <guimenu>Preferences</guimenu> </menuchoice> in the menu bar. Each option is described in detail in the online help, which can be accessed by clicking the question mark icon in the dialog.
cs: Firefox nabízí širokou škálu možností konfigurace. Jsou k dispozici výběrem položky <menuchoice> <guimenu>Úpravy</guimenu> <guimenu>Předvolby</guimenu> </menuchoice> na panelu nabídek. Možnosti jsou podrobně popsány v online nápovědě, ke které se dostanete kliknutím na ikonu otazníku (Nápověda Firefoxu) v dialogu.

source: The Preferences Window
cs: Okno předvoleb

source: Session management
cs: Správa relace

source: By default, Firefox automatically restores your session—windows and tabs—only after it has crashed, or after a restart because of an extension. However, it can be configured to restore a session every time it is started: Open the Preferences dialog as described in <xref linkend="sec.firefox.preferences"/> and go to the category <guimenu>General</guimenu>. Set the option <guimenu>When Firefox Starts:</guimenu> to <guimenu>Show My Windows and Tabs from Last Time</guimenu>.
cs: Ve výchozím nastavení Firefox automaticky obnoví vaši relaci - okna a karty - pouze po havárii nebo po restartu kvůli rozšíření. Lze ho však nakonfigurovat tak, aby relaci obnovoval při každém spuštění: Otevřete dialogové okno Předvolby, jak je popsáno v <xref linkend="sec.firefox.preferences"/> a přejděte do kategorie <guimenu>Obecné</guimenu>. Nastavte možnost <guimenu>Při spuštění Firefoxu</guimenu> na <guimenu>Otevřít okna a záložky od posledně</guimenu>.

source: When you have multiple windows open they will only be restored the next time when you close all of them at once with <menuchoice> <guimenu>File</guimenu> <guimenu>Quit</guimenu> </menuchoice> (from the menu bar) or with <keycombo> <keycap function="control"/> <keycap>Q</keycap> </keycombo>. If you close the windows one by one, only the last window will be restored.
cs: Máte-li otevřeno více oken, budou obnovena až příště, když všechna zavřete najednou pomocí <menuchoice> <guimenu>Soubor</guimenu> <guimenu>Ukončit</guimenu> </menuchoice> (z lišty hlavního menu) nebo pomocí <keycombo> <keycap function="control"/> <keycap>Q</keycap> </keycombo>. Pokud okna zavřete jedno po druhém, obnoví se pouze poslední okno.

source: Language Preferences for Web Sites
cs: Jazykové preference pro webové stránky

source: When sending a request to a Web server, the browser always sends the information about which language is preferred by the user. Web sites that are available in more than one language (and are configured to evaluate this language parameter) will display their pages in the language the browser requests. On <phrase role="productname"><phrase os="osuse">openSUSE Leap</phrase><phrase os="sles">SUSE Linux Enterprise Server</phrase><phrase os="sled">SUSE Linux Enterprise Desktop</phrase></phrase>, the preferred language is preconfigured to use the same language as the desktop. To change this setting, open the <guimenu>Preferences</guimenu> window as described in <xref linkend="sec.firefox.preferences"/>, go to the category <guimenu>Content</guimenu> and <guimenu>Choose</guimenu> your preferred language.
cs: Při odesílání požadavku na webový server prohlížeč vždy odešle informace o tom, který jazyk je uživatelem preferován. Webové stránky, které jsou k dispozici ve více než jednom jazyce (a jsou konfigurovány pro vyhodnocení tohoto parametru jazyka), zobrazí své stránky v jazyce, který požaduje prohlížeč. Na <phrase role="productname"><phrase os="osuse">openSUSE Leap</phrase><phrase os="sles">SUSE Linux Enterprise Server</phrase><phrase os="sled">SUSE Linux Enterprise Desktop</phrase></phrase> je preferovaný jazyk předkonfigurován tak, aby byl stejný jako jazyk desktopu. Chcete-li toto nastavení změnit, otevřete okno <guimenu>Předvolby</guimenu>, jak je popsáno v <xref linkend="sec.firefox.preferences"/>, přejděte do kategorie <guimenu>Obsah</guimenu> a <guimenu>Zvolte</guimenu> preferovaný jazyk.

source: Spell Checking
cs: Kontrola pravopisu

source: By default, Firefox spell-checks what you type when typing into multiple-line text boxes. Misspelled words are underlined in red. To correct a word, right-click it and select the correct spelling from the context menu. You may also add the word to the dictionary, if it is correct.
cs: Ve výchozím nastavení Firefox při psaní do víceřádkových textových polí kontroluje pravopis. Chybně napsaná slova jsou podtržena červeně. Chcete-li opravit slovo, klepněte na ně pravým tlačítkem a z kontextové nabídky vyberte správný pravopis. Můžete také přidat slovo do slovníku, pokud je správné.

source: To change or add a dictionary, right-click anywhere in a multi-line text box and select the appropriate option from the context menu. Here you may also disable spell-checking for this text box. If you want to globally disable spell checking, open the <guimenu>Preferences</guimenu> window as described in <xref linkend="sec.firefox.preferences"/> and go to the category <guimenu>Advanced</guimenu>. Deactivate <guimenu>Check My Spelling As I Type</guimenu>.
cs: Chcete-li změnit nebo přidat slovník, klepněte pravým tlačítkem myši kdekoli ve víceřádkovém textovém poli a vyberte příslušnou možnost z místní nabídky. Zde můžete také zakázat kontrolu pravopisu pro toto textové pole. Pokud chcete globálně zakázat kontrolu pravopisu, otevřete okno <guimenu>Předvolby</guimenu>, jak je popsáno v <xref linkend="sec.firefox.preferences"/> a přejděte do kategorie <guimenu>Upřesnit</guimenu>. Deaktivujte <guimenu>Při psaní kontrolovat pravopis</guimenu>.

source: Add-ons
cs: Přídavné funkce

source: Extensions let you personalize Firefox to fit your needs. With extensions, you can change the look and feel of Firefox, enhance existing functionality, and add functions. For example, extensions can enhance the download manager, show the weather, or control Web music players. Other extensions assist Web developers or increase security by blocking content such as ads or scripts.
cs: Rozšíření umožňují přizpůsobit Firefox tak, aby vyhovoval vašim potřebám. Pomocí rozšíření můžete změnit vzhled a dojem z Firefoxu, vylepšit stávající funkce a přidat funkce. Rozšíření mohou například vylepšit správce stahování, ukázat počasí nebo ovládat webové hudební přehrávače. Další rozšíření pomáhají webovým vývojářům nebo zvyšují zabezpečení blokováním obsahu, jako jsou reklamy nebo skripty.

source: There are thousands of extensions available for Firefox. With the add-ons manager, you can install, enable, disable, update, and remove extensions.
cs: Pro Firefox jsou k dispozici tisíce rozšíření. Pomocí Správce doplňků můžete instalovat, aktivovat, deaktivovat, aktualizovat a odebírat rozšíření.

source: If you do not like the standard look and feel of Firefox, install a new <emphasis>theme</emphasis>. Themes do not change the functionality, only the appearance of the browser.
cs: Pokud se vám nelíbí standardní vzhled a dojem z Firefoxu, nainstalujte nový <emphasis>motiv</emphasis>. Motivy nemění funkčnost, pouze vzhled prohlížeče.

source: Installing Add-ons
cs: Instalace přídavků

source: To add an extension or theme, start the add-ons manager with <menuchoice> <guimenu>Tools</guimenu> <guimenu>Add-Ons</guimenu> </menuchoice> from the menu bar. It opens on the <guimenu>Get Add-Ons</guimenu> tab either displaying a choice of recommended add-ons or the results of your last search.
cs: Chcete-li přidat rozšíření nebo motiv, spusťte správce doplňků z nabídky <menuchoice> <guimenu>Nástroje</guimenu> <guimenu>Doplňky</guimenu> </menuchoice>. Otevře se na kartě <guimenu>Najít další doplňky</guimenu>, kde se zobrazí výběr doporučených doplňků nebo výsledky posledního vyhledávání.

source: Use the <guimenu>Search All Add-Ons</guimenu> field to search for specific add-ons. Click an entry in the list to view a short description. Install the add-on by clicking <guimenu>Install</guimenu> or open a Web page with detailed information by clicking the <guimenu>More</guimenu> link.
cs: Chcete-li vyhledat konkrétní doplňky, použijte pole <guimenu>Prohledat všechny doplňky</guimenu>. Kliknutím na položku v seznamu na webu zobrazíte krátký popis. Nainstalujte doplněk kliknutím na <guimenu>Instalovat</guimenu> nebo otevřete webovou stránku s podrobnými informacemi kliknutím na odkaz <guimenu>Další</guimenu>.

source: Installing Firefox Extensions
cs: Instalace rozšíření Firefoxu
de: Installieren von Firefox-Erweiterungen

source: To activate freshly installed extensions or themes, Firefox sometimes needs to be restarted by clicking <guimenu>Restart now</guimenu> in the add-ons manager. Restart this way to make sure that your browsing session will be restored.
cs: Chcete-li aktivovat čerstvě nainstalovaná rozšíření nebo motivy, je někdy třeba Firefox restartovat kliknutím na <guimenu>Restartovat hned</guimenu> ve správci doplňků. Restartujte tímto způsobem a ujistěte se, že vaše relace procházení bude obnovena.
de: Um frisch installierte Erweiterungen oder Themes zu aktivieren, muss Firefox manchmal neu gestartet werden, indem Sie im Add-On-Manager auf <guimenu>Jetzt neu starten</guimenu> klicken. Starten Sie auf diese Weise neu, um sicherzustellen, dass Ihre Browsing-Sitzung wiederhergestellt wird.

source: Managing Add-ons
cs: Správa přídavků
de: Verwalten von Add-ons

source: The Add-ons Manager also offers a convenient interface to manage extensions, themes, and plug-ins. <guimenu>Extensions</guimenu> can be enabled, disabled or uninstalled. If an extension is configurable, its configuration options can be accessed via the <guimenu>Preferences</guimenu> button. In the <guimenu>Appearance</guimenu> tab you may <guimenu>Uninstall</guimenu> a theme, or activate a different theme by clicking <guimenu>Enable</guimenu>. Pending extension and theme installations are also listed. Select <guimenu>Cancel</guimenu> to stop the installation. Although you cannot install <guimenu>Plug-Ins</guimenu> as a user, you may disable or enable them with the Add-ons manager.
cs: Správce doplňků také nabízí pohodlné rozhraní pro správu rozšíření, témat a doplňků. <guimenu>Rozšíření</guimenu> lze povolit, zakázat nebo odinstalovat. Pokud lze rozšíření konfigurovat, lze k jeho konfiguračním možnostem přistupovat pomocí tlačítka <guimenu>Předvolby</guimenu>. Na kartě <guimenu>Vzhled</guimenu> můžete <guimenu>Odinstalovat</guimenu> motiv nebo aktivovat jiný motiv kliknutím na <guimenu>Povolit</guimenu>. V seznamu jsou také čekající instalace rozšíření a motivů. Chcete-li instalaci zastavit, vyberte <guimenu>Zrušit</guimenu>. Přestože <guimenu>Zásuvné moduly</guimenu> (Plug-Ins) nemůžete nainstalovat jako uživatel, můžete je zakázat nebo povolit pomocí Správce doplňků.
de: Der Add-On-Manager bietet auch eine bequeme Schnittstelle zur Verwaltung von Erweiterungen, Themen und Plug-Ins. <guimenu>Erweiterungen</guimenu> können aktiviert, deaktiviert oder deinstalliert werden. Wenn eine Erweiterung konfigurierbar ist, kann auf ihre Konfigurationsoptionen über die Schaltfläche <guimenu>Präferenzen</guimenu> zugegriffen werden. In der Registerkarte <guimenu>Aussehen</guimenu> können Sie <guimenu>Deinstallieren</guimenu> ein Thema oder ein anderes Thema aktivieren, indem Sie auf <guimenu>Aktivieren</guimenu> klicken. Ausstehende Erweiterungen und Themeninstallationen werden ebenfalls aufgelistet. Wählen Sie <guimenu>Abbrechen</guimenu>, um die Installation zu stoppen. Obwohl Sie <guimenu>Plug-Ins</guimenu> nicht als Benutzer installieren können, können Sie sie mit dem Add-ons-Manager deaktivieren oder aktivieren.
