Repository: openSUSE/doc-sle-translations
Catalog: */po/art_sle_modules_quick.*.po
Languages: cs

# _
source: translator-credits
cs: překladatelské kredity alkas alkas@volny.cz, 2016, 2020

source: Modules &amp; Extensions Quick Start
cs: Moduly a rozšíření - Rychlý start

source: This Quick Start gives you an overview of modules and extensions available for the SUSE Linux Enterprise family. Learn about purpose and features and how to manage them.
cs: Tento Rychlý start vám poskytne přehled modulů a rozšíření dostupných pro řadu SUSE Linux Enterprise. Dozvíte se o účelu a funkcích a o tom, jak je spravovat.

source: no
cs: ne

source: Modules &amp; Extensions Explained
cs: Moduly a rozšíření - vysvětlení

source: Starting with <phrase role="productname"><phrase os="osuse">openSUSE Leap</phrase><phrase os="sles">SUSE Linux Enterprise Server</phrase><phrase os="sled">SUSE Linux Enterprise Desktop</phrase></phrase> 15, the installation medium only consists of the Installer, a minimal system for depoying, updating and registering <phrase role="productname"><phrase os="osuse">openSUSE Leap</phrase><phrase os="sles">SUSE Linux Enterprise Server</phrase><phrase os="sled">SUSE Linux Enterprise Desktop</phrase></phrase>. During deployment you can add functionality by selecting modules and extensions to be installed on top of the Installer.
cs: Počínaje <phrase role="productname"><phrase os="osuse">openSUSE Leap</phrase><phrase os="sles">SUSE Linux Enterprise Server</phrase><phrase os="sled">SUSE Linux Enterprise Desktop</phrase></phrase> 15, skládá se instalační médium pouze z Instalátoru, tj. minimálního systému pro nasazení, aktualizaci a registraci <phrase role="productname"><phrase os="osuse">openSUSE Leap</phrase><phrase os="sles">SUSE Linux Enterprise Server</phrase><phrase os="sled">SUSE Linux Enterprise Desktop</phrase></phrase>. Během nasazení můžete přidat funkce výběrem modulů a rozšíření, které mají být nainstalovány "nad" minimální základní Instalátor.

source: Technically, modules and extensions are very similar. Both can be managed with YaST or the command line tool <command>SUSEConnect</command>. Both modules and extensions add a set of online repositories (<literal>main</literal>, <literal>update</literal>, <literal>source</literal>, <literal>debug</literal>) containing all necessary packages. Additionally, both may add partitioning proposals and system roles that can be chosen during deployment.
cs: Technicky jsou moduly a rozšíření velmi podobné. Oba typy lze spravovat pomocí programu YaST nebo pomocí nástroje příkazového řádku <command>SUSEConnect</command>. Moduly i rozšíření přidávají sadu online úložišť (<literal>main</literal>, <literal>update</literal>, <literal>source</literal>, <literal>debug</literal>) obsahující všechny potřebné balíčky. Kromě toho mohou moduly i rozšíření přidávat návrhy na rozdělení a systémové role, které mohou být vybrány během instalace.

source: However, there are significant differences between modules and extensions:
cs: Mezi moduly a rozšířeními však existují významné rozdíly:

source: Modules
cs: Moduly

source: Modules allow you to shape the product according to your needs. Each module has a clearly defined scope ranging from tools for Web Development and Scripting, through a Public Cloud, all the way to the SUSE Package Hub, offering community-managed packages.
cs: Moduly umožňují tvarovat produkt podle vašich potřeb. Každý modul má jasně definovaný rozsah od nástrojů pro vývoj webových stránek a skriptování, přes Veřejný cloud, až po SUSE Package Hub, nabízející balíčky spravované komunitou.

source: Modules enable you to provide just the set of packages required for the machine's purpose, making the system lean, fast, and more secure. This modular approach also makes it easy to provide tailor-made images for container and cloud environments.
cs: Moduly umožňují poskytovat pouze sadu balíčků potřebných pro účely stroje, díky čemuž je systém štíhlý, rychlý a bezpečnější. Tento modulární přístup také usnadňuje poskytování obrazů na míru pro prostředí kontejnerů a cloudu.

source: Modules can be added or removed at any time during the lifecycle of the system, allowing you to easily adjust the system to changing requirements.
cs: Moduly lze přidat nebo odebrat kdykoli během životního cyklu systému, což vám umožní snadno přizpůsobit systém měnícím se požadavkům.

source: Modules are part of your <phrase role="productname"><phrase os="osuse">openSUSE Leap</phrase><phrase os="sles">SUSE Linux Enterprise Server</phrase><phrase os="sled">SUSE Linux Enterprise Desktop</phrase></phrase> subscription and therefore free of charge. They differ from the base of <phrase role="productname"><phrase os="osuse">openSUSE Leap</phrase><phrase os="sles">SUSE Linux Enterprise Server</phrase><phrase os="sled">SUSE Linux Enterprise Desktop</phrase></phrase> only by their lifecycle. With the exception of the SUSE Package Hub module, SUSE provides L3 support for almost all packages provided by modules. For more information about the <phrase role="productname"><phrase os="osuse">openSUSE Leap</phrase><phrase os="sles">SUSE Linux Enterprise Server</phrase><phrase os="sled">SUSE Linux Enterprise Desktop</phrase></phrase> support statement refer to the <link xlink:href="https://www.suse.com/releasenotes/x86_64/SUSE-SLES/15/#Intro.Support">Release Notes</link>.
cs: Moduly jsou částí Vašeho systému <phrase role="productname"><phrase os="osuse">openSUSE Leap</phrase><phrase os="sles">SUSE Linux Enterprise Server</phrase><phrase os="sled">SUSE Linux Enterprise Desktop</phrase></phrase> jako předplatné, a proto zdarma. Liší se od základny <phrase role="productname"><phrase os="osuse">openSUSE Leap</phrase><phrase os="sles">SUSE Linux Enterprise Server</phrase><phrase os="sled">SUSE Linux Enterprise Desktop</phrase></phrase> pouze svým životním cyklem. S výjimkou modulu SUSE Package Hub poskytuje SUSE podporu L3 pro téměř všechny balíčky poskytované moduly. Pro více informací o Prohlášení o podpoře systémů <phrase role="productname"><phrase os="osuse">openSUSE Leap</phrase><phrase os="sles">SUSE Linux Enterprise Server</phrase><phrase os="sled">SUSE Linux Enterprise Desktop</phrase></phrase> viz <link xlink:href="https://www.suse.com/releasenotes/x86_64/SUSE-SLES/15/#Intro.Support">Poznámky k vydání</link>.

source: Extensions
cs: Rozšíření

source: Extensions provide advanced capabilities for tasks such as live patching and high availability clustering to <phrase role="productname"><phrase os="osuse">openSUSE Leap</phrase><phrase os="sles">SUSE Linux Enterprise Server</phrase><phrase os="sled">SUSE Linux Enterprise Desktop</phrase></phrase>. They are offered as subscriptions and require a registration key that is liable for costs. Usually, extensions have their own release notes documents that are available from <link xlink:href="https://www.suse.com/releasenotes"/>.
cs: Rozšíření poskytují pokročilé funkce pro úkoly, jako je živé opravování a seskupování s vysokou dostupností <phrase role="productname"><phrase os="osuse">openSUSE Leap</phrase><phrase os="sles">SUSE Linux Enterprise Server</phrase><phrase os="sled">SUSE Linux Enterprise Desktop</phrase></phrase>. Nabízejí se jako předplatné a vyžadují registrační klíč, který odpovídá za náklady. Rozšíření mají obvykle své vlastní poznámky k vydání - dokumenty, které jsou k dispozici na webu <link xlink:href="https://www.suse.com/releasenotes"/>.

source: Modules Available for the SUSE Linux Enterprise Product Family
cs: Moduly dostupné pro rodinu produktů SUSE Linux Enterprise

source: The following modules are available within the SUSE Linux Enterprise Product Family. Note that the availability of modules depends on the product (refer to the column <emphasis>Availability</emphasis>). Refer to <link xlink:href="https://www.suse.com/lifecycle"/> for more information about lifecycle, release frequency, and the overlay support period.
cs: V rámci rodiny produktů SUSE Linux Enterprise jsou k dispozici následující moduly. Dostupnost modulů závisí na produktu (viz sloupec <emphasis>Dostupnost</emphasis>). Více informací o životním cyklu, frekvenci vydání a době podpory překrytí viz <link xlink:href="https://www.suse.com/lifecycle"/>.

source: Name
cs: Jméno

source: Module depends on
cs: Modul závisí na

source: Available for
cs: Dostupný pro

source: Support
cs: Podpora

source: Content
cs: Obsah

source: <emphasis role="bold">Basesystem</emphasis>
cs: <emphasis role="bold">Základní systém</emphasis>

source: None
cs: žádném

source: default on all products
cs: výchozí u všech produktů

source: <emphasis role="bold">lifecycle:</emphasis> 10 yrs
cs: <emphasis role="bold">životní cyklus:</emphasis> 10 let

source: <emphasis role="bold">extended:</emphasis> 3 yrs LTSS<superscript>1</superscript>
cs: <emphasis role="bold">rozšířen:</emphasis> 3 roky LTSS<superscript>1</superscript>

source: <emphasis role="bold">level:</emphasis> L3
cs: <emphasis role="bold">úroveň:</emphasis> L3

source: This module adds a basic system on top of the Installer. It is required by all other modules and extensions. The scope of an installation that only contains the base system is comparable to the installation pattern <literal>minimal</literal> system of previous <phrase role="productname"><phrase os="osuse">openSUSE Leap</phrase><phrase os="sles">SUSE Linux Enterprise Server</phrase><phrase os="sled">SUSE Linux Enterprise Desktop</phrase></phrase> versions. This module is selected for installation by default and should not be deselected.
cs: Tento modul přidá základní systém jako nástavbu instalátoru. Je vyžadován všemi ostatními moduly a rozšířeními. Rozsah instalace, která obsahuje pouze základní systém, je srovnatelná s instalačním vzorem systému <literal>minimal</literal> předchozích verzí <phrase role="productname"><phrase os="osuse">openSUSE Leap</phrase><phrase os="sles">SUSE Linux Enterprise Server</phrase><phrase os="sled">SUSE Linux Enterprise Desktop</phrase></phrase>. Tento modul je ve výchozím nastavení vybrán k instalaci a jeho výběr by neměl být zrušen.

source: <emphasis role="bold">Containers</emphasis>
cs: <emphasis role="bold">Kontejnery</emphasis>

source: Basesystem
cs: Základní systém

source: SLES, SLES for SAP, SLE HPC
cs: SLES, SLES pro SAP, SLE HPC

source: <emphasis role="bold">extended:</emphasis> no
cs: <emphasis role="bold">rozšířen:</emphasis> ne

source: Contains support, tools and images for containers.
cs: Obsahuje podporu, nástroje a obrázky pro kontejnery.

source: <emphasis role="bold">Desktop Applications</emphasis>
cs: <emphasis role="bold">Aplikace pro stolní počítače</emphasis>

source: SLED (default), SLE-WE (default), SLES, SLES for SAP, SLE RT, SLE HPC
cs: SLED (výchozí), SLE-WE (výchozí), SLES, SLES for SAP, SLE RT, SLE HPC

source: Adds a graphical user interface <phrase os="sled">(Wayland)</phrase> and essential desktop applications to the system. <phrase os="sled">This module is selected for installation by default; deselecting it is not recommended.</phrase>
cs: Přidá do systému grafické uživatelské rozhraní <phrase os="sled">(Wayland)</phrase> a základní stolní aplikace. <phrase os="sled">Tento modul je ve výchozím nastavení vybrán k instalaci; zrušení výběru se nedoporučuje.</phrase>

source: <emphasis role="bold">Development Tools</emphasis>
cs: <emphasis role="bold">Vývojářské nástroje</emphasis>

source: Basesystem, Desktop Applications
cs: Základní systém, stolní aplikace

source: SLES, SLES for SAP, SLED, SLE RT, SLE HPC
cs: SLES, SLES pro SAP, SLED, SLE RT, SLE HPC

source: <emphasis role="bold">lifecycle:</emphasis> 10 years
cs: <emphasis role="bold">životní cyklus:</emphasis> 10 let

source: Contains compilers (including <package>gcc</package>) and libraries required for compiling and debugging applications. Replaces the former Software Development Kit (SDK).
cs: Obsahuje kompilátory (včetně <package>gcc</package>) a knihovny potřebné pro kompilaci a ladění aplikací. Nahrazuje dřívější Software Development Kit (SDK).

source: <emphasis role="bold">High Availability</emphasis>
cs: <emphasis role="bold">Vysoká dostupnost</emphasis>

source: SLES for SAP, SLE HPC
cs: SLES pro SAP, SLE HPC

source: Adds clustering support for mission critical setups. Tools included are Hawk, crm, Pacemaker, and Corosync. High Availability support is included in subscriptions for SLES for SAP and SLE HPC and therefore available as a module on these products. It is also available as an extension for SLES (see below).
cs: Přidává podporu klastrování pro kritické sestavy. Mezi nástroje patří Hawk, crm, Pacemaker a Corosync. Podpora vysoké dostupnosti je součástí předplatného pro SLES pro SAP a SLE HPC, a proto je k dispozici jako modul pro tyto produkty. Je také k dispozici jako rozšíření pro SLES (viz níže).

source: <emphasis role="bold">High Performance Computing</emphasis>
cs: <emphasis role="bold">Vysoká výpočetní výkonnost</emphasis>

source: <emphasis role="bold">extended:</emphasis> 3 yrs LTSS<superscript>1</superscript>, 1 yr ESPOS<superscript>2</superscript>
cs: <emphasis role="bold">rozšíření:</emphasis> 3 roky LTSS<superscript>1</superscript>, 1 rok ESPOS<superscript>2</superscript>

source: SLE HPC basic system.
cs: SLE HPC základní systém.

source: <emphasis role="bold">Legacy</emphasis>
cs: <emphasis role="bold">Předchozí</emphasis>

source: Basesystem, Server Applications
cs: Základní systém, serverové aplikace

source: Contains packages that were available in previous versions of <phrase role="productname"><phrase os="osuse">openSUSE Leap</phrase><phrase os="sles">SUSE Linux Enterprise Server</phrase><phrase os="sled">SUSE Linux Enterprise Desktop</phrase></phrase>, but have been discontinued in SLES <phrase role="productnumber"><phrase os="osuse">15.0</phrase><phrase os="sles;sled">15</phrase></phrase>. This module is recommended when migrating from a previous product version.
cs: Obsahuje balíčky, které byly dostupné ve starších verzích <phrase role="productname"><phrase os="osuse">openSUSE Leap</phrase><phrase os="sles">SUSE Linux Enterprise Server</phrase><phrase os="sled">SUSE Linux Enterprise Desktop</phrase></phrase>, ale nejsou už zařazeny do SLES <phrase role="productnumber"><phrase os="osuse">15.0</phrase><phrase os="sles;sled">15</phrase></phrase>. Tento modul se doporučuje při migraci z předchozí verze produktu.

source: <emphasis role="bold">Public Cloud</emphasis>
cs: <emphasis role="bold">Veřejný cloud</emphasis>

source: Contains all tools required to create images for deploying <phrase role="productname"><phrase os="osuse">openSUSE Leap</phrase><phrase os="sles">SUSE Linux Enterprise Server</phrase><phrase os="sled">SUSE Linux Enterprise Desktop</phrase></phrase> in cloud environments such as the Amazon Web Services (AWS), Microsoft Azure, Google Compute Platform, or the SUSE OpenStack Cloud.
cs: Obsahuje všechny nástroje nezbytné k vytváření obrazů systému k nasazení <phrase role="productname"><phrase os="osuse">openSUSE Leap</phrase><phrase os="sles">SUSE Linux Enterprise Server</phrase><phrase os="sled">SUSE Linux Enterprise Desktop</phrase></phrase> do prostředí cloudu, například Amazon Web Services (AWS), Microsoft Azure, Google Compute Platform, nebo SUSE OpenStack Cloud.

source: <emphasis role="bold">SAP Applications</emphasis>
cs: <emphasis role="bold">Aplikace SAP</emphasis>

source: Packages specific to SLES for SAP
cs: Balíčky specifické pro SLES pro SAP

source: SLES for SAP (default)
cs: SLES pro SAP (výchozí)

source: SLES for SAP basic system.
cs: SLES pro SAP - základní systém.

source: <emphasis role="bold">Server Applications</emphasis>
cs: <emphasis role="bold">Serverové aplikace</emphasis>

source: SLES (default), SLES for SAP, SLE RT, SLE HPC
cs: SLES (výchozí), SLES pro SAP, SLE RT, SLE HPC

source: Adds server functionality by providing network services such as DHCP server, name server, or Web server. <phrase os="sles">This module is selected for installation by default; deselecting it is not recommended.</phrase>
cs: Přidává funkčnost serveru poskytováním síťových služeb, jako je DHCP server, DNS server nebo webový server. <phrase os="sles">Tento modul je ve výchozím nastavení vybrán pro instalaci; zrušení jeho výběru se nedoporučuje.</phrase>

source: <emphasis role="bold">SUSE Cloud Application Platform Tools</emphasis>
cs: <emphasis role="bold">Nástroje cloudové aplikační platformy SUSE</emphasis>

source: SLED, SLES, SLES for SAP
cs: SLED, SLES, SLES pro SAP

source: Adds tools allowing you to interact with a SUSE Cloud Application Platform product.
cs: Přidává nástroje umožňující interakci s produktem SUSE Cloud Application Platform.

source: <emphasis role="bold">SUSE Package Hub</emphasis>
cs: <emphasis role="bold">Centrum balíčků SUSE</emphasis>

source: all products
cs: všechny produkty

source: <emphasis role="bold">lifecycle:</emphasis> none
cs: <emphasis role="bold">životní cyklus:</emphasis> žádný

source: <emphasis role="bold">extended:</emphasis> none
cs: <emphasis role="bold">rozšířen:</emphasis> žádný

source: <emphasis role="bold">level:</emphasis> none
cs: <emphasis role="bold">úroveň:</emphasis> žádná

source: Provides access to packages for <phrase role="productname"><phrase os="osuse">openSUSE Leap</phrase><phrase os="sles">SUSE Linux Enterprise Server</phrase><phrase os="sled">SUSE Linux Enterprise Desktop</phrase></phrase> maintained by the openSUSE community. These packages are delivered without L3 support and do not interfere with the supportability of <phrase role="productname"><phrase os="osuse">openSUSE Leap</phrase><phrase os="sles">SUSE Linux Enterprise Server</phrase><phrase os="sled">SUSE Linux Enterprise Desktop</phrase></phrase>. For more information refer to <link xlink:href="https://packagehub.suse.com/"/>.
cs: Zajišťuje přístup k balíčkům pro <phrase role="productname"><phrase os="osuse">openSUSE Leap</phrase><phrase os="sles">SUSE Linux Enterprise Server</phrase><phrase os="sled">SUSE Linux Enterprise Desktop</phrase></phrase> udržovaným komunitou openSUSE. Tyto balíčky jsou dodávány bez podpory L3 a nekolidují s podporou <phrase role="productname"><phrase os="osuse">openSUSE Leap</phrase><phrase os="sles">SUSE Linux Enterprise Server</phrase><phrase os="sled">SUSE Linux Enterprise Desktop</phrase></phrase>. Další informace viz <link xlink:href="https://packagehub.suse.com/"/>.

source: <emphasis role="bold">Web and Scripting</emphasis>
cs: <emphasis role="bold">Web a skriptování</emphasis>

source: SLES, SlES for SAP, SLE HPC
cs: SLES, SLES pro SAP, SLE HPC

source: Contains packages intended for a running Web server.
cs: Obsahuje balíčky určené pro provoz webového serveru.

source: <superscript>1</superscript> LTSS: <link xlink:href="https://www.suse.com/products/long-term-service-pack-support/">Long-Term Service Pack Support</link>
cs: <superscript>1</superscript> LTSS: <link xlink:href="https://www.suse.com/products/long-term-service-pack-support/">Dlouhodobá podpora servisními balíčky (Long-Term Service Pack Support)</link>

source: <superscript>2</superscript> ESPOS: Extended Service Pack Overlay Support
cs: <superscript>2</superscript> ESPOS: Rozšířená podpora (Extended Service Pack Overlay Support)

source: Extensions Available for the SUSE Linux Enterprise Product Family
cs: Rozšíření dostupná pro rodinu produktů SUSE Linux Enterprise

source: The following extensions are available within the SUSE Linux Enterprise Product Family. Note that the availability of extensions depends on the product (refer to the column <emphasis>Availability</emphasis>).
cs: V rámci rodiny produktů SUSE Linux Enterprise jsou k dispozici následující rozšíření. Dostupnost rozšíření závisí na produktu (viz sloupec <emphasis>Dostupnost</emphasis>).

source: Name and Content
cs: Název a obsah

source: Module Dependency
cs: Závislost modulu

source: Availability
cs: Dostupnost

source: <link xlink:href="https://www.suse.com/products/highavailability">SUSE Linux Enterprise High Availability Extension</link>
cs: <link xlink:href="https://www.suse.com/products/highavailability">Rozšíření vysoké dostupnosti SUSE Linux Enterprise</link>

source: <link xlink:href="https://www.suse.com/products/live-patching">SUSE Linux Enterprise Live Patching</link>
cs: <link xlink:href="https://www.suse.com/products/live-patching">Opravy za chodu pro SUSE Linux Enterprise</link>

source: <link xlink:href="https://www.suse.com/products/suse-enterprise-storage/">SUSE Enterprise Storage</link>
cs: <link xlink:href="https://www.suse.com/products/suse-enterprise-storage/">Paměťová zařízení pro SUSE Enterprise</link>

source: <link xlink:href="https://www.suse.com/products/workstation-extension">SUSE Linux Enterprise Workstation Extension</link>
cs: <link xlink:href="https://www.suse.com/products/workstation-extension">Rozšíření pracovní stanice pro SUSE Linux Enterprise</link>

source: SLES, SLED (default)
cs: SLES, SLED (výchozí)

source: Installing and Managing
cs: Instalace a správa

source: Modules &amp; Extensions can be installed when initially setting up the system and also on an existing <phrase role="productname"><phrase os="osuse">openSUSE Leap</phrase><phrase os="sles">SUSE Linux Enterprise Server</phrase><phrase os="sled">SUSE Linux Enterprise Desktop</phrase></phrase> installation.
cs: Moduly a rozšíření lze nainstalovat při počátečním nastavení systému a také na existující instalaci <phrase role="productname"><phrase os="osuse">openSUSE Leap</phrase><phrase os="sles">SUSE Linux Enterprise Server</phrase><phrase os="sled">SUSE Linux Enterprise Desktop</phrase></phrase>.

source: Installing Modules &amp; Extensions During the Initial System Setup
cs: Instalace modulů a rozšíření během počátečního nastavení systému

source: Modules &amp; extensions can easily be installed when setting up the system. The respective steps are part of the installation routine. Following the default installation path, this requires network access to contact the SUSE Customer Center or a local registration server (<link xlink:href="https://www.suse.com/products/suse-manager/">SUSE Manager</link> or Repository Mirroring Tool), which provide the respective repositories. An offline installation is supported, too. In that case an additional installation media is required. For detailed information refer to <xref linkend="sec.yast_install.modules"/>.
cs: Moduly a rozšíření lze snadno nainstalovat při nastavování systému. Příslušné kroky jsou součástí instalační rutiny. Podle výchozí instalační cesty to vyžaduje přístup k síti a kontaktování zákaznického centra SUSE nebo místního registračního serveru (<link xlink:href="https://www.suse.com/products/suse-manager/">SUSE Manager</link> nebo Nástroj zrcadlení úložiště - Repository Mirroring Tool), které poskytují příslušná úložiště. Podporována je také offline instalace. V takovém případě je třeba další instalační médium. Podrobné informace viz <xref linkend="sec.yast_install.modules"/>.

source: Installing and Managing Modules &amp; Extensions from the Running System
cs: Instalace a správa modulů a rozšíření z běžícího systému

source: To install modules &amp; extensions from the running system, you need to make sure your system is registered with the SUSE Customer Center or a local registration server. If you have not done so during the installation, refer to <xref linkend="sec.register_sle.system"/> for instructions.
cs: Chcete-li nainstalovat moduly a rozšíření z běžícího systému, musíte se ujistit, že je váš systém zaregistrován v Zákaznickém centru SUSE nebo na místním registračním serveru. Pokud jste svůj systém během instalace nezaregistrovali, postupujte podle pokynů v <xref linkend="sec.register_sle.system"/>.
