Repository: openSUSE/doc-sle-translations
Catalog: */po/art_sle_modules_quick.*.po
Languages: cs

source: After the system has been registered, modules can be added or removed. Refer to <xref linkend="sec.register_sle.add_modules"/> for details.
cs: Po zaregistrování systému lze moduly přidat nebo odebrat. Podrobnosti viz <xref linkend="sec.register_sle.add_modules"/>.

source: Module Membership of Packages
cs: Členství modulů v balíčcích

source: The default tools for searching software packages (YaST Software Management or <command>zypper search</command>) are restricted to searching within active repositories. As a consequence, packages that are members of modules currently not installed on <phrase role="productname"><phrase os="osuse">openSUSE Leap</phrase><phrase os="sles">SUSE Linux Enterprise Server</phrase><phrase os="sled">SUSE Linux Enterprise Desktop</phrase></phrase> are not found.
cs: Výchozí nástroje pro vyhledávání softwarových balíčků (YaST Software Management nebo <command>zypper search</command>) jsou omezeny na vyhledávání v aktivních úložištích. V důsledku toho balíčky, které jsou členy modulů aktuálně nainstalovaných na <phrase role="productname"><phrase os="osuse">openSUSE Leap</phrase><phrase os="sles">SUSE Linux Enterprise Server</phrase><phrase os="sled">SUSE Linux Enterprise Desktop</phrase></phrase> nejsou nalezeny.

source: <phrase role="productname"><phrase os="osuse">openSUSE Leap</phrase><phrase os="sles">SUSE Linux Enterprise Server</phrase><phrase os="sled">SUSE Linux Enterprise Desktop</phrase></phrase> 15 introduces a new Zypper subcommand, <command>search-packages</command>, which lets you search for packages in all modules and extensions available for <phrase role="productname"><phrase os="osuse">openSUSE Leap</phrase><phrase os="sles">SUSE Linux Enterprise Server</phrase><phrase os="sled">SUSE Linux Enterprise Desktop</phrase></phrase>. This command becomes available after installing the package <package>zypper-search-packages-plugin</package>, which is not installed by default. To find out which module a package belongs to, run
cs: <phrase role="productname"><phrase os="osuse">openSUSE Leap</phrase><phrase os="sles">SUSE Linux Enterprise Server</phrase><phrase os="sled">SUSE Linux Enterprise Desktop</phrase></phrase> 15 představuje nový podpříkaz Zypperu, <command>search-packages</command>, který umožní hledat balíčky ve všech modulech a rozšířeních dostupných pro <phrase role="productname"><phrase os="osuse">openSUSE Leap</phrase><phrase os="sles">SUSE Linux Enterprise Server</phrase><phrase os="sled">SUSE Linux Enterprise Desktop</phrase></phrase>. Tento příkaz bude k dispozici po instalaci balíčku <package> zypper-search-packages-plugin </package>, který není ve výchozím nastavení nainstalován. Chcete-li zjistit, ke kterému modulu balíček patří, spusťte

source: zypper search-packages <replaceable>PACKAGE_1</replaceable> <replaceable>PACKAGE_2</replaceable>
cs: zypper search-packages <replaceable>BALÍČEK_1</replaceable> <replaceable>BALÍČEK_2</replaceable>

source: To refine the search results, <command>zypper search-packages</command> offers the following options:
cs: Chcete-li výsledky vyhledávání upřesnit, nabízí <command>zypper search-packages</command> tyto možnosti:

source: Search for exact matches.
cs: Hledat přesnou shodu.

source: Group the search results by modules rather than by package name.
cs: Výsledky hledání budou seskupeny podle modulů, nikoli podle názvu balíčku.
