Repository: openSUSE/doc-sle-translations
Catalog: */po/art_opensuse_install_quick.*.po
Languages: cs, fr

source: Define a partition setup for <phrase role="productname"><phrase os="osuse">openSUSE Leap</phrase><phrase os="sles">SUSE Linux Enterprise Server</phrase><phrase os="sled">SUSE Linux Enterprise Desktop</phrase></phrase> in this step. Review the partition setup proposed by the system. If necessary, change it. You have the following options:
cs: V tomto kroku definujte nastavení oddílů pro <phrase role="productname"><phrase os="osuse">openSUSE Leap</phrase><phrase os="sles">SUSE Linux Enterprise Server</phrase><phrase os="sled">SUSE Linux Enterprise Desktop</phrase></phrase>. Prohlédněte si nastavení navržené systémem. V případě potřeby je změňte. Máte tyto možnosti:
fr: Définissez une configuration de partition pour <phrase role="productname"><phrase os="osuse">openSUSE Leap</phrase><phrase os="sles">SUSE Linux Enterprise Server</phrase><phrase os="sled">SUSE Linux Enterprise Desktop</phrase></phrase> dans cette étape. Vérifiez la configuration de la partition proposée par le système. Si nécessaire, modifiez-la. Vous disposez des options suivantes :

source: <guimenu>Guided Setup</guimenu>
cs: <guimenu>Nastavení s průvodcem</guimenu>

source: Starts a wizard which lets you refine the partitioning proposal. Options available here depend on your system setup. In case it contains more than a single hard disk, you may choose which disk(s) to use and where to place the root partition. If the disk(s) already contain partitions, decide whether to remove or resize them.
cs: Spustí průvodce, který vám umožní upřesnit návrh rozdělení. Dostupné možnosti závisí na nastavení systému. V případě, že systém obsahuje více než jeden pevný disk, můžete si vybrat, které disky použijete a kam umístit kořenový oddíl. Pokud disky již obsahují oddíly, rozhodněte se, zda je chcete odebrat nebo změnit jejich velikost.
fr: Démarre un assistant qui vous permet d'affiner la proposition de partitionnement. Les options disponibles ici dépendent de la configuration de votre système. S'il contient plus d'un seul disque dur, vous pouvez choisir le ou les disques à utiliser et l'endroit où placer la partition racine. Si le ou les disques contiennent déjà des partitions, décidez de les supprimer ou de les redimensionner.

source: In subsequent steps you may also add LVM support and disk encryption. You can change the file system for the root partition and decide whether to have a separate home partition or not.
cs: V následujících krocích můžete také přidat podporu LVM (logických svazků) a šifrování disku. Můžete změnit systém souborů kořenového oddílu a rozhodnout se, zda budete mít samostatný domovský oddíl nebo ne.
fr: Dans les étapes suivantes, vous pouvez également ajouter la prise en charge de LVM et le chiffrement des disques. Vous pouvez modifier le système de fichiers de la partition racine et décider d'avoir ou non une partition home séparée.

source: Opens the <guimenu>Expert Partitioner</guimenu> described in <xref linkend="sec.expert_partitioner"/>. This gives you full control over the partitioning setup and lets you create a custom setup. This option is intended for experts.
cs: Otevírá <guimenu>Expert Partitioner</guimenu> (tvorba oddílů pro experty) popsaný v <xref linkend="sec.expert_partitioner"/>. To vám dává plnou kontrolu nad nastavením oddílů a umožňuje vytvořit vlastní nastavení. Tato možnost je určena odborníkům.
fr: Ouvre le <guimenu>Expert Partitioner</guimenu> décrit dans <xref linkend="sec.expert_partitioner"/>. Cela vous donne un contrôle total sur la configuration du partitionnement et vous permet de créer une configuration personnalisée. Cette option est destinée aux experts.

source: To accept the proposed setup without any changes, choose <guimenu>Next</guimenu> to proceed.
cs: Chcete-li přijmout navrhované nastavení bez jakýchkoli změn, pokračujte volbou <guimenu>Další</guimenu>.
fr: Pour accepter la configuration proposée sans aucune modification, choisissez <guimenu>Suivant</guimenu> pour continuer.

source: Release Notes
cs: Poznámky k verzi
fr: Notes de publication

source: From this point on, the Release Notes can be viewed from any screen during the installation process by selecting <guimenu>Release Notes</guimenu>.
cs: Od tohoto okamžiku si poznámky k verzi můžete prohlížet z kterékoli obrazovky během instalačního procesu výběrem <guimenu>Poznámky k verzi</guimenu>.
fr: À partir de là, les notes de version peuvent être consultées à partir de n'importe quel écran pendant le processus d'installation en sélectionnant <guimenu>Release Notes</guimenu>.

source: Clock and Time Zone
cs: Čas a časová zóna

source: Select the clock and time zone to use in your system. To manually adjust the time or to configure an NTP server for time synchronization, choose <guimenu>Other Settings</guimenu>. See <xref linkend="sec.yast_install.timezone"/> for detailed information. Proceed with <guimenu>Next</guimenu>.
cs: Vyberte čas a časové pásmo, které chcete použít ve vašem systému. Chcete-li čas upravit ručně nebo nakonfigurovat server NTP pro synchronizaci času, vyberte <guimenu>Další nastavení</guimenu>. Podrobné informace viz <xref linkend="sec.yast_install.timezone"/>. Pokračujte na <guimenu>Další</guimenu>.
fr: Sélectionnez l'horloge et le fuseau horaire à utiliser dans votre système. Pour régler manuellement l'heure ou pour configurer un serveur NTP pour la synchronisation de l'heure, choisissez <guimenu>Autres paramètres</guimenu>. Voir <xref linkend="sec.yast_install.timezone"/> pour des informations détaillées. Poursuivez avec <guimenu>Suivant</guimenu>.

source: Local User
cs: Místní uživatel

source: To create a local user, type the first and last name in the <guimenu>User’s Full Name</guimenu> field, the login name in the <guimenu>Username</guimenu> field, and the password in the <guimenu>Password</guimenu> field.
cs: Chcete-li vytvořit místního uživatele, zadejte do pole <guimenu>Celé jméno uživatele</guimenu> jméno a příjmení, přihlašovací jméno do pole <guimenu>Uživatelské jméno</guimenu> a heslo do pole <guimenu>Heslo</guimenu>.
fr: Pour créer un utilisateur local, tapez le nom et le prénom dans le champ <guimenu>User’s Full Name</guimenu>, le nom de connexion dans le champ <guimenu>Username</guimenu> et le mot de passe dans le champ <guimenu>Password</guimenu>.

source: The password should be at least eight characters long and should contain both uppercase and lowercase letters and numbers. The maximum length for passwords is 72 characters, and passwords are case-sensitive.
cs: Heslo by mělo mít alespoň osm znaků a mělo by obsahovat písmena velké i malé abecedy a číslice. Maximální délka hesel je 72 znaků a hesla rozlišují písmena velké a malé abecedy.
fr: Le mot de passe doit comporter au moins huit caractères et doit contenir des lettres majuscules et minuscules ainsi que des chiffres. La longueur maximale des mots de passe est de 72 caractères, et les mots de passe sont sensibles à la casse.

source: For security reasons it is also strongly recommended <emphasis>not</emphasis> to enable the <guimenu>Automatic Login</guimenu>. You should also <emphasis>not</emphasis> <guimenu>Use this Password for the System Administrator</guimenu> but rather provide a separate <systemitem class="username">root</systemitem> password in the next installation step.
cs: Z bezpečnostních důvodů se také rozhodně doporučuje <emphasis>ne</emphasis>povolovat <guimenu>Automatické přihlášení</guimenu>. <emphasis>Neměli byste také zadávat</emphasis> <guimenu>Toto heslo použít pro správce systému</guimenu>, ale v dalším kroku instalace byste měli zadat samostatné heslo pro uživatele <systemitem class="username">root</systemitem>.
fr: Pour des raisons de sécurité, il est également fortement recommandé <emphasis>de ne pas</emphasis> activer la <guimenu>connexion automatique</guimenu>. Vous devriez également <emphasis>ne pas</emphasis> <guimenu>utiliser ce mot de passe pour l'administrateur système</guimenu> mais plutôt fournir un mot de passe distinct <systemitem class="username">root</systemitem> à l'étape suivante de l'installation.

source: If you install on a system where a previous Linux installation was found, you may <guimenu>Import User Data from a Previous Installation</guimenu>. Click <guimenu>Choose User</guimenu> for a list of available user accounts. Select one or more user.
cs: Instalujete-li na systém, kde byla nalezena předchozí instalace systému Linux, můžete <guimenu>Importovat uživatelská data z předchozí instalace</guimenu>. Kliknutím na <guimenu>Zvolte uživatele</guimenu> zobrazíte seznam dostupných uživatelských účtů. Vyberte jednoho nebo více uživatelů.

source: In an environment where users are centrally managed (for example by NIS or LDAP) you may want to skip the creation of local users. Select <guimenu>Skip User Creation</guimenu> in this case.
cs: V prostředí, kde je centrální správa uživatelů (například prostřednictvím NIS nebo LDAP), můžete přeskočit vytváření místních uživatelů. V takovém případě vyberte <guimenu>Přeskočit vytvoření uživatele</guimenu>.

source: Proceed with <guimenu>Next</guimenu>.
cs: Pokračujte <guimenu>Next</guimenu>.
fr: Continuez avec <guimenu>Suivant</guimenu>.

source: Password for the System Administrator <quote>root</quote>
cs: Heslo pro správce systému - uživatele <quote>root</quote>
fr: Mot de passe pour l'administrateur du système <quote>root</quote>

source: Provide a password for the system administrator account (called the <systemitem class="username">root</systemitem> user).
cs: Zadejte heslo pro účet správce systému (nazývaného <systemitem class="username">root</systemitem>).
fr: Fournir un mot de passe pour le compte de l'administrateur système (appelé l'utilisateur <systemitem class="username">root</systemitem>).

source: You should never forget the <systemitem class="username">root</systemitem> password! After you entered it here, the password cannot be retrieved. See <xref linkend="sec.yast_install.user.root"/> for more information. Proceed with <guimenu>Next</guimenu>.
cs: Nikdy byste neměli zapomenout heslo pro správce <systemitem class="username">root</systemitem>! Po zadání již nelze heslo získat. Další informace viz <xref linkend="sec.yast_install.user.root"/>. Pokračujte na <guimenu>Další</guimenu>.
fr: Vous ne devez jamais oublier le mot de passe <systemitem class="username">root</systemitem> ! Après l'avoir saisi ici, le mot de passe ne peut pas être récupéré. Voir <xref linkend="sec.yast_install.user.root"/> pour plus d'informations. Continuez avec <guimenu>Suivant</guimenu>.

source: Passwords and Keyboard Layout
cs: Hesla a rozložení klávesnice
fr: Mots de passe et disposition du clavier

source: It is recommended to only use characters that are available on an English keyboard. In case of a system error or when you need to start your system in rescue mode a localized keyboard might not be available.
cs: Doporučuje se používat pouze znaky, které jsou k dispozici na anglické klávesnici. V případě systémové chyby nebo potřebujete-li systém spustit v záchranném režimu, nemusí být lokalizovaná klávesnice k dispozici.
fr: Il est recommandé d'utiliser uniquement les caractères disponibles sur un clavier anglais. En cas d'erreur système ou lorsque vous devez démarrer votre système en mode de secours, un clavier localisé peut ne pas être disponible.

source: Installation Settings
cs: Nastavení instalace

source: Use the <guimenu>Installation Settings</guimenu> screen to review and—if necessary—change several proposed installation settings. The current configuration is listed for each setting. To change it, click the headline. Some settings, such as firewall or SSH can directly be changed by clicking the respective links.
cs: Na obrazovce <guimenu>Nastavení instalace</guimenu> zkontrolujte a případně změňte několik navrhovaných nastavení instalace. Pro každé nastavení je uvedena aktuální konfigurace. Chcete-li to změnit, klikněte na nadpis. Některá nastavení, například firewall nebo SSH, lze přímo změnit kliknutím na příslušné odkazy.

source: Remote System Access
cs: Vzdálený přístup k systému

source: Changes you can make in the <guimenu>Installation Settings</guimenu>, can also be made later at any time from the installed system. However, if you need remote access directly after the installation, you should adjust the <guimenu>Firewall and SSH</guimenu> settings by opening the SSH port and enabling the SSH server.
cs: Změny, které můžete provést v <guimenu>Nastavení instalace</guimenu>, lze také kdykoli provést z nainstalovaného systému. Pokud však potřebujete vzdálený přístup přímo po instalaci, měli byste upravit nastavení <guimenu>Firewall a SSH</guimenu> otevřením portu SSH ve firewallu a povolením serveru SSH.

source: <guimenu>Booting</guimenu>
cs: <guimenu>Bootování</guimenu>
fr: <guimenu>Démarrage</guimenu>

source: This section shows the boot loader configuration. Changing the defaults is only recommended if really needed. Refer to <xref linkend="cha.grub2"/> for details.
cs: Tato část ukazuje konfiguraci zavaděče systému. Změna výchozích hodnot se doporučuje pouze tehdy, je-li to skutečně nutné. Podrobnosti viz <xref linkend="cha.grub2"/>.
fr: Cette section montre la configuration du chargeur de démarrage. La modification des valeurs par défaut n'est recommandée que si elle est vraiment nécessaire. Reportez-vous à <xref linkend="cha.grub2"/> pour plus de détails.

source: The default scope of software includes the base system and X Window with the selected desktop. Clicking <guimenu>Software</guimenu> opens the <guimenu>Software Selection and System Tasks</guimenu> screen, where you can change the software selection by selecting or deselecting patterns. Each pattern contains several software packages needed for specific functions (for example, Web and LAMP server or a print server). For a more detailed selection based on software packages to install, select <guimenu>Details</guimenu> to switch to the YaST <guimenu>Software Manager</guimenu>. See <xref linkend="cha.yast-software"/> for more information.
cs: Výchozí rozsah softwaru zahrnuje základní systém a X Window s vybranou pracovní plochou. Kliknutím na <guimenu>Software</guimenu> se otevře obrazovka <guimenu>Výběr softwaru a systémové úkoly</guimenu>, kde můžete výběr softwaru změnit výběrem nebo zrušením výběru vzorů. Každý vzor obsahuje několik softwarových balíčků potřebných pro specifické funkce (například Web a LAMP server nebo tiskový server). Chcete-li získat podrobnější výběr na základě softwarových balíčků k instalaci, vyberte <guimenu>Detaily</guimenu> a přejděte na YaST <guimenu>Správce softwaru</guimenu>. Další informace viz <xref linkend="cha.yast-software"/>.

source: <guimenu>Default Systemd Target</guimenu>
cs: <guimenu>Výchozí cíl Systemd</guimenu>

source: If you have chosen to install a desktop system, the system boots into the <guimenu>graphical</guimenu> target, with network, multiuser and display manager support. If you have not installed a desktop, the system boots into a login shell (<guimenu>Text Mode</guimenu>).
cs: Pokud jste se rozhodli nainstalovat stolní/NB systém, systém bootuje do <guimenu>grafického</guimenu> cíle, s podporou sítě, více uživatelů a podporou správce zobrazení. Pokud jste nenainstalovali plochu, systém bootuje do přihlašovacího shellu (<guimenu>Textový režim</guimenu>).

source: <guimenu>System</guimenu>
cs: <guimenu>Systém</guimenu>

source: View detailed hardware information by clicking <guimenu>System</guimenu>. In the resulting screen you can also change <guimenu>Kernel Settings</guimenu>—see <xref linkend="sec.yast_install.proposal.system"/> for more information.
cs: Podrobné informace o hardwaru zobrazíte kliknutím na <guimenu>Systém</guimenu>. Na výsledné obrazovce můžete také změnit <guimenu>Nastavení jádra</guimenu> - viz <xref linkend="sec.yast_install.proposal.system"/> pro více informací.

source: <guimenu>Firewall and SSH</guimenu>
cs: <guimenu>Firewall a SSH</guimenu>

source: By default, the Firewall is enabled with all network interfaces configured for the public zone. See <xref linkend="sec.security.firewall.firewalld"/> for configuration details.
cs: Ve výchozím nastavení je Firewall povolen se všemi síťovými rozhraními nakonfigurovanými pro veřejnou zónu. Podrobnosti o konfiguraci viz <xref linkend="sec.security.firewall.firewalld"/>.

source: The SSH service is disabled by default, its port (22) is closed. Therefore logging in from remote is not possible by default. Click <guimenu>enable</guimenu> and <guimenu>open</guimenu> to toggle these settings.
cs: Ve výchozím nastavení je služba SSH deaktivována, její port (22) je uzavřen. Proto se ve výchozím nastavení nelze k instalovanému systému přihlásit ze vzdáleného počítače. Chcete-li tato nastavení přepnout, klikněte na <guimenu>Povolit</guimenu> a <guimenu>Otevřít</guimenu>.

source: Start the Installation
cs: Spuštění instalace

source: After you have finalized the system configuration on the <guimenu>Installation Settings</guimenu> screen, click <guimenu>Install</guimenu>. Depending on your software selection you may need to agree to license agreements before the installation confirmation screen pops up. Up to this point no changes have been made to your system. After you click <guimenu>Install</guimenu> a second time, the installation process starts.
cs: Po dokončení konfigurace systému na obrazovce <guimenu>Nastavení instalace</guimenu> klikněte na <guimenu>Instalovat</guimenu>. V závislosti na výběru softwaru budete možná muset souhlasit s licenčními smlouvami, než se objeví obrazovka s potvrzením instalace. Dosud nebyly ve vašem systému provedeny žádné změny. Po druhém klepnutí na <guimenu>Instalovat</guimenu> se spustí instalační proces.

source: The Installation Process
cs: Proces instalace

source: During the installation, the progress is shown in detail on the <guimenu>Details</guimenu> tab. The <guimenu><phrase role="productname"><phrase os="osuse">openSUSE Leap</phrase><phrase os="sles">SUSE Linux Enterprise Server</phrase><phrase os="sled">SUSE Linux Enterprise Desktop</phrase></phrase> Release Notes</guimenu> tab shows important information; reading them is recommended.
cs: Během instalace se průběh zobrazuje podrobně na kartě <guimenu>Podrobnosti</guimenu>. Záložka <guimenu><phrase role="productname"><phrase os="osuse">openSUSE Leap</phrase><phrase os="sles">SUSE Linux Enterprise Server</phrase><phrase os="sled">SUSE Linux Enterprise Desktop</phrase></phrase> Poznámky k verzi</guimenu> zobrazuje důležité informace; jejich čtení doporučujeme.

source: After the installation routine has finished, the computer is rebooted into the installed system. Log in and start YaST to fine-tune the system. If you are not using a graphical desktop or are working from remote, refer to <xref linkend="cha.yast.text"/> for information on using YaST from a terminal.
cs: Po dokončení instalační rutiny se počítač rebootuje do nainstalovaného systému. Přihlaste se, spusťte YaST a systém dolaďte. Pokud nepoužíváte grafickou plochu nebo pracujete ze vzdáleného systému, najdete informace o používání YaST z terminálu v <xref linkend="cha.yast.text"/>.
