Repository: openSUSE/doc-sle-translations
Catalog: */po/art_opensuse_install_quick.*.po
Languages: cs, fr

# _
source: translator-credits
cs: překladatelské kredity alkas alkas@volny.cz, 2016, 2020
fr: Crédits translation Lucie Charrier c.chalu@free.fr, 2021

source: <citetitle>Installation Quick Start</citetitle>
cs: <citetitle>Rychlý start instalace</citetitle>
fr: <citetitle>Installation démarrage rapide</citetitle>

source: yes
cs: ano
fr: oui

source: Use the following procedures to install a new version of <phrase role="productname"><phrase os="osuse">openSUSE® Leap</phrase><phrase os="sles">SUSE® Linux Enterprise Server</phrase><phrase os="sled">SUSE® Linux Enterprise Desktop</phrase></phrase> <phrase role="productnumber"><phrase os="osuse">15.0</phrase><phrase os="sles;sled">15</phrase></phrase>. This document gives a quick overview on how to run through a default installation of <phrase role="productname"><phrase os="osuse">openSUSE Leap</phrase><phrase os="sles">SUSE Linux Enterprise Server</phrase><phrase os="sled">SUSE Linux Enterprise Desktop</phrase></phrase> on the x86_64 architecture.
cs: Následující postupy použijte k instalaci nové verze <phrase role="productname"><phrase os="osuse">openSUSE® Leap</phrase><phrase os="sles">SUSE® Linux Enterprise Server</phrase><phrase os="sled">SUSE® Linux Enterprise Desktop</phrase></phrase> <phrase role="productnumber"><phrase os="osuse">15.0</phrase><phrase os="sles;sled">15</phrase></phrase>. Tento dokument poskytuje rychlý přehled, jak projít výchozí instalací <phrase role="productname"><phrase os="osuse">openSUSE Leap</phrase><phrase os="sles">SUSE Linux Enterprise Server</phrase><phrase os="sled">SUSE Linux Enterprise Desktop</phrase></phrase> na architektuře x86_64.
fr: Utilisez les procédures suivantes pour installer une nouvelle version de <phrase role="productname"><phrase os="osuse">openSUSE® Leap</phrase><phrase os="sles">SUSE® Linux Enterprise Server</phrase><phrase os="sled">SUSE® Linux Enterprise Desktop</phrase></phrase> <phrase role="productnumber"><phrase os="osuse">15. 0</phrase><phrase os="sles;sled">15</phrase></phrase>. Ce document donne un aperçu rapide sur la façon de réaliser une installation par défaut de <phrase role="productname"><phrase os="osuse">openSUSE Leap</phrase><phrase os="sles">SUSE Linux Enterprise Server</phrase><phrase os="sled">SUSE Linux Enterprise Desktop</phrase></phrase> sur l'architecture x86_64.

source: Welcome to <phrase role="productname"><phrase os="osuse">openSUSE Leap</phrase><phrase os="sles">SUSE Linux Enterprise Server</phrase><phrase os="sled">SUSE Linux Enterprise Desktop</phrase></phrase>
cs: Vítejte v <phrase role="productname"><phrase os="osuse">openSUSE Leap</phrase><phrase os="sles">SUSE Linux Enterprise Server</phrase><phrase os="sled">SUSE Linux Enterprise Desktop</phrase></phrase>
fr: Bienvenue sur <phrase role="productname"><phrase os="osuse">openSUSE Leap</phrase><phrase os="sles">SUSE Linux Enterprise Server</phrase><phrase os="sled">SUSE Linux Enterprise Desktop</phrase></phrase>

source: For more detailed installation instructions see <xref linkend="cha.install"/>.
cs: Podrobnější návod k instalaci viz <xref linkend="cha.install"/>.
fr: Pour des instructions d'installation plus détaillées, voir <xref linkend="cha.install"/>.

source: Minimum System Requirements
cs: Minimální požadavky na systém
fr: Configuration minimale requise

source: any AMD64/Intel* EM64T processor (32-bit processors are not supported)
cs: jakýkoli procesor AMD64/Intel* EM64T (32-bitové procesory nejsou podporovány)
fr: tout processeur AMD64/Intel* EM64T (les processeurs 32 bits ne sont pas pris en charge)

source: 1 GB physical RAM (2 GB or more strongly recommended)
cs: 1 GB fyzické paměti RAM (velmi doporučujeme 2 GB a více)
fr: 1 Go de RAM physique (2 Go ou plus fortement recommandés)

source: 10 GB available disk space for a minimal installation, 16 GB for a graphical desktop with Btrfs snapshots (more is recommended)
cs: Pro minimální instalaci 10 GB volného místa na disku, pro grafickou plochu se snímky Btrfs 16 GB (a raději více)
fr: 10 GB d'espace disque disponible pour une installation minimale, 16 GB pour un bureau graphique avec des instantanés Btrfs (plus est recommandé)

source: Supports most modern sound and graphics cards, 1024 x 768 display resolution (higher recommended)
cs: Podporuje nejmodernější zvukové a grafické karty, rozlišení displeje aspoň 1024 x 768 (a doporučeno vyšší)
fr: Compatible avec la plupart des cartes son et graphiques actuelles, résolution d'affichage de 1024 x 768 (supérieure recommandée)

source: Installing <phrase role="productname"><phrase os="osuse">openSUSE Leap</phrase><phrase os="sles">SUSE Linux Enterprise Server</phrase><phrase os="sled">SUSE Linux Enterprise Desktop</phrase></phrase>
cs: Instalace <phrase role="productname"><phrase os="osuse">openSUSE Leap</phrase><phrase os="sles">SUSE Linux Enterprise Server</phrase><phrase os="sled">SUSE Linux Enterprise Desktop</phrase></phrase>
fr: Installation de <phrase role="productname"><phrase os="osuse">openSUSE Leap</phrase><phrase os="sles">SUSE Linux Enterprise Server</phrase><phrase os="sled">SUSE Linux Enterprise Desktop</phrase></phrase>

source: Use these instructions if there is no existing Linux system on your machine, or if you want to replace an existing Linux system.
cs: Tyto pokyny použijte, neexistuje-li ve vašem počítači žádný systém Linux, nebo chcete-li nahradit existující systém Linux.
fr: Utilisez ces instructions s'il n'y a pas de système Linux existant sur votre machine, ou si vous voulez remplacer un système Linux existant.

source: Booting the Installation System
cs: Zavedení instalačního systému
fr: Démarrage du système d'installation

source: Insert the <phrase role="productname"><phrase os="osuse">openSUSE Leap</phrase><phrase os="sles">SUSE Linux Enterprise Server</phrase><phrase os="sled">SUSE Linux Enterprise Desktop</phrase></phrase> DVD into the drive, then reboot the computer to start the installation program. On machines with a traditional BIOS you will see the graphical boot screen shown below. On machines equipped with UEFI, a slightly different boot screen is used. Secure boot on UEFI machines is supported.
cs: Vložte <phrase role="productname"><phrase os="osuse">openSUSE Leap</phrase><phrase os="sles">SUSE Linux Enterprise Server</phrase><phrase os="sled">SUSE Linux Enterprise Desktop</phrase></phrase> DVD do jednotky, pak rebootujte počítač, aby se spustil instalační program. Na strojích s tradičním BIOSem se pak zobrazí grafická obrazovka bootu, viz dále. Na strojích vybavených UEFI se používá trochu jiná. Na strojích s UEFI je podporován bezpečný boot.
fr: Insérez le DVD <phrase role="productname"><phrase os="osuse">openSUSE Leap</phrase><phrase os="sles">SUSE Linux Enterprise Server</phrase><phrase os="sled">SUSE Linux Enterprise Desktop</phrase></phrase> dans le lecteur, puis redémarrez l'ordinateur pour lancer le programme d'installation. Sur les machines équipées d'un BIOS traditionnel, vous verrez l'écran de démarrage graphique illustré ci-dessous. Sur les machines équipées de l'UEFI, un écran de démarrage légèrement différent est utilisé. Le démarrage sécurisé sur les machines UEFI est pris en charge.

source: On BIOS machines, use <keycap>F2</keycap> to change the language for the installer. A corresponding keyboard layout is chosen automatically. See <xref linkend="sec.boot_parameters.screen"/> or <xref linkend="sec.boot_parameters.uefi"/> for more information about changing boot parameters. On UEFI machines adjust the language and keyboard settings in the next step.
cs: Ke změně jazyka instalačního programu použijte na počítačích s BIOSem klávesu <keycap>F2</keycap> . Odpovídající rozložení klávesnice bude vybráno automaticky. Další informace o změně spouštěcích parametrů viz <xref linkend="sec.boot_parameters.screen"/> nebo <xref linkend="sec.boot_parameters.uefi"/>. Na počítačích s UEFI upravte nastavení jazyka a klávesnice v dalším kroku.
fr: Sur les machines BIOS, utilisez <keycap>F2</keycap> pour changer la langue du programme d'installation. Une disposition de clavier correspondante est choisie automatiquement. Voir <xref linkend="sec.boot_parameters.screen"/> ou <xref linkend="sec.boot_parameters.uefi"/> pour plus d'informations sur la modification des paramètres de démarrage. Sur les machines UEFI, ajustez les paramètres de langue et de clavier dans l'étape suivante.

source: Select <guimenu>Installation</guimenu> on the boot screen, then press <keycap function="enter"/>. This boots the system and loads the <phrase role="productname"><phrase os="osuse">openSUSE Leap</phrase><phrase os="sles">SUSE Linux Enterprise Server</phrase><phrase os="sled">SUSE Linux Enterprise Desktop</phrase></phrase> installer.
cs: Na obrazovce bootu zvolte <guimenu>Instalace</guimenu> a pak stiskněte <keycap function="enter"/>. To nabootuje systém a zavede instalátor <phrase role="productname"><phrase os="osuse">openSUSE Leap</phrase><phrase os="sles">SUSE Linux Enterprise Server</phrase><phrase os="sled">SUSE Linux Enterprise Desktop</phrase></phrase>.
fr: Sélectionnez <guimenu>Installation</guimenu> sur l'écran de démarrage, puis appuyez sur <keycap function="enter"/>. Cela démarre le système et charge le programme d'installation de <phrase role="productname"><phrase os="osuse">openSUSE Leap</phrase><phrase os="sles">SUSE Linux Enterprise Server</phrase><phrase os="sled">SUSE Linux Enterprise Desktop</phrase></phrase>.

source: Language, Keyboard and License Agreement
cs: Jazyk, klávesnice a licenční smlouva
fr: Langue, clavier et accord de licence

source: The <guimenu>Language</guimenu> and <guimenu>Keyboard Layout</guimenu> settings are initialized with the language you chose on the boot screen. If you did not change the default, it will be English (US). Change the settings here, if necessary. Use the <guimenu>Keyboard Test</guimenu> text box to test the layout.
cs: Nastavení <guimenu>Jazyk</guimenu> a <guimenu>Rozložení klávesnice</guimenu> jsou inicializována jazykem, který jste vybrali na úvodní obrazovce. Pokud jste výchozí nastavení nezměnili, bude to angličtina (USA). V případě potřeby zde změňte nastavení. Rozložení otestujte pomocí textového pole <guimenu>Test klávesnice</guimenu>.
fr: Les paramètres <guimenu>Language</guimenu> et <guimenu>Keyboard Layout</guimenu> sont initialisés avec la langue que vous avez choisie sur l'écran de démarrage. Si vous n'avez pas modifié la valeur par défaut, il s'agit de l'anglais (US). Modifiez les paramètres ici, si nécessaire. Utilisez la zone de texte <guimenu>Test du clavier</guimenu> pour tester la disposition.

source: Read the License Agreement. It is presented in the language you have chosen. Other <guimenu>License Translations</guimenu> are available. Proceed with <guimenu>Next</guimenu>.
cs: Přečtěte si licenční smlouvu. Je uvedena v jazyce, který jste si vybrali. K dispozici jsou další <guimenu>překlady licencí</guimenu>. Pokračujte na <guimenu>Další</guimenu>.

source: Network Settings
cs: Nastavení sítě
fr: Paramètres réseau

source: A system analysis is performed, where the installer probes for storage devices, and tries to find other installed systems. If the network was automatically configured via DHCP during the start of the installation, you will be taken to the registration step.
cs: Provede se systémová analýza, kde instalační program zkoumá úložná zařízení a pokouší se najít jiné nainstalované systémy. Pokud byla síť automaticky zkonfigurována pomocí DHCP během začátku instalace, přejdete k registračnímu kroku.
fr: Une analyse du système est effectuée, au cours de laquelle le programme d'installation recherche les périphériques de stockage et essaie de trouver d'autres systèmes installés. Si le réseau a été automatiquement configuré via DHCP au début de l'installation, vous serez dirigé vers l'étape d'enregistrement.

source: If the network is not yet configured, the <guimenu>Network Settings</guimenu> dialog opens. Choose a network interface from the list and configure it with <guimenu>Edit</guimenu>. Alternatively, <guimenu>Add</guimenu> an interface manually. See <xref linkend="sec.yast_install.network"/> and <xref linkend="sec.network.yast"/> for more information. If you prefer to do an installation without network access, skip this step without making any changes and proceed with <guimenu>Next</guimenu>.
cs: Není-li síť dosud zkonfigurována, otevře se dialogové okno <guimenu>Nastavení sítě</guimenu>. Vyberte síťové rozhraní ze seznamu a konfigurujte jej pomocí <guimenu>Upravit</guimenu>. Nebo <guimenu>Přidat</guimenu> rozhraní ručně. Další informace viz <xref linkend="sec.yast_install.network"/> a <xref linkend="sec.network.yast"/>. Pokud dáváte přednost instalaci bez přístupu k síti, tento krok přeskočte bez provedení jakýchkoli změn a pokračujte <guimenu>Další</guimenu>.
fr: Si le réseau n'est pas encore configuré, la boîte de dialogue <guimenu>Network Settings</guimenu> s'ouvre. Choisissez une interface réseau dans la liste et configurez-la avec <guimenu>Edit</guimenu>. Vous pouvez également <guimenu>Add</guimenu> une interface manuellement. Voir <xref linkend="sec.yast_install.network"/> et <xref linkend="sec.network.yast"/> pour plus d'informations. Si vous préférez effectuer une installation sans accès au réseau, sautez cette étape sans apporter de modifications et passez à <guimenu>Next</guimenu>.

source: User Interface
cs: Uživatelské rozhraní
fr: Interface utilisateur

source: Choose a general software and system configuration with this step by selecting a desktop or server configuration.
cs: V tomto kroku vyberte obecnou konfiguraci softwaru a systému výběrem konfigurace: a) osobního počítače (PC)/pracovní stanice (PS) nebo b) serveru. Osobní počítač i pracovní stanice mohou být stolní nebo přenosný notebook (NB). Server se na NB instaluje jen výjimečně.
fr: Choisissez une configuration générale de logiciel et de système avec cette étape en sélectionnant une configuration de bureau ou de serveur.

source: For a desktop installation, choose between <guimenu>Desktop with KDE Plasma</guimenu> and <guimenu>Desktop with GNOME</guimenu>. KDE is slightly similar to Windows, GNOME offers an alternative, innovative environment.
cs: Pro instalaci PC/PS zvolte mezi <guimenu>Stolní/NB s KDE Plasma</guimenu> a <guimenu>Stolní/NB s GNOME</guimenu>. KDE se mírně podobá Windows, GNOME nabízí alternativní, inovativní prostředí.
fr: Pour une installation de bureau, choisissez entre <guimenu>Desktop with KDE Plasma</guimenu> et <guimenu>Desktop with GNOME</guimenu>. KDE est légèrement similaire à Windows, GNOME offre un environnement alternatif et innovant.

source: If setting up a server, you probably do not need a graphical user interface. Choose <guimenu>Server (Text Mode)</guimenu> in this case. Alternatively, set up a server system with a read-only root partition and transactional updates by choosing <guimenu>Transactional Server</guimenu>. This selection aslo is a prerequisite for setting up openSUSE Kubic. See <link xlink:href="https://kubic.opensuse.org/blog/2018-04-04-transactionalupdates/"/> for mor information on transactional updates.
cs: Instalujete-li server, pravděpodobně nepotřebujete grafické uživatelské rozhraní. V tomto případě vyberte <guimenu>Server (textový režim)</guimenu>. Alternativně můžete instalovat serverový systém s kořenovým oddílem pouze pro čtení a transakčními aktualizacemi výběrem <guimenu>Transakční server</guimenu>. Tento výběr je také předpokladem pro nastavení openSUSE Kubic. Viz <link xlink:href="https://kubic.opensuse.org/blog/2018-04-04-transactionalupdates/"/> pro více informací o transakčních aktualizacích.
fr: Si vous configurez un serveur, vous n'avez probablement pas besoin d'une interface utilisateur graphique. Choisissez <guimenu>Server (Text Mode)</guimenu> dans ce cas. Vous pouvez également configurer un système serveur avec une partition racine en lecture seule et des mises à jour transactionnelles en choisissant <guimenu>Transactional Server</guimenu>. Cette sélection est également une condition préalable à la configuration d'openSUSE Kubic. Voir <link xlink:href="https://kubic.opensuse.org/blog/2018-04-04-transactionalupdates/"/> pour plus d'informations sur les mises à jour transactionnelles.

source: You can also manually choose the software configuration for your system. Select <guimenu>Custom</guimenu> and then <guimenu>Next</guimenu> to get to the <guimenu>Software Selection and System Tasks</guimenu> dialog. Choose one or more patterns for installation. By clicking <guimenu>Details</guimenu>, you can select individual packages.
cs: Můžete také ručně vybrat konfiguraci softwaru pro váš systém. Vyberte <guimenu>Vlastní</guimenu> a potom <guimenu>Další</guimenu>, abyste se dostali do dialogu <guimenu>Výběr softwaru a systémové úlohy</guimenu>. Vyberte jeden nebo více vzorů pro instalaci. Kliknutím na <guimenu>Detaily</guimenu> můžete vybrat jednotlivé balíčky.
fr: Vous pouvez également choisir manuellement la configuration logicielle de votre système. Sélectionnez <guimenu>Custom</guimenu>, puis <guimenu>Next</guimenu> pour accéder à la boîte de dialogue <guimenu>Sélection de logiciels et tâches système</guimenu>. Choisissez un ou plusieurs modèles pour l'installation. En cliquant sur <guimenu>Details</guimenu>, vous pouvez sélectionner des paquets individuels.

source: The <guimenu>User Interface</guimenu> dialog also offers the possibility to <guimenu>Configure Online Repositories</guimenu>. Here you can choose to add additional official openSUSE software repositories, offering more software. Using the default selection is recommended. Make sure to add at least the main update repository, because it makes sure the system is installed with latest security patches. You have the following choices:
cs: Dialog <guimenu>Uživatelské rozhraní</guimenu> také nabízí možnost <guimenu>Konfigurovat online úložiště</guimenu>. Zde si můžete zvolit přidání dalších oficiálních softwarových úložišť openSUSE, které nabízejí další software. Doporučuje se však použít výchozí výběr. Nezapomeňte přidat alespoň hlavní úložiště aktualizací, protože zajišťuje, že je systém nainstalován s nejnovějšími opravami zabezpečení. Máte na výběr následující možnosti:
fr: La boîte de dialogue <guimenu>User Interface</guimenu> offre également la possibilité de <guimenu>Configurer les dépôts en ligne</guimenu>. Ici, vous pouvez choisir d'ajouter des dépôts de logiciels officiels openSUSE supplémentaires, offrant plus de logiciels. L'utilisation de la sélection par défaut est recommandée. Assurez-vous d'ajouter au moins le dépôt de mise à jour principal, car il s'assure que le système est installé avec les derniers correctifs de sécurité. Vous avez les choix suivants :

source: The <guimenu>Main Repository (OSS)</guimenu> contains open source software (OSS). Compared to the DVD installation media, it contains many additional software packages, among them the above mentioned desktop systems. Choose this repository to install them.
cs: <guimenu>Hlavní úložiště (OSS)</guimenu> obsahuje software s otevřeným zdrojovým kódem (OSS). Ve srovnání s instalačním médiem DVD obsahuje mnoho dalších softwarových balíčků, mezi nimi výše uvedené stolní/NB systémy. Chcete-li je nainstalovat, vyberte toto úložiště.
fr: Le <guimenu>Dépôt principal (OSS)</guimenu> contient des logiciels libres (OSS). Par rapport au support d'installation DVD, il contient de nombreux logiciels supplémentaires, parmi lesquels les systèmes de bureau mentionnés ci-dessus. Choisissez ce dépôt pour les installer.

source: The <guimenu>Main Update Repository</guimenu> contains security updates and fixes for packages from the <guimenu>Main Repository (OSS)</guimenu> and the DVD installation media. Choosing this repository is recommended for all installation scenarios.
cs: <guimenu>Hlavní úložiště aktualizací</guimenu> obsahuje aktualizace zabezpečení a opravy balíčků z <guimenu>Hlavního úložiště (OSS)</guimenu> a instalačního média DVD. Výběr tohoto úložiště je doporučen pro všechny instalační scénáře.
fr: Le <guimenu>Dépôt principal de mises à jour</guimenu> contient des mises à jour de sécurité et des correctifs pour les paquets du <guimenu>Dépôt principal (OSS)</guimenu> et du support d'installation DVD. Le choix de ce dépôt est recommandé pour tous les scénarios d'installation.

source: The <guimenu>Main Repository (Non-OSS)</guimenu> contains packages with a proprietary software license. Choosing it is not required for installing a custom desktop system.
cs: Hlavní úložiště <guimenu>(Non-OSS)</guimenu> obsahuje balíčky s licencí proprietárního softwaru. Jeho výběr není pro instalaci vlastního stolního/NB systému nutný.
fr: Le <guimenu>Dépôt principal (Non-OSS)</guimenu> contient des paquets avec une licence de logiciel propriétaire. Le choisir n'est pas nécessaire pour installer un système de bureau personnalisé.

source: Choosing <guimenu>Main Update Repository (Non-OSS)</guimenu> is recommended when also having chosen the <guimenu>Main Repository (Non-OSS)</guimenu>. It contains the respective updates and security fixes.
cs: Výběr <guimenu>Hlavního úložiště aktualizací (non-OSS)</guimenu> je doporučen, pokud jste také vybrali <guimenu>Hlavní úložiště (non-OSS)</guimenu>. Obsahuje příslušné aktualizace a opravy zabezpečení.
fr: Le choix du <guimenu>Dépôt principal de mises à jour (non-OSS)</guimenu> est recommandé lorsqu'on a également choisi le <guimenu>Dépôt principal (non-OSS)</guimenu>. Il contient les mises à jour et les correctifs de sécurité associés.

source: All other repositories are intended for experienced users and developers. Click on a repository name to get more information.
cs: Všechna ostatní úložiště jsou určena zkušeným uživatelům a vývojářům. Kliknutím na název úložiště získáte další informace.
fr: Tous les autres dépôts sont destinés aux utilisateurs et aux développeurs expérimentés. Cliquez sur le nom d'un dépôt pour obtenir plus d'informations.

source: Confirm your selection with <guimenu>Next</guimenu>. Depending on your choice, you need to confirm one or more license agreements. Do so by choosing <guimenu>Next</guimenu> until you return to the <guimenu>User Interface</guimenu> screen. Now choose <guimenu>Next</guimenu> to proceed.
cs: Výběr potvrďte pomocí <guimenu>Další</guimenu>. V závislosti na vašem výběru musíte potvrdit jednu nebo více licenčních smluv. To provedete výběrem <guimenu>Další</guimenu>, dokud se nevrátíte na obrazovku <guimenu>Uživatelské rozhraní</guimenu>. Nyní pokračujte volbou <guimenu>Další</guimenu>.
fr: Confirmez votre choix avec <guimenu>Suivant</guimenu>. En fonction de votre choix, vous devez confirmer un ou plusieurs contrats de licence. Faites-le en choisissant <guimenu>Suivant</guimenu> jusqu'à ce que vous reveniez à l'écran <guimenu>User Interface</guimenu>. Choisissez maintenant <guimenu>Suivant</guimenu> pour continuer.

source: Suggested Partitioning
cs: Navrhované rozdělení oddílů
fr: Partitionnement suggéré
