Repository: openSUSE/doc-sle-translations
Catalog: */po/audit_setup.*.po
Languages: cs

source: Another thing to keep in mind when creating file and directory watches is that audit cannot deal with files that do not exist when the rules are created. Any file that is added to your system while audit is already running is not watched unless you extend the rule set to watch this new file.
cs: Při vytváření hlídáčků souborů a adresářů je třeba mít na paměti, že audit při vytváření pravidel nemůže pracovat se soubory, které neexistují. Jakýkoli soubor, který je přidán do vašeho systému, když audit už běží, není sledován, pokud nerozšíříte sadu pravidel o sledování tohoto nového souboru.

source: For more information about creating custom rules, refer to <xref linkend="sec.audit.rules"/>.
cs: Další informace o vytváření vlastních pravidel najdete v <xref linkend="sec.audit.rules"/>.

source: Changing Audit Rules
cs: Změna pravidel auditu

source: After you change audit rules, always restart the audit daemon with <command>systemctl restart auditd</command> to reread the changed rules.
cs: Po změně pravidel auditu vždy restartujte démona auditu příkazem <command>systemctl restart auditd</command>, aby si přečetl změněná pravidla.

source: Configuring Audit Reports
cs: Konfigurace hlášení auditu

source: To avoid having to dig through the raw audit logs to get an impression of what your system is currently doing, run custom audit reports at certain intervals. Custom audit reports enable you to focus on areas of interest and get meaningful statistics on the nature and frequency of the events you are monitoring. To analyze individual events in detail, use the ausearch tool.
cs: Chcete-li se vyhnout nutnosti procházet surové protokoly auditu, abyste získali představu o tom, co váš systém aktuálně dělá, spusťte v určitých intervalech Vaše vlastní hlášení auditu, které vám umožní zaměřit se na oblasti zájmu a získat smysluplné statistiky o povaze a frekvenci událostí, které sledujete. Chcete-li podrobně analyzovat jednotlivé události, použijte nástroj ausearch.

source: Before setting up audit reporting, consider the following:
cs: Před nastavením hlášení auditu zvažte následující:

source: What types of events do you want to monitor by generating regular reports? Select the appropriate aureport command lines as described in <xref linkend="sec.audit.aureport.gen"/>.
cs: Jaké typy událostí chcete sledovat generováním pravidelných zpráv? Vyberte příslušné příkazové řádky aureport, jak je popsáno v <xref linkend="sec.audit.aureport.gen"/>.

source: What do you want to do with the audit reports? Decide whether to create graphical charts from the data accumulated or whether it should be transferred into any sort of spreadsheet or database. Set up the aureport command line and further processing similar to the examples shown in <xref linkend="sec.audit.viz"/> if you want to visualize your reports.
cs: Co chcete dělat se zprávami o auditu? Rozhodněte se, zda chcete z nashromážděných dat vytvořit grafy nebo zda se mají přenést do nějakého tabulkového procesoru nebo databáze. Pokud chcete vizualizovat své sestavy, nastavte příkazový řádek aureport a další zpracování podobné příkladům uvedeným v <xref linkend="sec.audit.viz"/>.

source: When and at which intervals should the reports run? Set up appropriate automated reporting using cron.
cs: Kdy a v jakých intervalech by se zprávy měly spouštět? Nastavte vhodné automatické hlášení pomocí cron.

source: For this example, assume that you are interested in finding out about any attempts to access your audit, PAM, and system configuration. Proceed as follows to find out about file events on your system:
cs: V tomto příkladu předpokládejme, že vás zajímá zjištění jakýchkoli pokusů o přístup k vaší konfiguraci auditu, PAM a systému. Chcete-li zjistit informace o událostech souborů ve vašem systému, postupujte takto:

source: Generate a full summary report of all events and check for any anomalies in the summary report, for example, have a look at the <quote>failed syscalls</quote> record, because these might have failed because of insufficient permissions to access a file or a file not being there:
cs: Vygenerujte úplnou souhrnnou zprávu o všech událostech a zkontrolujte všechny anomálie v souhrnné zprávě, například se podívejte na záznam <quote>failed syscalls</quote> (selhavší volání systému), protože mohla selhat kvůli nedostatečnému oprávnění pro přístup k souboru nebo kvůli přístupu k neexistujícímu souboru:

source: <prompt>tux &gt; </prompt><command>sudo</command> <command>aureport</command> Summary Report ====================== Range of time in logs: 03/02/09 14:13:38.225 - 17/02/09 16:30:10.352 Selected time for report: 03/02/09 14:13:38 - 17/02/09 16:30:10.352 Number of changes in configuration: 24 Number of changes to accounts, groups, or roles: 0 Number of logins: 9 Number of failed logins: 15 Number of authentications: 19 Number of failed authentications: 578 Number of users: 3 Number of terminals: 15 Number of host names: 4 Number of executables: 20 Number of files: 279 Number of AVC's: 0 Number of MAC events: 0 Number of failed syscalls: 994 Number of anomaly events: 0 Number of responses to anomaly events: 0 Number of crypto events: 0 Number of keys: 2 Number of process IDs: 1238 Number of events: 5435
cs: <prompt>tux &gt; </prompt><command>sudo</command> <command>aureport</command> Summary Report ====================== Range of time in logs: 03/02/09 14:13:38.225 - 17/02/09 16:30:10.352 [čas začátku a konce záznamu] Selected time for report: 03/02/09 14:13:38 - 17/02/09 16:30:10.352 [zvolený čas hlášení] Number of changes in configuration: 24 [Počet: - změn v konfiguraci] Number of changes to accounts, groups, or roles: 0 [- změn účtů, skupin, rolí] Number of logins: 9 [- přihlášení] Number of failed logins: 15 [- selhavších přihlášení] Number of authentications: 19 [- ověření] Number of failed authentications: 578 [- selhavších ověření] Number of users: 3 [- uživatelů] Number of terminals: 15 [- terminálů] Number of host names: 4 [- názvů počítačů v síti] Number of executables: 20 [- spustitelných programů] Number of files: 279 [- souborů] Number of AVC's: 0 [- AVC - připisování záznamů na konec souborů] Number of MAC events: 0 [- událostí MAC] Number of failed syscalls: 994 [- selhavších volání systému] Number of anomaly events: 0 [- mimořádných událostí] Number of responses to anomaly events: 0 [- odpovědí na mimořádné události] Number of crypto events: 0 [- krypto událostí] Number of keys: 2 [- klíčů] Number of process IDs: 1238 [- ID procesů] Number of events: 5435 [- událostí]

source: Run a summary report for failed events and check the <quote>files</quote> record for the number of failed file access events:
cs: Spusťte souhrnnou zprávu o neúspěšných událostech a zkontrolujte záznam <quote>files</quote> o počtu neúspěšných událostí přístupu k souborům:

source: To list the files that could not be accessed, run a summary report of failed file events:
cs: Chcete-li zobrazit seznam souborů, ke kterým nelze získat přístup, spusťte souhrnné hlášení o událostech neúspěchů u souborů:

source: To focus this summary report on a few files or directories of interest only, such as <filename>/etc/audit/auditd.conf</filename>, <filename>/etc/pam.d</filename>, and <filename>/etc/sysconfig</filename>, use a command similar to the following:
cs: Chcete-li zaměřit tento souhrnný přehled pouze na několik souborů nebo adresářů, které vás zajímají, například <filename>/etc/audit/auditd.conf</filename>, <filename>/etc/pam.d</filename> a <filename>/etc/sysconfig</filename>, použijte příkaz podobný následujícímu:

source: From the summary report, then proceed to isolate these items of interest from the log and find out their event IDs for further analysis:
cs: V souhrnném přehledu pokračujte vyjmutím těchto zajímavých položek z protokolu a vyhledejte jejich ID událostí pro další analýzu:

source: Use the event ID to get a detailed record for each item of interest:
cs: Použijte ID události k získání podrobného záznamu pro každou zajímavou položku:

source: Focusing on a Certain Time Frame
cs: Zaměření na určitý časový rámec

source: If you are interested in events during a particular period of time, trim down the reports by using start and end dates and times with your <command>aureport</command> commands (<option>-ts</option> and <option>-te</option>). For more information, refer to <xref linkend="sec.audit.aureport.gen"/>.
cs: Pokud vás zajímají události v určitém časovém období, ořízněte sestavy na rozmezí data a času zahájení a ukončení příkazy <command>aureport</command> (<option>-ts</option> a <option>-te</option>). Další informace najdete na <xref linkend="sec.audit.aureport.gen"/>.

source: All steps (except for the last one) can be run automatically and would easily be scriptable and configured as cron jobs. Any of the <literal>--failed --summary</literal> reports could be transformed easily into a bar chart that plots files versus failed access attempts. For more information about visualizing audit report data, refer to <xref linkend="sec.audit.viz"/>.
cs: Všechny kroky (kromě posledního) lze spustit automaticky a lze je snadno skriptovat a konfigurovat jako úlohy cronu. Kterýkoli z přehledů <literal>--failed --summary</literal> lze snadno transformovat do sloupcového grafu, který vykresluje soubory proti neúspěšným pokusům o přístup. Další informace o vizualizaci dat hlášení auditu najdete v <xref linkend="sec.audit.viz"/>.

source: Configuring Log Visualization
cs: Konfigurace vizualizace protokolu

source: Using the scripts <command>mkbar</command> and <command>mkgraph</command> you can illustrate your audit statistics with various graphs and charts. As with any other <command>aureport</command> command, the plotting commands are scriptable and can easily be configured to run as cron jobs.
cs: Pomocí skriptů <command>mkbar</command> a <command>mkgraph</command> můžete ilustrovat své statistiky auditu různými grafy a tabulkami. Stejně jako u jiných příkazů <command>aureport</command> jsou příkazy pro vykreslování skriptovatelné a lze je snadno konfigurovat tak, aby fungovaly jako úlohy cronu.

source: <command>mkbar</command> and <command>mkgraph</command> were created by Steve Grubb at Red Hat. They are available from <link xlink:href="http://people.redhat.com/sgrubb/audit/visualize/"/>. Because the current version of audit in <phrase role="productname"><phrase os="osuse">openSUSE Leap</phrase><phrase os="sles">SUSE Linux Enterprise Server</phrase><phrase os="sled">SUSE Linux Enterprise Desktop</phrase></phrase> does not ship with these scripts, proceed as follows to make them available on your system:
cs: <command>mkbar</command> a <command>mkgraph</command> vytvořil Steve Grubb v Red Hat. Jsou k dispozici od <link xlink:href="http://people.redhat.com/sgrubb/audit/visualize/"/>. Protože aktuální verze auditu v <phrase role="productname"><phrase os="osuse">openSUSE Leap</phrase><phrase os="sles">SUSE Linux Enterprise Server</phrase><phrase os="sled">SUSE Linux Enterprise Desktop</phrase></phrase> se nedodává s těmito skripty, postupujte následovně, abyste je ve svém systému zpřístupnili:

source: Downloaded Content Is Dangerous
cs: Stažený obsah je nebezpečný

source: Use <command>mkbar</command> and <command>mkgraph</command> at your own risk. Any content downloaded from the Web is potentially dangerous to your system, even more so when run with <systemitem class="username">root</systemitem> privileges.
cs: Používejte <command>mkbar</command> a <command>mkgraph</command> na své vlastní riziko. Jakýkoli obsah stažený z webu je pro váš systém potenciálně nebezpečný, a to tím více, když je spuštěn s oprávněním <systemitem class="username">root</systemitem>.

source: Download the scripts to <systemitem class="username">root</systemitem>'s <filename>~/bin</filename> directory:
cs: Stáhněte si skripty do adresáře <filename>~/ bin</filename> superuživatele <systemitem class="username">root</systemitem>:

source: Adjust the file permissions to read, write, and execute for <systemitem class="username">root</systemitem>:
cs: Upravte oprávnění souboru pro čtení, zápis a spouštění pro superuživatele <systemitem class="username">root</systemitem>:

source: To plot summary reports, such as the ones discussed in <xref linkend="sec.audit.aurepo"/>, use the script <command>mkbar</command>. Some example commands could look like the following:
cs: Chcete-li graficky vynést souhrnné zprávy, jako jsou zprávy popsané v <xref linkend="sec.audit.aurepo"/>, použijte skript <command>mkbar</command>. Některé příklady příkazů mohou vypadat takto:

source: Create a Summary of Events
cs: Vytvořte souhrn událostí

source: Create a Summary of File Events
cs: Vytvořte souhrn událostí souboru

source: Create a Summary of Login Events
cs: Vytvořte souhrn událostí přihlášení

source: Create a Summary of User Events
cs: Vytvořte souhrn uživatelských událostí

source: Create a Summary of System Call Events
cs: Vytvořte souhrn událostí systémových volání

source: To create a summary chart of failed events of any of the above event types, add the <option>--failed</option> option to the respective <command>aureport</command> command. To cover a certain period of time only, use the <option>-ts</option> and <option>-te</option> options on aureport. Any of these commands can be tweaked further by narrowing down its scope using grep or egrep and regular expressions. See the comments in the <command>mkbar</command> script for an example. Any of the above commands produces a PNG file containing a bar chart of the requested data.
cs: Chcete-li vytvořit souhrnný graf neúspěšných událostí některého z výše uvedených typů událostí, přidejte možnost <option>--failed</option> do příslušného příkazu <command>aureport</command>. Chcete-li pokrýt pouze určité časové období, použijte v aureport možnosti <option>-ts</option> a <option>-te</option>. Libovolný z těchto příkazů lze dále vylepšit zúžením jeho rozsahu pomocí grep nebo egrep a regulárních výrazů. Příklad najdete v komentářích ve skriptu <command>mkbar</command>. Jakýkoli z výše uvedených příkazů vytvoří soubor PNG obsahující sloupcový graf požadovaných dat.

source: To illustrate the relationship between different kinds of audit objects, such as users and system calls, use the script <command>mkgraph</command>. Some example commands could look like the following:
cs: Pro ilustraci vztahu mezi různými druhy objektů auditu, jako jsou uživatelé a systémová volání, použijte skript <command>mkgraph</command>. Některé příklady příkazů mohou vypadat takto:

source: Users versus Executables
cs: Uživatelé versus spustitelné soubory

source: Users versus Files
cs: Uživatelé versus soubory

source: System Calls versus Commands
cs: Systémová volání versus příkazy

source: System Calls versus Files
cs: Systémová volání versus soubory

source: Graphs can also be combined to illustrate complex relationships. See the comments in the <command>mkgraph</command> script for further information and an example. The graphs produced by this script are created in PostScript format by default, but you can change the output format by changing the <envar>EXT</envar> variable in the script from <literal>ps</literal> to <literal>png</literal> or <literal>jpg</literal>.
cs: Grafy lze také kombinovat pro ilustraci složitých vztahů. Další informace a příklad najdete v komentářích ve skriptu <command>mkgraph</command>. Grafy vytvořené tímto skriptem jsou ve výchozím nastavení vytvářeny ve formátu PostScript, ale výstupní formát můžete změnit změnou proměnné <envar>EXT</envar> ve skriptu z <literal>ps</literal> na <literal>png</literal> nebo <literal>jpg</literal>.
