Repository: openSUSE/doc-sle-translations
Catalog: */po/audit_setup.*.po
Languages: cs

# _
source: translator-credits
cs: překladatelské kredity alkas alkas@volny.cz, 2016, 2020

source: Setting Up the Linux Audit Framework
cs: Nastavení Linux Audit Framework

source: This chapter shows how to set up a simple audit scenario. Every step involved in configuring and enabling audit is explained in detail. After you have learned to set up audit, consider a real-world example scenario in <xref linkend="cha.audit.scenarios"/>.
cs: Tato kapitola ukazuje, jak nastavit jednoduchý scénář auditu. Každý krok související s konfigurací a umožněním auditu je podrobně vysvětlen. Poté, co jste se naučili nastavovat audit, prohlédněte si ukázkový scénář z reálného světa v <xref linkend="cha.audit.scenarios"/>.

source: To set up audit on <phrase role="productname"><phrase os="osuse">openSUSE Leap</phrase><phrase os="sles">SUSE Linux Enterprise Server</phrase><phrase os="sled">SUSE Linux Enterprise Desktop</phrase></phrase>, you need to complete the following steps:
cs: Chcete-li nastavit audit na <phrase role="productname"> <phrase os="osuse">openSUSE Leap</phrase> <phrase os="sles">SUSE Linux Enterprise Server</phrase> <phrase os="sled">SUSE Linux Enterprise Desktop</phrase> </phrase>, musíte provést následující kroky:

source: Make sure that all required packages are installed: <systemitem class="resource">audit</systemitem>, <systemitem class="resource">audit-libs</systemitem>, and optionally <systemitem class="resource">audit-libs-python</systemitem>. To use the log visualization as described in <xref linkend="sec.audit.viz"/>, install <systemitem class="resource">gnuplot</systemitem> and <systemitem class="resource">graphviz</systemitem> from the <phrase role="productname"><phrase os="osuse">openSUSE Leap</phrase><phrase os="sles">SUSE Linux Enterprise Server</phrase><phrase os="sled">SUSE Linux Enterprise Desktop</phrase></phrase> media.
cs: Ujistěte se, že jsou nainstalovány všechny požadované balíčky: <systemitem class="resource">audit</systemitem>, <systemitem class="resource">audit-libs</systemitem> a volitelně <systemitem class="resource">audit-libs-python</systemitem>. Chcete-li použít vizualizaci protokolu, jak je popsáno v <xref linkend="sec.audit.viz"/>, instalujte <systemitem class="resource">gnuplot</systemitem> a <systemitem class="resource">graphviz</systemitem> z média <phrase role="productname"><phrase os="osuse">openSUSE Leap</phrase><phrase os="sles">SUSE Linux Enterprise Server</phrase><phrase os="sled">SUSE Linux Enterprise Desktop</phrase></phrase>.

source: Determine the components to audit. Refer to <xref linkend="sec.audit.choose"/> for details.
cs: Určete komponenty k auditu. Podrobnosti viz <xref linkend="sec.audit.choose"/>.

source: Check or modify the basic audit daemon configuration. Refer to <xref linkend="sec.audit.config"/> for details.
cs: Zkontrolujte nebo upravte základní konfiguraci démona auditu. Podrobnosti viz <xref linkend="sec.audit.config"/>.

source: Enable auditing for system calls. Refer to <xref linkend="sec.audit.syscall"/> for details.
cs: Povolit auditování systémových volání. Podrobnosti viz <xref linkend="sec.audit.syscall"/>.

source: Compose audit rules to suit your scenario. Refer to <xref linkend="sec.audit.aurules"/> for details.
cs: Vytvořte pravidla auditu podle svého scénáře. Podrobnosti najdete v <xref linkend="sec.audit.aurules"/>.

source: Generate logs and configure tailor-made reports. Refer to <xref linkend="sec.audit.aurepo"/> for details.
cs: Vytvářejte protokoly a konfigurujte sestavy šité na míru. Podrobnosti najdete v <xref linkend="sec.audit.aurepo"/>.

source: Configure optional log visualization. Refer to <xref linkend="sec.audit.viz"/> for details.
cs: Konfigurujte volitelnou vizualizaci protokolu. Podrobnosti najdete v <xref linkend="sec.audit.viz"/>.

source: Controlling the Audit Daemon
cs: Ovládání auditního démona

source: Before configuring any of the components of the audit system, make sure that the audit daemon is not running by entering <command>systemctl status auditd</command> as <systemitem class="username">root</systemitem>. On a default <phrase role="productname"><phrase os="osuse">openSUSE Leap</phrase><phrase os="sles">SUSE Linux Enterprise Server</phrase><phrase os="sled">SUSE Linux Enterprise Desktop</phrase></phrase> system, audit is started on boot, so you need to turn it off by entering <command>systemctl stop auditd</command>. Start the daemon after configuring it with <command>systemctl start auditd</command>.
cs: Před konfigurací jakékoli součásti auditovacího systému se ujistěte, že démon auditu není spuštěn, zadáním<command>systemctl status auditd</command> jako <systemitem class="username">root</systemitem>. Na výchozím systému <phrase role="productname"><phrase os="osuse">openSUSE Leap</phrase><phrase os="sles">SUSE Linux Enterprise Server</phrase><phrase os="sled">SUSE Linux Enterprise Desktop</phrase></phrase> je audit spuštěn při bootu, takže ho musíte vypnout zadáním <command>systemctl stop auditd</command>. Po konfiguraci spusťte démon příkazem <command>systemctl start auditd</command>.

source: Determining the Components to Audit
cs: Určení komponent k auditu

source: Before starting to create your own audit configuration, determine to which degree you want to use it. Check the following general rules to determine which use case best applies to you and your requirements:
cs: Před vytvořením vlastní konfigurace auditu určete, do jaké míry ji chcete použít. Podle následujících obecných pravidel můžete určit, který případ použití je pro Vás a Vaše požadavky nejvhodnější:

source: If you require a full security audit for CAPP/EAL certification, enable full audit for system calls and configure watches on various configuration files and directories, similar to the rule set featured in <xref linkend="cha.audit.scenarios"/>.
cs: Pokud požadujete úplný audit zabezpečení pro certifikaci CAPP/EAL, povolte úplný audit systémových volání a nakonfigurujte hlídáčky v různých konfiguračních souborech a adresářích, podobně jako u sady pravidel obsažených v <xref linkend="cha.audit.scenarios"/>.

source: If you need to trace a process based on the audit rules, use <command>autrace</command>.
cs: Potřebujete-li odsledovat proces na základě pravidel auditu, použijte <command>autrace</command>.

source: If you require file and directory watches to track access to important or security-sensitive data, create a rule set matching these requirements. Enable audit as described in <xref linkend="sec.audit.syscall"/> and proceed to <xref linkend="sec.audit.aurules"/>.
cs: Pokud požadujete, aby adresářové a souborové hlídáčky sledovaly přístup k důležitým nebo citlivým datům, vytvořte sadu pravidel odpovídající těmto požadavkům. Aktivujte audit, jak je popsáno v <xref linkend="sec.audit.syscall"/>, a přejděte na <xref linkend="sec.audit.aurules"/>.

source: Configuring the Audit Daemon
cs: Konfigurace auditního démona

source: The basic setup of the audit daemon is done by editing <filename>/etc/audit/auditd.conf</filename>. You may also use YaST to configure the basic settings by calling <menuchoice> <guimenu>YaST</guimenu> <guimenu>Security and Users</guimenu> <guimenu>Linux Audit Framework (LAF)</guimenu> </menuchoice>. Use the tabs <guimenu>Log File</guimenu> and <guimenu>Disk Space</guimenu> for configuration.
cs: Základní nastavení démona auditu se provádí úpravou <filename>/etc/audit/auditd.conf</filename>. Můžete také použít YaST ke konfiguraci základních nastavení voláním <menuchoice> <guimenu>YaST</guimenu> <guimenu>Zabezpečení a uživatelé</guimenu> <guimenu>Linux Audit Framework (LAF)</guimenu> </menuchoice>. Ke konfiguraci použijte karty <guimenu>Soubor protokolu</guimenu> a <guimenu>Místo na disku</guimenu>.

source: log_file = /var/log/audit/audit.log log_format = RAW log_group = root priority_boost = 4 flush = INCREMENTAL freq = 20 num_logs = 5 disp_qos = lossy dispatcher = /sbin/audispd name_format = NONE ##name = mydomain max_log_file = 6 max_log_file_action = ROTATE space_left = 75 space_left_action = SYSLOG action_mail_acct = root admin_space_left = 50 admin_space_left_action = SUSPEND disk_full_action = SUSPEND disk_error_action = SUSPEND ##tcp_listen_port = tcp_listen_queue = 5 tcp_max_per_addr = 1 ##tcp_client_ports = 1024-65535 tcp_client_max_idle = 0 cp_client_max_idle = 0
cs: log_file = /var/log/audit/audit.log log_format = BEZ_ÚPRAV log_group = root priority_boost = 4 flush = PŘÍRŮSTKOVÝ freq = 20 num_logs = 5 disp_qos = lossy dispatcher = /sbin/audispd name_format = ŽÁDNÝ ##název = moje_doména max_log_file = 6 max_log_file_action = ROTACE space_left = 75 space_left_action = SYSLOG action_mail_acct = root admin_space_left = 50 admin_space_left_action = POZASTAVIT disk_full_action = POZASTAVIT disk_error_action = POZASTAVIT ##otevřený_port_tcp = tcp_listen_queue = 5 tcp_max_per_addr = 1 ##klientské_porty_tcp = 1024-65535 tcp_client_max_idle = 0 cp_client_max_idle = 0

source: The default settings work reasonably well for many setups. Some values, such as <literal>num_logs</literal>, <literal>max_log_file</literal>, <literal>space_left</literal>, and <literal>admin_space_left</literal> depend on the size of your deployment. If disk space is limited, you should reduce the number of log files to keep if they are rotated and you should get an earlier warning if disk space is running out. For a CAPP-compliant setup, adjust the values for <literal>log_file</literal>, <literal>flush</literal>, <literal>max_log_file</literal>, <literal>max_log_file_action</literal>, <literal>space_left</literal>, <literal>space_left_action</literal>, <literal>admin_space_left</literal>, <literal>admin_space_left_action</literal>, <literal>disk_full_action</literal>, and <literal>disk_error_action</literal>, as described in <xref linkend="sec.audit.auditd"/>. An example CAPP-compliant configuration looks like this:
cs: Výchozí nastavení funguje pro mnoho nastavení celkem dobře. Některé hodnoty, například <literal>num_logs</literal>, <literal>max_log_file</literal>, <literal>space_left</literal> a <literal>admin_space_left</literal> závisí na velikosti vašeho nasazení. Je-li místo na disku omezené, měli byste snížit počet souborů protokolu, které se mají zachovat, pokud jsou otočené, a pokud dojde místo na disku, měli byste obdržet dřívější varování. U nastavení kompatibilního s CAPP upravte hodnoty pro <literal>log_file</literal>, <literal>flush</literal>, <literal>max_log_file</literal>, <literal>max_log_file_action</literal>, <literal>space_left</literal>, <literal>space_left_action</literal>, <literal>admin_space_left</literal>, <literal>admin_space_left_action</literal>, <literal>disk_full_action</literal> a <literal>disk_error_action</literal>, jak je popsáno v <xref linkend="sec.audit.auditd"/>. Příklad konfigurace kompatibilní s CAPP vypadá takto:

source: log_file = <replaceable>PATH_TO_SEPARATE_PARTITION</replaceable>/audit.log log_format = RAW priority_boost = 4 flush = SYNC ### or DATA freq = 20 num_logs = 4 dispatcher = /sbin/audispd disp_qos = lossy max_log_file = 5 max_log_file_action = KEEP_LOGS space_left = 75 space_left_action = EMAIL action_mail_acct = root admin_space_left = 50 admin_space_left_action = SINGLE ### or HALT disk_full_action = SUSPEND ### or HALT disk_error_action = SUSPEND ### or HALT
cs: log_file = <replaceable>CESTA_K_SEPARÁTNÍMU_ODDÍLU</replaceable>/audit.log log_format = RAW priority_boost = 4 flush = SYNC ### nebo DATA freq = 20 num_logs = 4 dispatcher = /sbin/audispd disp_qos = lossy max_log_file = 5 max_log_file_action = KEEP_LOGS [zachovat protokoly] space_left = 75 space_left_action = EMAIL action_mail_acct = root admin_space_left = 50 admin_space_left_action = SINGLE ### nebo HALT disk_full_action = SUSPEND ### nebo HALT disk_error_action = SUSPEND ### nebo HALT

source: The <literal>###</literal> precedes comments where you can choose from several options. Do not add the comments to your actual configuration files.
cs: <literal>###</literal> předchází komentářům, kde si můžete vybrat z několika možností. Nepřidávejte komentáře k vašim skutečným konfiguračním souborům.

source: For More Information
cs: Další informace

source: Refer to <xref linkend="sec.audit.auditd"/> for detailed background information about the <filename>auditd.conf</filename> configuration parameters.
cs: Podrobnější informace o konfiguračních parametrech <filename>auditd.conf</filename> najdete v <xref linkend="sec.audit.auditd"/>.

source: Enabling Audit for System Calls
cs: Povolení auditu pro systémová volání

source: If the audit framework is not installed, install the <systemitem>audit</systemitem> package. A standard <phrase role="productname"><phrase os="osuse">openSUSE Leap</phrase><phrase os="sles">SUSE Linux Enterprise Server</phrase><phrase os="sled">SUSE Linux Enterprise Desktop</phrase></phrase> system does not have auditd running by default. Enable it with:
cs: Pokud není nainstalován podsystém auditu, nainstalujte balíček <systemitem> audit </systemitem>. Standardní systém <phrase role="productname"><phrase os="osuse">openSUSE Leap</phrase><phrase os="sles">SUSE Linux Enterprise Server</phrase><phrase os="sled">SUSE Linux Enterprise Desktop</phrase></phrase> nemá standardně spuštěn audit. Povolte ho:

source: There are different levels of auditing activity available:
cs: K dispozici jsou různé úrovně činnosti auditu:

source: Basic Logging
cs: Základní protokolování

source: Out of the box (without any further configuration) auditd logs only events concerning its own configuration changes to <filename>/var/log/audit/audit.log</filename>. No events (file access, system call, etc.) are generated by the kernel audit component until requested by <command>auditctl</command>. However, other kernel components and modules may log audit events outside of the control of <command>auditctl</command> and these appear in the audit log. By default, the only module that generates audit events is <phrase>AppArmor</phrase>.
cs: Čerstvě instalovaný (bez jakékoli další konfigurace) démon auditd zaznamenává pouze události týkající se změn jeho vlastní konfigurace ve <filename>/var/log/audit/audit.log</filename>. Komponenta auditu jádra nevygeneruje žádné události (přístup k souborům, systémové volání atd.), dokud to nevyžádá <command>auditctl</command>. Jiné součásti a moduly jádra však mohou protokolovat události auditu mimo ovládání <command>auditctl</command> a ty se objeví v protokolu auditu. Ve výchozím nastavení je jediným modulem, který generuje auditní události, <phrase>AppArmor</phrase>.

source: Advanced Logging with System Call Auditing
cs: Pokročilé protokolování s auditováním systémových volání

source: To audit system calls and get meaningful file watches, you need to enable audit contexts for system calls.
cs: Chcete-li auditovat systémová volání a získat smysluplné hlídáčky souborů, musíte povolit kontexty auditu pro systémová volání.

source: As you need system call auditing capabilities even when you are configuring plain file or directory watches, you need to enable audit contexts for system calls. To enable audit contexts for the duration of the current session only, execute <command>auditctl -e 1</command> as <systemitem class="username">root</systemitem>. To disable this feature, execute <command>auditctl -e 0</command> as <systemitem class="username">root</systemitem>.
cs: Protože potřebujete funkce pro monitorování systémových volání, i když konfigurujete sledování obyčejných souborů nebo adresářů, musíte povolit kontexty auditu pro systémová volání. Chcete-li povolit kontext auditu pouze po dobu aktuální relace, proveďte <command>auditctl -e 1</command> jako <systemitem class="username">root</systemitem>. Chcete-li tuto funkci deaktivovat, spusťte <command>auditctl -e 0</command> jako <systemitem class="username">root</systemitem>.

source: The audit contexts are enabled by default. To turn this feature off temporarily, use <command>auditctl -e 0</command>.
cs: Kontext auditu je ve výchozím nastavení povolen. Chcete-li tuto funkci dočasně vypnout, použijte <command>auditctl -e 0</command>.

source: Setting Up Audit Rules
cs: Nastavení pravidel auditu

source: Using audit rules, determine which aspects of the system should be analyzed by audit. Normally this includes important databases and security-relevant configuration files. You may also analyze various system calls in detail if a broad analysis of your system is required. A very detailed example configuration that includes most of the rules that are needed in a CAPP compliant environment is available in <xref linkend="cha.audit.scenarios"/>.
cs: Pomocí pravidel auditu určete, které aspekty systému by měly být auditem analyzovány. Normálně to zahrnuje důležité databáze a konfigurační soubory relevantní pro zabezpečení. Můžete také podrobně analyzovat různá systémová volání, pokud je vyžadována široká analýza vašeho systému. Velmi podrobný příklad konfigurace, který obsahuje většinu pravidel, která jsou potřebná v prostředí kompatibilním s CAPP, je k dispozici v <xref linkend="cha.audit.scenarios"/>.

source: Audit rules can be passed to the audit daemon on the <command>auditctl</command> command line and by composing a rule set in <filename>/etc/audit/audit.rules</filename> which is processed whenever the audit daemon is started. To customize <filename>/etc/audit/audit.rules</filename> either edit it directly, or use YaST: <menuchoice> <guimenu>Security and Users</guimenu> <guimenu>Linux Audit Framework (LAF)</guimenu> <guimenu>Rules for 'auditctl'</guimenu> </menuchoice>. Rules passed on the command line are not persistent and need to be re-entered when the audit daemon is restarted.
cs: Pravidla auditu lze předat auditnímu démonu na příkazovém řádku <command>auditctl</command> a vytvořením pravidla nastaveného v <filename>/etc/audit/audit.rules</filename>, které se zpracovává vždy, když je démon auditu spuštěn. Chcete-li přizpůsobit <filename>/etc/audit/audit.rules</filename>, upravte jej přímo nebo použijte YaST: <menuchoice> <guimenu>Zabezpečení a uživatelé</guimenu> <guimenu>Linux Audit Framework (LAF)</guimenu> <guimenu>Pravidla pro "auditctl“</guimenu> </menuchoice>. Pravidla předaná na příkazovém řádku nejsou trvalá a je třeba je znovu zadat při restartu démona auditu.

source: A simple rule set for very basic auditing on a few important files and directories could look like this:
cs: Jednoduché pravidlo nastavené pro zcela základní auditování několika důležitých souborů a adresářů může vypadat takto:

source: # basic audit system parameters -D -b 8192 -f 1 -e 1 # some file and directory watches with keys -w /var/log/audit/ -k LOG_audit -w /etc/audit/auditd.conf -k CFG_audit_conf -p rxwa -w /etc/audit/audit.rules -k CFG_audit_rules -p rxwa -w /etc/passwd -k CFG_passwd -p rwxa -w /etc/sysconfig/ -k CFG_sysconfig # an example system call rule -a entry,always -S umask ### add your own rules
cs: # základní parametry auditního systému -D -b 8192 -f 1 -e 1 # některé hlídáčky souborů a adresářů s klíči -w /var/log/audit/ -k LOG_audit -w /etc/audit/auditd.conf -k CFG_audit_conf -p rxwa -w /etc/audit/audit.rules -k CFG_audit_rules -p rxwa -w /etc/passwd -k CFG_passwd -p rwxa -w /etc/sysconfig/ -k CFG_sysconfig # příklad pravidla pro systémové volání -a entry,always -S umask ### sem přidejte svá vlastní pravidla

source: When configuring the basic audit system parameters (such as the backlog parameter <literal>-b</literal>) test these settings with your intended audit rule set to determine whether the backlog size is appropriate for the level of logging activity caused by your audit rule set. If your chosen backlog size is too small, your system might not be able to handle the audit load and consult the failure flag (<literal>-f</literal>) when the backlog limit is exceeded.
cs: Při konfiguraci základních parametrů systému auditu (jako je například parametr backlog <literal>-b</literal>) otestujte tato nastavení se zamýšlenou sadou pravidel auditu, abyste určili, zda je velikost protokolu vhodná pro úroveň protokolovací aktivity způsobené Vaší sadou pravidel auditu. Pokud je Vámi zvolená velikost protokolu příliš malá, Váš systém nemusí být schopen zvládnout zatížení auditu a nastaví příznak selhání (<literal>-f</literal>), když překročí limit nevyřízených položek.

source: Choosing the Failure Flag
cs: Volba příznaku selhání

source: When choosing the failure flag, note that <option>-f 2</option> tells your system to perform an immediate shutdown without flushing any pending data to disk when the limits of your audit system are exceeded. Because this shutdown is not a clean shutdown, restrict the use of <option>-f 2</option> to only the most security-conscious environments and use <option>-f 1</option> (system continues to run, issues a warning and audit stops) for any other setup to avoid loss of data or data corruption.
cs: Při výběru příznaku selhání mějte na paměti, že <option>-f 2</option> řekne vašemu systému, aby se okamžitě vypnul, aniž zapíše všechna nevyřízená data na disk, když jsou překročeny limity vašeho auditovacího systému. Protože toto vypnutí není čistým vypnutím, omezte použití <option>-f 2</option> pouze na prostředí s nejvyšším zabezpečením a použijte <option>-f 1</option> (systém nadále běží, vydá však varování a zastaví audit) pro jakékoli jiné prostředí, aby nedošlo ke ztrátě dat nebo poškození dat.

source: Directory watches produce less verbose output than separate file watches for the files under these directories. To get detailed logging for your system configuration in <filename>/etc/sysconfig</filename>, for example, add watches for each file. Audit does not support globbing, which means you cannot create a rule that says <literal>-w /etc/*</literal> and watches all files and directories below <filename>/etc</filename>.
cs: Hlídáčky adresáře produkují pro soubory v těchto adresářích méně podrobný výstup než hlídáčky samostatných souborů. Chcete-li například získat podrobné protokolování konfigurace systému v <filename>/etc/sysconfig</filename>, přidejte hlídáčky pro každý soubor. Audit nepodporuje globbing, což znamená, že nemůžete vytvořit pravidlo <literal>-w /etc/*</literal>, které by sledovalo všechny soubory a adresáře pod <filename>/etc</filename>.

source: For better identification in the log file, a key has been added to each of the file and directory watches. Using the key, it is easier to comb the logs for events related to a certain rule. When creating keys, distinguish between mere log file watches and configuration file watches by using an appropriate prefix with the key, in this case <literal>LOG</literal> for a log file watch and <literal>CFG</literal> for a configuration file watch. Using the file name as part of the key also makes it easier for you to identify events of this type in the log file.
cs: Pro lepší identifikaci v souboru protokolu byl ke každému z hlídáčků souboru a adresáře přidán klíč. Pomocí klíče je snazší uspořádat protokoly pro události související s určitým pravidlem. Při vytváření klíčů rozlišujte mezi pouhým sledováním souboru protokolu a sledováním konfiguračního souboru pomocí vhodné předpony s klíčem, v tomto případě <literal>LOG</literal> pro sledování souboru protokolu a <literal>CFG</literal> pro sledování konfiguračního souboru. Použití názvu souboru jako součásti klíče také usnadňuje identifikaci událostí tohoto typu v souboru protokolu.
