Repository: openSUSE/doc-sle-translations
Catalog: */po/autofs.*.po
Languages: cs

source: If you have a directory with subdirectories that you need to auto-mount individually—the typical case is the <filename>/home</filename> directory with individual users' home directories inside— <systemitem>autofs</systemitem> offers a clever solution for that.
cs: Máte-li adresář s podadresáři, které je třeba připojit automaticky jednotlivě - typickým případem je adresář <filename>/home</filename> s domovskými adresáři jednotlivých uživatelů -, pak <systemitem>autofs</systemitem> nabízí chytré řešení.

source: In case of home directories, add the following line in <filename>auto.master</filename>:
cs: V případě domovských adresářů přidejte do <filename>auto.master</filename> následující řádek:

source: Now you need to add the correct mapping to the <filename>/etc/auto.home</filename> file, so that the users' home directories are mounted automatically. One solution is to create separate entries for each directory:
cs: Teď musíte do souboru <filename>/etc/auto.home</filename> přidat správné mapování, aby se domácí adresáře uživatelů připojovaly automaticky. Jedním řešením je vytvořit samostatné záznamy pro každý adresář:

source: wilber jupiter.com:/home/wilber penguin jupiter.com:/home/penguin tux jupiter.com:/home/tux [...]
cs: wilber jupiter.com:/home/wilber penguin jupiter.com:/home/penguin tux jupiter.com:/home/tux [atd.]

source: This is very awkward as you need to manage the list of users inside <filename>auto.home</filename>. You can use the asterisk '*' instead of the mount point, and the ampersand '&amp;' instead of the directory to be mounted:
cs: To je velmi nepříjemné, protože potřebujete spravovat seznam uživatelů uvnitř <filename>auto.home</filename>. Avšak místo připojovacího bodu můžete použít hvězdičku '*' a místo připojovaného adresáře ampersand '&amp;':

source: Auto-Mounting CIFS File System
cs: Automatická instalace systému souborů CIFS

source: If you want to auto-mount an SMB/CIFS share (see <xref linkend="cha.samba"/> for more information on the SMB/CIFS protocol), you need to modify the syntax of the map file. Add <option>-fstype=cifs</option> in the option field, and prefix the share location with a colon ':'.
cs: Chcete-li automaticky připojit sdílenou složku SMB/CIFS (další informace o protokolu SMB/CIFS viz <xref linkend="cha.samba"/>), musíte upravit syntaxi souboru mapy. Do pole možností přidejte <option>-fstype=cifs</option> a před místo sdílení vložte dvojtečku ':'.
