Repository: openSUSE/doc-sle-translations
Catalog: */po/autofs.*.po
Languages: cs

# _
source: translator-credits
cs: překladatelské kredity alkas alkas@volny.cz, 2016, 2020

source: On-Demand Mounting with Autofs
cs: Připojení na žádost s Autofs

source: yes
cs: ano

source: <systemitem>autofs</systemitem> is a program that automatically mounts specified directories on an on-demand basis. It is based on a kernel module for high efficiency, and can manage both local directories and network shares. These automatic mount points are mounted only when they are accessed, and unmounted after a certain period of inactivity. This on-demand behavior saves bandwidth and results in better performance than static mounts managed by <filename>/etc/fstab</filename>. While <systemitem>autofs</systemitem> is a control script, <command>automount</command> is the command (daemon) that does the actual auto-mounting.
cs: <systemitem>autofs</systemitem> je program, který automaticky připojuje zadané adresáře podle potřeby. Je založen na modulu jádra pro vysokou účinnost a může spravovat místní adresáře i sdílené síťové položky. Tyto automatické připojovací body jsou připojeny pouze tehdy, je-li přístup k nim právě potřebný a odpojeny po určité době nečinnosti. Toto připojení "na vyžádání" šetří šířku pásma a vede k lepšímu výkonu než statické připojení spravované pomocí <filename>/etc/fstab</filename>. Zatímco <systemitem>autofs</systemitem> je ovládací skript, <command>automount</command> je příkaz (démon), který provede vlastní automatické připojení.

source: Installation
cs: Instalace

source: <systemitem>autofs</systemitem> is not installed on <phrase role="productname"><phrase os="osuse">openSUSE Leap</phrase><phrase os="sles">SUSE Linux Enterprise Server</phrase><phrase os="sled">SUSE Linux Enterprise Desktop</phrase></phrase> by default. To use its auto-mounting capabilities, first install it with
cs: <systemitem>autofs</systemitem> není standardně instalován na <phrase role="productname"><phrase os="osuse">openSUSE Leap</phrase><phrase os="sles">SUSE Linux Enterprise Server</phrase><phrase os="sled">SUSE Linux Enterprise Desktop</phrase></phrase>. Chcete-li používat jeho funkce, nejprve jej nainstalujte příkazem

source: Configuration
cs: Konfigurace

source: You need to configure <systemitem>autofs</systemitem> manually by editing its configuration files with a text editor, such as <command>vim</command>. There are two basic steps to configure <systemitem>autofs</systemitem>—the <emphasis>master</emphasis> map file, and specific map files.
cs: Je třeba nakonfigurovat <systemitem>autofs</systemitem> ručně úpravou jeho konfiguračních souborů textovým editorem, například <command>vim</command>. Pro konfiguraci <systemitem>autofs</systemitem> - <emphasis>hlavního</emphasis> mapového souboru (master) a konkrétních mapových souborů se používají dva základní kroky.

source: The Master Map File
cs: Hlavní mapový soubor

source: The default master configuration file for <systemitem>autofs</systemitem> is <filename>/etc/auto.master</filename>. You can change its location by changing the value of the <option>DEFAULT_MASTER_MAP_NAME</option> option in <filename>/etc/sysconfig/autofs</filename>. Here is the content of the default one for <phrase role="productname"><phrase os="osuse">openSUSE Leap</phrase><phrase os="sles">SUSE Linux Enterprise Server</phrase><phrase os="sled">SUSE Linux Enterprise Desktop</phrase></phrase>:
cs: Výchozí hlavní konfigurační soubor pro <systemitem>autofs</systemitem> je <filename>/etc/auto.master</filename>. Jeho umístění můžete změnit změnou hodnoty <option>DEFAULT_MASTER_MAP_NAME</option> v <filename>/etc/sysconfig/autofs</filename>. Zde je obsah výchozího nastavení pro <phrase role="productname"><phrase os="osuse">openSUSE Leap</phrase><phrase os="sles">SUSE Linux Enterprise Server</phrase><phrase os="sled">SUSE Linux Enterprise Desktop</phrase></phrase>:

source: # # Sample auto.master file # This is an automounter map and it has the following format # key [ -mount-options-separated-by-comma ] location # For details of the format look at autofs(5).<co xml:id="co.autofs.manpage"/> # #/misc /etc/auto.misc<co xml:id="co.autofs.map"/> #/net -hosts # # Include /etc/auto.master.d/*.autofs<co xml:id="co.autofs.include"/> # #+dir:/etc/auto.master.d # # Include central master map if it can be found using # nsswitch sources. # # Note that if there are entries for /net or /misc (as # above) in the included master map any keys that are the # same will not be seen as the first read key seen takes # precedence. # +auto.master<co xml:id="co.autofs.plus"/>
cs: # # Příklad souboru auto.master # Toto je mapa automounter, má následující formát # klíč [ -volby-mount-oddělené-čárkami ] location # Detaily o formátu: autofs(5).<co xml:id="co.autofs.manpage"/> # #/misc /etc/auto.misc<co xml:id="co.autofs.map"/> #/net -hosts # # Include /etc/auto.master.d/*.autofs<co xml:id="co.autofs.include"/> # #+dir:/etc/auto.master.d # # Vložit centrální hlavní mapu, dá-li se najít použitím # prostředků nsswitch. # # Existují-li položky pro /net nebo /misc (jako výše) # ve vložené hlavní mapě, pak klíče, které jsou stejné, # nebudou vidět, neboť zobrazení prvního čteného klíče # má přednost. # +auto.master<co xml:id="co.autofs.plus"/>

source: The <systemitem>autofs</systemitem> manual page (<command>man 5 autofs</command>) offers a lot of valuable information on the format of the automounter maps.
cs: Stránka manuálu <systemitem>autofs</systemitem> (<command>man 5 autofs</command>) nabízí mnoho cenných informací o formátu map automounteru.

source: Although commented out (#) by default, this is an example of a simple automounter mapping syntax.
cs: Je to příklad jednoduché syntaxe mapování automounteru, i když je ve výchozím nastavení zakomentován (#).

source: In case you need to split the master map into several files, uncomment the line, and put the mappings (suffixed with <literal>.autofs</literal>) in the <filename>/etc/auto.master.d/</filename> directory.
cs: V případě, že potřebujete rozdělit hlavní mapu na několik souborů, odkomentujte řádek a vložte mapování (s příponou <literal>.autofs</literal>) do adresáře <filename>/etc/auto.master.d/</filename>.

source: <literal>+auto.master</literal> ensures that those using NIS <phrase os="sles;osuse">(see <xref linkend="sec.nis.server"/> for more information on NIS)</phrase> will still find their master map.
cs: <literal>+auto.master</literal> zajišťuje, že uživatelé používající NIS <phrase os="sles;osuse"> (další informace o NIS najdete na <xref linkend="sec.nis.server"/>) </phrase> také najdou svou hlavní mapu.

source: Entries in <filename>auto.master</filename> have three fields with the following syntax:
cs: Položky ve <filename>auto.master</filename> mají tři pole s následující syntaxí:

source: mount point map name options
cs: přípojný bod název mapy možnosti

source: mount point
cs: přípojný bod (mount point)

source: The base location where to mount the <systemitem>autofs</systemitem> file system, such as <literal>/home</literal>.
cs: Základní umístění, kam se má připojit souborový systém <systemitem>autofs</systemitem>, například <literal>/home</literal>.

source: map name
cs: název mapy (map name)

source: The name of a map source to use for mounting. For the syntax of the maps files, see <xref linkend="sec.autofs.mapfiles"/>.
cs: Název zdroje mapy, který se má použít pro připojení. Syntaxi souborů map najdete v <xref linkend="sec.autofs.mapfiles"/>.

source: options
cs: možnosti (options)

source: These options (if specified) will apply as defaults to all entries in the given map.
cs: Tyto možnosti (jsou-li zadány) budou platit jako výchozí pro všechny položky dané mapy.

source: For More Information
cs: Další informace

source: For more detailed information on the specific values of the optional <literal>map-type</literal>, <literal>format</literal>, and <literal>options</literal>, see the <guimenu>auto.master</guimenu> manual page (<command>man 5 auto.master</command>).
cs: Podrobnější informace o konkrétních hodnotách volitelného <literal>typu mapy</literal>, <literal>formátu</literal> a <literal>možnostech</literal> najdete v <guimenu>auto.master</guimenu> stránka manuálu (<command>man 5 auto.master</command>).

source: The following entry in <filename>auto.master</filename> tells <systemitem>autofs</systemitem> to look in <filename>/etc/auto.smb</filename>, and create mount points in the <filename>/smb</filename> directory.
cs: Následující položka v <filename>auto.master</filename> říká <systemitem>autofs</systemitem>, aby se podíval do <filename>/etc/auto.smb</filename> a vytvořil připojovací body v <filename>/smb</filename> adresář.

source: Direct Mounts
cs: Přímé připojení

source: Direct mounts create a mount point at the path specified inside the relevant map file. Instead of specifying the mount point in <filename>auto.master</filename>, replace the mount point field with <literal>/-</literal>. For example, the following line tells <systemitem>autofs</systemitem> to create a mount point at the place specified in <filename>auto.smb</filename>:
cs: Přímé přípoje vytvářejí přípojný bod na cestě zadané v příslušném souboru mapy. Místo určení bodu připojení v <filename>auto.master</filename> nahraďte pole bodu připojení <literal>/-</literal>. Například následující řádek říká systému <systemitem>autofs</systemitem>, aby vytvořil přípojný bod na místě uvedeném v <filename>auto.smb</filename>:

source: Maps without Full Path
cs: Mapy bez úplné cesty

source: If the map file is not specified with its full local or network path, it is located using the Name Service Switch (NSS) configuration:
cs: Není-li soubor mapy zadán s úplnou místní nebo síťovou cestou, je vyhledán použitím konfigurace přepínače názvové služby (Name Service Switch, NSS):

source: Map Files
cs: Mapové soubory

source: Other Types of Maps
cs: Další typy map

source: Although <emphasis>files</emphasis> are the most common types of maps for auto-mounting with <systemitem>autofs</systemitem>, there are other types as well. A map specification can be the output of a command, or a result of a query in LDAP or database. For more detailed information on map types, see the manual page <command>man 5 auto.master</command>.
cs: Ačkoli <emphasis>soubory</emphasis> jsou nejběžnější typy map pro automatické připevňování pomocí <systemitem>autofs</systemitem>, existují i jiné typy. Specifikace mapy může být výstupem příkazu nebo výsledkem dotazu v LDAP nebo databázi. Podrobnější informace o typech map najdete na stránce manuálu <command>man 5 auto.master</command>.

source: Map files specify the (local or network) source location, and the mount point where to mount the source locally. The general format of maps is similar to the master map. The difference is that the <emphasis>options</emphasis> appear between the mount point and the location instead of at the end of the entry:
cs: Soubory s mapami určují umístění zdroje (lokálního nebo síťového) a bod připojení, kam se má zdroj připojit lokálně. Obecný formát map je podobný hlavní mapě. Rozdíl je v tom, že <emphasis>možnosti</emphasis> se uvádějí mezi bodem připojení a umístěním místo na konci položky:

source: mount point options location
cs: přípojný bod možnosti umístění

source: Make sure that map files are not marked as executable. You can remove the executable bits by executing <command>chmod -x <replaceable>MAP_FILE</replaceable></command>.
cs: Ujistěte se, že mapové soubory nejsou označeny jako spustitelné. Příznaky spustitelnosti můžete odebrat spuštěním příkazu <command>chmod -x<replaceable>MAPOVÝ_SOUBOR</replaceable> </command>.

source: Specifies where to mount the source location. This can be either a single directory name (so-called <emphasis>indirect</emphasis> mount) to be added to the base mount point specified in <filename>auto.master</filename>, or the full path of the mount point (direct mount, see <xref linkend="sec.autofs.directmount"/>).
cs: Určuje, kam se připojí umístění zdroje. Může to být buď pouhý název adresáře (takzvané <emphasis>nepřímé</emphasis> připojení), který má být přidán k základnímu bodu připojení uvedenému ve <filename>auto.master</filename>, nebo úplná cesta k přípojnému bodu (přímé připojení, viz <xref linkend="sec.autofs.directmount"/>).

source: Specifies optional comma-separated list of mount options for the relevant entries. If <filename>auto.master</filename> contains options for this map file as well, theses are appended.
cs: Určuje volitelný seznam možností připojení pro příslušné položky, oddělených čárkami. Pokud <filename>auto.master</filename> obsahuje také možnosti pro tento soubor mapy, jsou připojeny.

source: location
cs: umístění

source: Specifies from where the file system is to be mounted. It is usually an NFS or SMB volume in the usual notation <literal>host_name:path_name</literal>. If the file system to be mounted begins with a '/' (such as local <filename>/dev</filename> entries or smbfs shares), a colon symbol ':' needs to be prefixed, such as <literal>:/dev/sda1</literal>.
cs: Určuje, odkud má být systém souborů připojen. Obvykle jde o svazek NFS nebo SMB v obvyklém zápisu <literal>název_hostitele: cesta_ název</literal>. Začíná-li souborový systém, který má být připojen, znakem „/“ (například místní položky <filename>/dev</filename> nebo sdílené položky smbfs), je třeba přidat symbol dvojtečky ':' jako předponu, například <literal>:/dev/sda1</literal>.

source: Operation and Debugging
cs: Provoz a ladění

source: This section introduces information on how to control the <systemitem>autofs</systemitem> service operation, and how to view more debugging information when tuning the automounter operation.
cs: V této části jsou uvedeny informace o tom, jak řídit provoz služby <systemitem>autofs</systemitem> a jak zobrazit více ladicích informací při ladění provozu automountera.

source: Controlling the <systemitem>autofs</systemitem> Service
cs: Ovládání služby <systemitem>autofs</systemitem>

source: The operation of the <systemitem>autofs</systemitem> service is controlled by <systemitem class="daemon">systemd</systemitem>. The general syntax of the <command>systemctl</command> command for <systemitem>autofs</systemitem> is
cs: Provoz služby <systemitem>autofs</systemitem> je řízen <systemitem class="daemon">systemd</systemitem>. Obecná syntaxe příkazu <command>systemctl</command> pro <systemitem>autofs</systemitem> je

source: <prompt>tux &gt; </prompt><command>sudo</command> systemctl <replaceable>SUB_COMMAND</replaceable> autofs
cs: <prompt>tux &gt; </prompt><command>sudo</command> systemctl <replaceable>PODPŘÍKAZ</replaceable> autofs

source: where <replaceable>SUB_COMMAND</replaceable> is one of:
cs: kde <replaceable>PODPŘÍKAZ</replaceable> může být:

source: enable
cs: enable (povolit; zapnout; aktivovat)

source: Starts the automounter daemon at boot.
cs: Spustí démona automounteru při spuštění systému.

source: Starts the automounter daemon.
cs: Spustí démona automounter.

source: Stops the automounter daemon. Automatic mount points are not accessible.
cs: Zastaví démona automounteru. Automatické body připojení nebudou přístupné.

source: status
cs: status (stav)

source: Prints the current status of the <systemitem>autofs</systemitem> service together with a part of a relevant log file.
cs: Vypíše aktuální stav služby <systemitem>autofs</systemitem> společně s částí příslušného souboru protokolu.

source: Stops and starts the automounter, terminating all running daemons and starting new ones.
cs: Zastaví a spustí automounter, ukončí všechny spuštěné démony a spustí nové.

source: reload
cs: reload (znovu zavést)

source: Checks the current <filename>auto.master</filename> map, restarts those daemons whose entries have changed, and starts new ones for new entries.
cs: Zkontroluje aktuální mapu <filename>auto.master</filename>, restartuje ty démony, jejichž položky se změnily, a spustí nové pro nové položky.

source: Debugging the Automounter Problems
cs: Ladění problémů s Automounterem

source: If you experience problems when mounting directories with <systemitem>autofs</systemitem>, it is useful to run the <command>automount</command> daemon manually and watch its output messages:
cs: Narazíte-li na problémy s připojováním adresářů pomocí <systemitem>autofs</systemitem>, je užitečné ručně spustit démona <command>automount</command> a sledovat jeho výstupní zprávy:

source: Stop <systemitem>autofs</systemitem>.
cs: Zastavit <systemitem>autofs</systemitem>.

source: From one terminal, run <command>automount</command> manually in the foreground, producing verbose output.
cs: Z jednoho terminálu spusťte <command>automount</command> ručně v popředí a vytvořte podrobný výstup.

source: From another terminal, try to mount the auto-mounting file systems by accessing the mount points (for example by <command>cd</command> or <command>ls</command>).
cs: Z jiného terminálu zkuste připojit systémy automatického připojování souborů přístupem k přípojným bodům (například <command>cd</command> nebo <command>ls</command>).

source: Check the output of <command>automount</command> from the first terminal for more information why the mount failed, or why it was not even attempted.
cs: Zkontrolujte výstup příkazu <command>automount</command> z prvního terminálu, kde najdete další informace, proč připojení selhalo nebo proč nedošlo ani k pokusu o ně.

source: Auto-Mounting an NFS Share
cs: Automatické připojení sdílené složky NFS

source: The following procedure illustrates how to configure <systemitem>autofs</systemitem> to auto-mount an NFS share available on your network. It uses the information mentioned above, and assumes you are familiar with NFS exports. For more information on NFS, see <xref linkend="cha.nfs"/>.
cs: Následující postup ukazuje, jak konfigurovat <systemitem>autofs</systemitem> pro automatické připojení sdílené složky NFS dostupné ve vaší síti. Využívá výše zmíněné informace a předpokládá, že jste obeznámeni s exportem NFS. Další informace o NFS najdete v <xref linkend="cha.nfs"/>.

source: Edit the master map file <filename>/etc/auto.master</filename>:
cs: Upravte hlavní soubor mapy <filename>/etc/auto.master</filename>:

source: Add a new entry for the new NFS mount at the end of <filename>/etc/auto.master</filename>:
cs: Na konec souboru <filename>/etc/auto.master</filename> přidejte položku nového připojení NFS:

source: It tells <systemitem>autofs</systemitem> that the base mount point is <filename>/nfs</filename>, the NFS shares are specified in the <filename>/etc/auto.nfs</filename> map, and that all shares in this map will be automatically unmounted after 10 seconds of inactivity.
cs: Ta říká démonu <systemitem>autofs</systemitem>, že základní bod připojení je <filename>/nfs</filename>, že sdílené složky NFS jsou uvedeny v mapě <filename>/etc/auto.nfs</filename> a že všechny sdílené položky na této mapě budou automaticky odpojeny po 10 sekundách nečinnosti.

source: Create a new map file for NFS shares:
cs: Vytvořte nový mapový soubor pro sdílení NFS:

source: <filename>/etc/auto.nfs</filename> normally contains a separate line for each NFS share. Its format is described in <xref linkend="sec.autofs.mapfiles"/>. Add the line describing the mount point and the NFS share network address:
cs: Soubor <filename>/etc/auto.nfs</filename> obvykle obsahuje samostatný řádek pro každou sdílenou složku NFS. Jeho formát je popsán v <xref linkend="sec.autofs.mapfiles"/>. Přidejte řádek popisující přípojný bod a síťovou adresu sdílení NFS:

source: The above line means that the <filename>/home/geeko/doc/export</filename> directory on the <literal>jupiter.com</literal> host will be auto-mounted to the <filename>/nfs/export</filename> directory on the local host (<filename>/nfs</filename> is taken from the <filename>auto.master</filename> map) when requested. The <filename>/nfs/export</filename> directory will be created automatically by <systemitem>autofs</systemitem>.
cs: Výše uvedený řádek znamená, že adresář <filename>/home/geeko/doc/export</filename> na hostiteli <literal>jupiter.com</literal> bude automaticky připojen k adresáři <filename>/nfs/export</filename> na místním hostiteli adresář (<filename>/nfs</filename> je převzat z mapy <filename>auto.master</filename>), je-li třeba. Adresář <filename>/nfs/export</filename> bude automaticky vytvořen démonem <systemitem>autofs</systemitem>.

source: Optionally comment out the related line in <filename>/etc/fstab</filename> if you previously mounted the same NFS share statically. The line should look similar to this:
cs: Jestliže jste dříve staticky připojili stejnou sdílenou složku NFS, můžete případně zakomentovat související řádek ve <filename>/etc/fstab</filename>. Řádek by měl vypadat podobně jako tento:

source: Reload <systemitem>autofs</systemitem> and check if it works:
cs: Znovu načtěte <systemitem>autofs</systemitem> a zkontrolujte, zda funguje:

source: # ls -l /nfs/export total 20 drwxr-xr-x 5 1001 users 4096 Jan 14 2017 .images/ drwxr-xr-x 10 1001 users 4096 Aug 16 2017 .profiled/ drwxr-xr-x 3 1001 users 4096 Aug 30 2017 .tmp/ drwxr-xr-x 4 1001 users 4096 Apr 25 08:56 manual/
cs: # ls -l /nfs/export [zkouška] total 20 drwxr-xr-x 5 1001 users 4096 Jan 14 2017 .images/ drwxr-xr-x 10 1001 users 4096 Aug 16 2017 .profiled/ drwxr-xr-x 3 1001 users 4096 Aug 30 2017 .tmp/ drwxr-xr-x 4 1001 users 4096 Apr 25 08:56 manual/

source: If you can see the list of files on the remote share, then <systemitem>autofs</systemitem> is functioning.
cs: Vypíše-li se seznam souborů ve vzdálené sdílené složce, pak <systemitem> autofs </systemitem> funguje.

source: Advanced Topics
cs: Pokročilá témata

source: This section describes topics that are beyond the basic introduction to <systemitem>autofs</systemitem>—auto-mounting of NFS shares that are available on your network, using wild cards in map files, and information specific to the CIFS file system.
cs: Tato část popisuje témata, která přesahují základní úvod k <systemitem>autofs</systemitem>, tj.: automatické připojení sdílených složek NFS, které jsou k dispozici ve vaší síti, použití zástupných znaků v mapových souborech a informace specifické pro systém souborů CIFS.

source: <filename>/net</filename> Mount Point
cs: <filename>/net</filename> Přípojný bod

source: This helper mount point is useful if you use a lot of NFS shares. <filename>/net</filename> auto-mounts all NFS shares on your local network on demand. The entry is already present in the <filename>auto.master</filename> file, so all you need to do is uncomment it and restart <systemitem>autofs</systemitem>:
cs: Tento pomocný bod připojení je užitečný, když používáte mnoho sdílených složek NFS. <filename>/net</filename> na požádání automaticky připojí všechny sdílené položky NFS ve vaší místní síti. Záznam je již v souboru <filename>auto.master</filename>, takže ho musíte pouze odkomentovat a restartovat <systemitem>autofs</systemitem>:

source: For example, if you have a server named <literal>jupiter</literal> with an NFS share called <filename>/export</filename>, you can mount it by typing
cs: Máte-li například server s názvem <literal>jupiter</literal> se sdílenou složkou NFS s názvem <filename>/export</filename>, můžete ji připojit zadáním

source: on the command line.
cs: na příkazovém řádku.

source: Using Wild Cards to Auto-Mount Subdirectories
cs: Použití zástupných znaků k automatickému připojení podadresářů
