Repository: openSUSE/doc-sle-translations
Catalog: */po/ay_12_migrate_15.*.po
Languages: cs

# _
source: translator-credits
cs: překladatelské kredity alkas alkas@volny.cz, 2016, 2020

source: Main Differences Between <phrase role="productname"><phrase os="osuse">openSUSE Leap</phrase><phrase os="sles">SUSE Linux Enterprise Server</phrase><phrase os="sled">SUSE Linux Enterprise Desktop</phrase></phrase> <phrase os="sles;sled">12</phrase><phrase os="osuse">42.3</phrase> and 15 Profiles
cs: Profily hlavních rozdílů mezi <phrase role="productname"><phrase os="osuse">openSUSE Leap</phrase><phrase os="sles">SUSE Linux Enterprise Server</phrase><phrase os="sled">SUSE Linux Enterprise Desktop</phrase></phrase> <phrase os="sles;sled">12</phrase><phrase os="osuse">42.3</phrase> a 15

source: Significant changes in <phrase role="productname"><phrase os="osuse">openSUSE Leap</phrase><phrase os="sles">SUSE Linux Enterprise Server</phrase><phrase os="sled">SUSE Linux Enterprise Desktop</phrase></phrase> 15, like the new modules concept or replacing SuSEfirewall2 with <systemitem class="daemon">firewalld</systemitem>, required changes in AutoYaST. If you want to reuse existing <phrase role="productname"><phrase os="osuse">openSUSE Leap</phrase><phrase os="sles">SUSE Linux Enterprise Server</phrase><phrase os="sled">SUSE Linux Enterprise Desktop</phrase></phrase> <phrase os="sles;sled">12</phrase><phrase os="osuse">42.3</phrase> a profiles with <phrase role="productname"><phrase os="osuse">openSUSE Leap</phrase><phrase os="sles">SUSE Linux Enterprise Server</phrase><phrase os="sled">SUSE Linux Enterprise Desktop</phrase></phrase> 15, you need to adjust them as documented here.
cs: Významné změny v <phrase role="productname"><phrase os="osuse">openSUSE Leap</phrase><phrase os="sles">SUSE Linux Enterprise Server</phrase><phrase os="sled">SUSE Linux Enterprise Desktop</phrase></phrase> 15, např. nová koncepce modulů nebo nahrazení SuSEfirewall2 programem <systemitem class="daemon">firewalld</systemitem>, vyžaduje změny AutoYaST. Chcete-li opět použít stávající profily <phrase role="productname"><phrase os="osuse">openSUSE Leap</phrase><phrase os="sles">SUSE Linux Enterprise Server</phrase><phrase os="sled">SUSE Linux Enterprise Desktop</phrase></phrase> <phrase os="sles;sled">12</phrase><phrase os="osuse">42.3</phrase> a profiles with <phrase role="productname"><phrase os="osuse">openSUSE Leap</phrase><phrase os="sles">SUSE Linux Enterprise Server</phrase><phrase os="sled">SUSE Linux Enterprise Desktop</phrase></phrase> 15, musíte je nastavit podle této dokumentace.

source: Product Selection
cs: Výběr produktu

source: Starting with <phrase role="productname"><phrase os="osuse">openSUSE Leap</phrase><phrase os="sles">SUSE Linux Enterprise Server</phrase><phrase os="sled">SUSE Linux Enterprise Desktop</phrase></phrase> 15, all products are distributed using a single installation medium. Therefore you need to choose which product to install by using the <tag class="element">product</tag> tag. In the following example SUSE Linux Enterprise Desktop is the chosen product:
cs: Počínaje <phrase role="productname"><phrase os="osuse">openSUSE Leap</phrase><phrase os="sles">SUSE Linux Enterprise Server</phrase><phrase os="sled">SUSE Linux Enterprise Desktop</phrase></phrase> 15, jsou všechny produkty distribuovány na jadiném instalačním médiu. Proto si musíte zvolit, který produkt instalujete, použitím značky <tag class="element">product</tag>. V následujícím příkladu je zvolen SUSE Linux Enterprise Desktop:

source: In special cases, the medium may contain only one product. If so there is no need to explicitly select a product as described above. AutoYaST will select the only available product automatically.
cs: Ve zvláštních případech může médium obsahovat pouze jeden produkt. Pokud ano, není třeba explicitně vybrat produkt, jak je popsáno výše. AutoYaST automaticky vybere jediný dostupný produkt.

source: For backward compatibility with profiles created for pre-<phrase os="sles;sled">SLE</phrase><phrase os="osuse">Leap</phrase> 15 products, AutoYaST implements a heuristic that selects products automatically. This heuristic will be used when the profile does not contain a <tag class="element">product</tag> element. This heuristic is based on the package and pattern selection in the profile. However, whenever possible, avoid using this mechanism and adapt old profiles to use explicit product selection.
cs: Pro zpětnou kompatibilitu s profily vytvořenými pro produkty před <phrase os = "sles; sled"> SLE </phrase> <phrase os = "osuse"> Leap </phrase> 15 implementuje AutoYaST heuristiku, která produkty automaticky vybírá. Tato heuristika se použije, pokud profil neobsahuje prvek <tag class="element">product</tag>. Tato heuristika je založena na výběru balíčku a vzoru v profilu. Kdykoli je to možné, nepoužívejte tento mechanismus a upravte staré profily tak, aby používaly explicitní výběr produktů.

source: If the product selection fails, an error is shown and the installation will not be continued.
cs: Pokud výběr produktu selže, zobrazí se chyba a instalace nebude pokračovat.

source: The <phrase role="productname"><phrase os="osuse">openSUSE Leap</phrase><phrase os="sles">SUSE Linux Enterprise Server</phrase><phrase os="sled">SUSE Linux Enterprise Desktop</phrase></phrase> 15 installation medium only contains a very minimal set of packages to install. This minimal set only provides an installation environment and does not include any server applications or advanced tools. Additional software repositories, providing more packages are offered as <quote>modules</quote> or <quote>extensions</quote>. They are provided via two alternatives:
cs: Instalační médium <phrase role="productname"> <phrase os="osuse">openSUSE Leap</phrase> <phrase os="sles">SUSE Linux Enterprise Server</phrase> <phrase os="sled">SUSE Linux Enterprise Desktop</phrase> </phrase> 15 obsahuje pouze zcela minimální sadu balíčků k instalaci. Tato minimální sada poskytuje pouze instalační prostředí a neobsahuje žádné serverové aplikace ani pokročilé nástroje. Další softwarová úložiště, která poskytují více balíčků, jsou nabízena jako <quote>moduly</quote> nebo <quote>rozšíření</quote>. Poskytují se ve dvou alternativách:

source: via a registration server (the SUSE Customer Center or a local SMT/RMT proxy)
cs: přes registrační server (zákaznické centrum SUSE nebo místní proxy SMT/RMT)

source: via the SLE-15-Packages ISO containing all modules and extensions. Using this medium does not require access to a registration server during installation. It can be shared on the local network via an installation server.
cs: pomocí ISO balíčků SLE-15 obsahujících všechny moduly a rozšíření. Používání tohoto média nevyžaduje během instalace přístup k registračnímu serveru. Lze jej sdílet v místní síti z instalačního serveru.

source: Maintenance Updates
cs: Aktualizace údržby

source: Only using the registration server will grant access to all maintenance updates at installation time. Maintenance updates are not available when using the DVD medium without registration.
cs: Přístup ke všem aktualizacím údržby v době instalace bude možné, pouze když použijete registrační server. Při použití média DVD bez registrace nejsou aktualizace údržby k dispozici.

source: Adding Modules or Extensions Using the Registration Server
cs: Přidávání modulů nebo rozšíření pomocí registračního serveru

source: To add a module or extension from the registration server, use the <tag class="element">addons</tag> tag for each module/extension in the suse_register section. Extensions require an additional registration code, which can be specified with the <tag class="element">reg_code</tag> tag.
cs: Chcete-li přidat modul nebo rozšíření z registračního serveru, použijte pro každý modul/rozšíření v sekci suse_register značku <tag class="element">addons</tag>. Rozšíření vyžadují další registrační kód, který lze zadat značkou <tag class="element">reg_code</tag>.

source: The following XML code adds the Basesystem and Server Applications modules and the Live Patching extension. To get the respective values for the tags <tag class="element">name</tag>, <tag class="element">version</tag>, and <tag class="element">arch</tag>, run the command <command>SUSEConnect --list-extensions</command> on a system that already has <phrase os="sles;sled">SLE</phrase> 15 installed.
cs: Následující kód XML přidává moduly Basesystem (základní systém) a Server Applications a rozšíření Live Patching (živé záplatování). Chcete-li získat příslušné hodnoty pro značky <tag class="element">name</tag>, <tag class="element">version</tag> a <tag class="element">arch</tag> , spusťte příkaz <command>SUSEConnect --list-extensions</command> v systému, který již má <phrase os="sles;sled">SLE</phrase> 15 instalován.

source: Adding Modules and Extensions (online)
cs: Přidávání modulů a rozšíření (online)

source: &lt;suse_register&gt; &lt;addons config:type="list"&gt; &lt;addon&gt; &lt;name&gt;sle-module-basesystem&lt;/name&gt; &lt;version&gt;15&lt;/version&gt; &lt;arch&gt;x86_64&lt;/arch&gt; &lt;/addon&gt; &lt;addon&gt; &lt;name&gt;sle-module-server-applications&lt;/name&gt; &lt;version&gt;15&lt;/version&gt; &lt;arch&gt;x86_64&lt;/arch&gt; &lt;/addon&gt; &lt;addon&gt; &lt;name&gt;sle-module-live-patching&lt;/name&gt; &lt;version&gt;15&lt;/version&gt; &lt;arch&gt;x86_64&lt;/arch&gt; &lt;reg_code&gt;<replaceable>REGISTRATION_CODE</replaceable>&lt;/reg_code&gt; &lt;/addon&gt; &lt;/addons&gt; &lt;/suse_register&gt;
cs: &lt;suse_register&gt; &lt;addons config:type="list"&gt; &lt;addon&gt; &lt;name&gt;sle-module-basesystem&lt;/name&gt; &lt;version&gt;15&lt;/version&gt; &lt;arch&gt;x86_64&lt;/arch&gt; &lt;/addon&gt; &lt;addon&gt; &lt;name&gt;sle-module-server-applications&lt;/name&gt; &lt;version&gt;15&lt;/version&gt; &lt;arch&gt;x86_64&lt;/arch&gt; &lt;/addon&gt; &lt;addon&gt; &lt;name&gt;sle-module-live-patching&lt;/name&gt; &lt;version&gt;15&lt;/version&gt; &lt;arch&gt;x86_64&lt;/arch&gt; &lt;reg_code&gt;<replaceable>REGISTRAČNÍ_KÓD</replaceable>&lt;/reg_code&gt; &lt;/addon&gt; &lt;/addons&gt; &lt;/suse_register&gt;

source: Refer to <xref linkend="CreateProfile.Register"/> for more information.
cs: Další informace najdete v <xref linkend="CreateProfile.Register"/>.

source: Adding Modules or Extensions Using the SLE-15-Packages ISO
cs: Přidávání modulů nebo rozšíření pomocí balíčků ISO SLE-15

source: To add a module or extension using the SLE-15-Packages ISO, create entries in the add-on section as shown in the example below. The following XML code adds the Basesystem module from a DVD created from the ISO:
cs: Chcete-li přidat modul nebo rozšíření pomocí ISO SLE-15-Packages, vytvořte položky v sekci doplňků, jak je znázorněno v níže uvedeném příkladu. Následující kód XML přidává modul Basesystem základní systém) z DVD vytvořeného z ISO:

source: Adding Modules and Extensions (offline)
cs: Přidávání modulů a rozšíření (offline)

source: Product Name Matching
cs: Shoda názvu produktu

source: The <tag class="element">product</tag> tag must match the internal product name contained in the repository. If the product name does not match at installation AutoYaST will report an error.
cs: Značka <tag class="element">product</tag> se musí shodovat s interním názvem produktu obsaženým v úložišti. Neshoduje-li se název produktu při instalaci, AutoYaST ohlásí chybu.

source: If you have multiple physical DVD drives you can select a specific device using the <literal>devices</literal> parameter in the URL, for example <literal>dvd:///?devices=/dev/sr1</literal>.
cs: Pokud máte více fyzických jednotek DVD, můžete vybrat konkrétní zařízení pomocí parametru <literal>devices</literal> v adrese URL, například <literal>dvd:///?devices=/dev/sr1</literal>.

source: &gt;Using SLE-15-Packages Medium from a Local Server
cs: &gt;Použití média SLE-15-Packages z místního serveru

source: You can share the DVD content on the local network via an NFS, FTP or HTTP server. To do so replace the URL in the <tag class="element">media_url</tag> tag so it points to root of the medium on the server, for example:
cs: Obsah DVD můžete sdílet v místní síti prostřednictvím serveru NFS, FTP nebo HTTP. Chcete-li tak učinit, nahraďte adresu URL ve značce <tag class="element">media_url</tag> tak, aby ukazovala na kořen média na serveru, například:

source: Renamed Software Patterns
cs: Přejmenované softwarové šablony

source: Software patterns have also changed in <phrase role="productname"><phrase os="osuse">openSUSE Leap</phrase><phrase os="sles">SUSE Linux Enterprise Server</phrase><phrase os="sled">SUSE Linux Enterprise Desktop</phrase></phrase> 15. Some patterns have been renamed; a short summary is provided in the following table.
cs: V <phrase role="productname"><phrase os="osuse">openSUSE Leap</phrase><phrase os="sles">SUSE Linux Enterprise Server</phrase><phrase os="sled">SUSE Linux Enterprise Desktop</phrase></phrase> 15 se také změnily softwarové šablony. Některé šablony byly přejmenovány; krátké shrnutí je uvedeno v následující tabulce.

source: Old <phrase os="sles;sled">SLE</phrase><phrase os="osuse">Leap</phrase> <phrase os="sles;sled">12</phrase><phrase os="osuse">42.3</phrase> Pattern
cs: Stará šablona <phrase os="sles;sled">SLE</phrase><phrase os="osuse">Leap</phrase> <phrase os="sles;sled">12</phrase><phrase os="osuse">42.3</phrase>

source: New <phrase os="sles;sled">SLE</phrase><phrase os="osuse">Leap</phrase> 15 Pattern
cs: Nová šablona <phrase os="sles;sled">SLE</phrase><phrase os="osuse">Leap</phrase> 15

source: enhanced_base
cs: enhanced_base [základní vylepšená]

source: printing
cs: printing [tisk]

source: print_server
cs: print_server [tiskový server]

source: Carefully check if all required packages are available in the defined patterns and adjust the profiles accordingly. Additionally, the required patterns and packages have to be available in the activated extensions or modules.
cs: Pečlivě zkontrolujte, zda jsou v definovaných šablonách k dispozici všechny požadované balíčky, a podle toho upravte profily. V aktivovaných rozšířeních nebo modulech musí být navíc k dispozici požadované šablony a balíčky.

source: Notes
cs: Poznámky

source: The pattern renames in the table above are not 1:1 replacements; the content of some patterns has been changed as well, some packages were moved to a different pattern or even removed from <phrase role="productname"><phrase os="osuse">openSUSE Leap</phrase><phrase os="sles">SUSE Linux Enterprise Server</phrase><phrase os="sled">SUSE Linux Enterprise Desktop</phrase></phrase> 15.
cs: Přejmenování vzoru v tabulce výše nejsou nahrazením 1: 1; byl také změněn obsah některých vzorů, některé balíčky byly přesunuty do jiného vzoru nebo dokonce odstraněny z <phrase role="productname"><phrase os="osuse">openSUSE Leap</phrase><phrase os="sles">SUSE Linux Enterprise Server</phrase><phrase os="sled">SUSE Linux Enterprise Desktop</phrase></phrase> 15.

source: Check that the required packages are still included in the used patterns, and optionally use the <tag class="element">packages</tag> tag to specify additional packages.
cs: Zkontrolujte, zda jsou v použitých vzorech stále zahrnuty požadované balíčky; volitelně použijte značku <tag class="element">packages</tag> k určení dalších balíčků.

source: The list above might be incomplete, as some products have not been released for <phrase role="productname"><phrase os="osuse">openSUSE Leap</phrase><phrase os="sles">SUSE Linux Enterprise Server</phrase><phrase os="sled">SUSE Linux Enterprise Desktop</phrase></phrase> 15, yet.
cs: Výše uvedený seznam může být neúplný, protože některé produkty nebyly pro <phrase role="productname"><phrase os="osuse">openSUSE Leap</phrase><phrase os="sles">SUSE Linux Enterprise Server</phrase><phrase os="sled">SUSE Linux Enterprise Desktop</phrase></phrase> 15 zatím vydány.

source: Registration of Module and Extension Dependencies
cs: Registrace závislostí modulů a rozšíření

source: Starting with <phrase role="productname"><phrase os="osuse">openSUSE Leap</phrase><phrase os="sles">SUSE Linux Enterprise Server</phrase><phrase os="sled">SUSE Linux Enterprise Desktop</phrase></phrase> 15, AutoYaST automatically reorders the extensions according to their dependencies during registration. This means the order of the extensions in the AutoYaST profile is not important.
cs: Počínaje systémem <phrase role="productname"><phrase os="osuse">openSUSE Leap</phrase><phrase os="sles">SUSE Linux Enterprise Server</phrase><phrase os="sled">SUSE Linux Enterprise Desktop</phrase></phrase> 15, změní AutoYaST během registrace pořadí rozšíření automaticky podle jejich závislostí. To znamená, že pořadí rozšíření v profilu AutoYaST není důležité.

source: Also AutoYaST automatically adds the dependent modules even though they are missing in the profile. This means you are not required to specify all required modules. However, if an extension depends on another extension, it needs to be specified in the profile, including the registration key. Otherwise the registration would fail.
cs: AutoYaST také automaticky přidává závislé moduly, i když v profilu chybějí. To znamená, že nemusíte specifikovat všechny požadované moduly. Pokud však přípona závisí na jiné příponě, je třeba ji zadat v profilu, včetně registračního klíče. Jinak by registrace selhala.

source: You can list the available extensions and modules in a registered system using the <command>SUSEConnect --list-extensions</command> command.
cs: Seznam dostupných rozšíření a modulů v registrovaném systému můžete zobrazit příkazem <command>SUSEConnect --list-extensions</command>.

source: Partitioning
cs: Rozdělení na oddíly

source: The partitioning back-end previously used by YaST, <systemitem class="library">libstorage</systemitem>, has been replaced by <systemitem class="library">libstorage-ng</systemitem> which is designed to allow new capabilities that were not possible before. Despite the back-end change, the XML syntax for profiles has <emphasis>not</emphasis> changed. However, <phrase role="productname"><phrase os="osuse">openSUSE Leap</phrase><phrase os="sles">SUSE Linux Enterprise Server</phrase><phrase os="sled">SUSE Linux Enterprise Desktop</phrase></phrase> 15 comes with some general changes, which are explained below.
cs: Rozdělovací mechanismus, který dříve používal YaST, <systemitem class="library">libstorage</systemitem>, byl nahrazen <systemitem class="library">libstorage-ng</systemitem>, který je navržen pro nové funkce. Navzdory změně prováděcího mechanismu se syntaxe XML pro profily <emphasis>nezměnila</emphasis>. Systém <phrase role="productname"><phrase os="osuse">openSUSE Leap</phrase><phrase os="sles">SUSE Linux Enterprise Server</phrase><phrase os="sled">SUSE Linux Enterprise Desktop</phrase></phrase> 15 však přináší i některé obecné změny, které jsou objasněny dále.

source: GPT Becomes the Default Partition Type on AMD64/Intel 64
cs: GPT se stává výchozím typem oddílu na AMD64/Intel 64

source: On AMD64/Intel 64 systems, GPT is now the preferred partition type. However, if you would like to retain the old behavior, you can explicitly indicate this in the profile by setting the <tag class="element">disklabel</tag> element to <literal>msdos</literal>.
cs: V systémech AMD64/Intel 64 je nyní preferovaným typem oddílu GPT. Pokud si však chcete zachovat starý výchozí typ, můžete to v profilu výslovně označit změnou prvku <tag class="element">disklabel</tag> na <literal>msdos</literal>.

source: Setting Partition Numbers
cs: Nastavení čísel oddílů

source: AutoYaST will no longer support forcing partition numbers, as it might not work in some situations. Moreover, GPT is now the preferred partition table type, so partition numbers are less relevant.
cs: AutoYaST již nebude podporovat vynucené přiřazení čísel oddílů, protože v některých situacích nemusí fungovat. Navíc je nyní preferovaným typem tabulky oddílů GPT, takže čísla oddílů jsou méně důležitá.

source: However, the <tag class="element">partition_nr</tag> tag is still available in order to specify a partition to be reused. Refer to <xref linkend="ay.partition_configuration"/> for more information.
cs: Značka <tag class="element">partition_nr</tag> je však stále k dispozici, aby bylo možné určit oddíl, který má být znovu použit. Další informace najdete v <xref linkend="ay.partition_configuration"/>.

source: Forcing Primary Partitions
cs: Vynucení primárních oddílů

source: It is still possible to force a partition as <literal>primary</literal> (only on MS-DOS partition tables) by setting the <tag class="element">primary_type</tag> to <literal>primary</literal>. However, any other value, like <literal>logical</literal>, will be ignored by AutoYaST, which will automatically determine the partition type.
cs: V tabulkách oddílů systému MS-DOS (a pouze tam) je stále možné vynutit vytvoření oddílu jako <literal>primárního</literal> nastavením <tag class="element">primary_type</tag> na <literal>primary</literal>. Jakákoli jiná hodnota, například <literal>logical</literal>, bude ale ignorována programem AutoYaST, který automaticky určí typ oddílu.

source: Btrfs: Default Subvolume Name
cs: Btrfs: Výchozí název podsvazku

source: The new storage layer allows the user to set different default subvolumes (or none at all) for every Btrfs file system. As shown in the example below, a prefix name can be specified for each partition using the <tag class="element">subvolumes_prefix</tag> tag:
cs: Nová vrstva úložiště umožňuje uživateli nastavit různé výchozí podsvazky (nebo vůbec žádné) pro každý souborový systém Btrfs. Jak je znázorněno v níže uvedeném příkladu, název předpony lze zadat pro každý oddíl pomocí značky <tag class="element">subvolumes_prefix</tag>:

source: Specifying the Btrfs Default Subvolume Name
cs: Zadání výchozího názvu podsvazku Btrfs

source: To omit the subvolume prefix, set the <tag class="element">subvolumes_prefix</tag> tag:
cs: Chcete-li vynechat předponu subvolume, nastavte značku <tag class="element">subvolumes_prefix</tag>:

source: Disabling Btrfs Subvolumes
cs: Zákaz podsvazků Btrfs

source: As a consequence of the new behavior, the old <tag class="element">btrfs_set_default_subvolume_name</tag> tag is not needed and, therefore, it is not supported anymore.
cs: V důsledku nového chování už není potřebná stará značka <tag class="element">btrfs_set_default_subvolume_name</tag>, a proto už není podporována.

source: Btrfs: Disabling Subvolumes
cs: Btrfs: Zákaz podsvazků

source: Btrfs subvolumes can be disabled by setting <tag class="element">create_subvolumes</tag> to <literal>false</literal>. To skip the default <literal>@</literal> subvolume, specify <tag class="element">subvolumes_prefix</tag>.
cs: Podsvazky Btrfs lze zakázat nastavením <tag class="element">create_subvolumes</tag> na <literal>false</literal>. Chcete-li přeskočit výchozí podsvazek <literal>@</literal>, zadejte <tag class="element">subvolumes_prefix</tag>.

source: Reading an Existing <filename>/etc/fstab</filename> Is No Longer Supported
cs: Čtení existujícího <filename>/etc/fstab</filename> již není podporováno

source: On <phrase role="productname"><phrase os="osuse">openSUSE Leap</phrase><phrase os="sles">SUSE Linux Enterprise Server</phrase><phrase os="sled">SUSE Linux Enterprise Desktop</phrase></phrase> 15 the ability to read an existing <filename>/etc/fstab</filename> from a previous installation when trying to determine the partitioning layout, is no longer supported.
cs: Na <phrase role="productname"><phrase os="osuse">openSUSE Leap</phrase><phrase os="sles">SUSE Linux Enterprise Server</phrase><phrase os="sled">SUSE Linux Enterprise Desktop</phrase></phrase> 15 už není podporována schopnost číst při pokusu o určení rozložení oddílů stávající soubor <filename>/etc/fstab</filename> z předešlé instalace.
