Repository: openSUSE/doc-sle-translations
Catalog: */po/ay_12_migrate_15.*.po
Languages: cs

source: Setting for Aligning Partitions Has Been Dropped
cs: Nastavení pro zarovnání oddílů bylo zrušeno

source: As cylinders have become obsolete, the <tag class="element">partition_alignment</tag>&gt; tag makes no sense and it is no longer available. AutoYaST will always try to align partitions in an optimal way.
cs: Jelikož válce (-stopy-sektory disků) zastaraly, nemá značka <tag class="element">partition_alignment</tag>&gt; smysl a není už k dispozici. AutoYaST se vždy pokusí zarovnat oddíly optimálním způsobem.

source: Firewall Configuration
cs: Konfigurace brány firewall

source: In <phrase role="productname"><phrase os="osuse">openSUSE Leap</phrase><phrase os="sles">SUSE Linux Enterprise Server</phrase><phrase os="sled">SUSE Linux Enterprise Desktop</phrase></phrase> 15, SuSEfirewall2 has been replaced by <systemitem class="daemon">firewalld</systemitem> as the default firewall. The configuration of these two firewalls differs significantly, and therefore the respective AutoYaST profile syntax has changed.
cs: V systému <phrase role="productname"><phrase os="osuse">openSUSE Leap</phrase><phrase os="sles">SUSE Linux Enterprise Server</phrase><phrase os="sled">SUSE Linux Enterprise Desktop</phrase></phrase> 15 byl SuSEfirewall2 nahrazen bránou <systemitem class="daemon">firewalld</systemitem> jako výchozí. Konfigurace těchto dvou bran firewall se výrazně liší, a proto se příslušná syntaxe profilu AutoYaST změnila.

source: Old profiles will continue working, but the supported configuration will be very limited. It is recommended to update profiles for <phrase os="sles;sled">SLE</phrase><phrase os="osuse">Leap</phrase> 15 as outlined below. If keeping <phrase os="sles;sled">SLE</phrase><phrase os="osuse">Leap</phrase> <phrase os="sles;sled">12</phrase><phrase os="osuse">42.3</phrase> profiles, we recommend to check the final configuration to avoid unexpected behavior or network security threats.
cs: Staré profily budou i nadále fungovat, ale podporovaná konfigurace bude velmi omezená. Doporučuje se aktualizovat profily pro <phrase os="sles;sled">SLE</phrase><phrase os="osuse">Leap</phrase> 15, jak je popsáno dále. Zachováte-li si profily z <phrase os="sles;sled">SLE</phrase><phrase os="osuse">Leap</phrase> <phrase os="sles;sled">12</phrase><phrase os="osuse">42.3</phrase>, doporučujeme zkontrolovat konečnou konfiguraci, abyste se vyhnuli neočekávanému chování nebo ohrožení zabezpečení sítě.

source: AutoYaST Firewall Configuration in <phrase os="sles;sled">SLE</phrase><phrase os="osuse">Leap</phrase> 15: Backward Compatibility
cs: Konfigurace brány firewall AutoYaST v <phrase os="sles; sled">SLE</phrase> <phrase os="osuse">Leap</phrase> 15: Zpětná kompatibilita

source: Supported (but deprecated)
cs: Podporováno (ale zastaralé)

source: Unsupported
cs: Nepodporováno

source: Configuration options from SuSEfirewall2 that are no longer available either have no equivalent mapping in <systemitem class="daemon">firewalld</systemitem> or will be supported in future releases of <phrase role="productname"><phrase os="osuse">openSUSE Leap</phrase><phrase os="sles">SUSE Linux Enterprise Server</phrase><phrase os="sled">SUSE Linux Enterprise Desktop</phrase></phrase>. Some <systemitem class="daemon">firewalld</systemitem> features are not yet supportes by YaST and AutoYaST—you can make use of them with post installation scripts in your AutoYaST profile. See <xref linkend="createprofile.scripts"/> for more information.
cs: Možnosti konfigurace ze SuSEfirewall2, které již nejsou k dispozici, nemají ekvivalentní mapování v <systemitem class="daemon">firewalld</systemitem> nebo budou podporovány v budoucích verzích <phrase role="productname"><phrase os="osuse">openSUSE Leap</phrase><phrase os="sles">SUSE Linux Enterprise Server</phrase><phrase os="sled">SUSE Linux Enterprise Desktop</phrase></phrase>. Některé funkce brány <systemitem class="daemon">firewalld</systemitem> YaST a AutoYaST dosud nepodporují - můžete je uplatnit v po-instalačních skriptech ve Vašem profilu AutoYaST. Další informace najdete v <xref linkend="createprofile.scripts"/>.

source: Enabling and Starting the Firewall
cs: Povolení a spuštění brány firewall

source: Enabling and starting the <systemitem class="daemon">systemd</systemitem> service for <systemitem class="daemon">firewalld</systemitem> is done with the same syntax as in <phrase os="sles;sled">SLE</phrase><phrase os="osuse">Leap</phrase> <phrase os="sles;sled">12</phrase><phrase os="osuse">42.3</phrase>. This is the only part of the firewall configuration syntax in AutoYaST that has not changed:
cs: Povolení a spuštění služby <systemitem class="daemon">systemd</systemitem> pro <systemitem class="daemon">firewalld</systemitem> se provádí se stejnou syntaxí jako v <phrase os="sles;sled">SLE</phrase><phrase os="osuse">Leap</phrase> <phrase os="sles;sled">12</phrase><phrase os="osuse">42.3</phrase>. Toto je jediná část syntaxe konfigurace brány firewall v AutoYaST, která se nezměnila:

source: The following examples show how to convert deprecated (but still supported) profiles to the <phrase os="sles;sled">SLE</phrase><phrase os="osuse">Leap</phrase> 15 syntax:
cs: Následující příklady ukazují, jak převést zastaralé (ale stále podporované) profily na syntaxi <phrase os="sles; sled">SLE</phrase> <phrase os="osuse">Leap</phrase> 15:

source: Assigning Interfaces to Zones
cs: Přiřazení rozhraní zónám

source: Both SuSEfirewall2 and <systemitem class="daemon">firewalld</systemitem> are zone-based, but have a different set of predefined rules and a different level of trust for network connections.
cs: SuSEfirewall2 i <systemitem class="daemon">firewalld</systemitem> jsou založeny na zónách, ale mají odlišnou sadu předdefinovaných pravidel a jinou úroveň důvěryhodnosti pro síťová připojení.

source: Mapping of SuSEfirewall2 and <systemitem class="daemon">firewalld</systemitem> Zones
cs: Mapování zón SuSEfirewall2 a <systemitem class="daemon">firewalld</systemitem>

source: dmz
cs: dmz (demilitarizovaná)

source: external
cs: external (vnější)

source: EXT with <tag class="element">FW_MASQUERADE</tag> set to <literal>yes</literal>
cs: EXT s <tag class="element">FW_MASQUERADE</tag> nastaveným na <literal>yes</literal>

source: public
cs: public (veřejná)

source: EXT with <tag class="element">FW_MASQUERADE</tag> set to <literal>no</literal>
cs: EXT s <tag class="element">FW_MASQUERADE</tag> nastaveným na <literal>no</literal>

source: internal
cs: internal (vnitřní)

source: INT with <tag class="element">FW_PROTECT_FROM_INT</tag> set to <literal>yes</literal>
cs: INT s <tag class="element">FW_PROTECT_FROM_INT</tag> nastaveným na <literal>yes</literal>

source: trusted
cs: trusted (důvěryhodná)

source: INT with <tag class="element">FW_PROTECT_FROM_INT</tag> set to <literal>no</literal>
cs: INT s <tag class="element">FW_PROTECT_FROM_INT</tag> nastaveným na <literal>no</literal>

source: block
cs: block (blokovaná)

source: drop
cs: drop (kde se nereaguje)

source: home
cs: home (domovská)

source: work
cs: work (pracovní)

source: In SuSEfirewall2 the default zone is the external one (EXT) but it also allows the use of the special keyword <literal>any</literal> to assign all the interfaces that are not listed anywhere to a specified zone.
cs: V SuSEfirewall2 je výchozí zóna externí (EXT), ale také lze použít speciální klíčové slovo <literal>any</literal> k přiřazení všech rozhraní, která nejsou nikde jinde uvedena, k určité zóně.

source: Default Configuration
cs: Výchozí konfigurace

source: The following two examples show the default configuration that is applied for the interfaces <systemitem>eth0</systemitem>, <systemitem>eth1</systemitem>, <systemitem>wlan0</systemitem> and <systemitem>wlan1</systemitem>.
cs: Následující dva příklady ukazují výchozí konfiguraci, která se zde používá pro rozhraní <systemitem>eth0</systemitem>, <systemitem>eth1</systemitem>, <systemitem>wlan0</systemitem> a <systemitem>wlan1</systemitem>.

source: Assigning Zones: Default Configuration (Deprecated Syntax)
cs: Přiřazení zón: Výchozí konfigurace (zastaralá syntaxe)

source: Assigning Zones: Default Configuration (<phrase os="sles;sled">SLE</phrase><phrase os="osuse">Leap</phrase> 15 Syntax)
cs: Přiřazení zón: Výchozí konfigurace (syntaxe <phrase os="sles;sled">SLE</phrase> <phrase os="osuse">Leap</phrase> 15)

source: Masquerading and Protecting Internal Zones
cs: Maskování a ochrana vnitřních zón

source: The following two examples show how to configure the interfaces <systemitem>eth0</systemitem>, <systemitem>eth1</systemitem>, <systemitem>wlan0</systemitem> and <systemitem>wlan1</systemitem> with masquerading and protected internal zones.
cs: Následující dva příklady ukazují, jak konfigurovat rozhraní <systemitem>eth0</systemitem>, <systemitem>eth1</systemitem>, <systemitem>wlan0</systemitem> a <systemitem>wlan1</systemitem> s maskováním a chráněnými interními zónami.

source: Masquerading and Protecting Internal Zones (Deprecated Syntax)
cs: Maskování a ochrana interních zón (zastaralá syntaxe)

source: Masquerading and Protecting Internal Zones (<phrase os="sles;sled">SLE</phrase><phrase os="osuse">Leap</phrase> 15 Syntax)
cs: Maskování a ochrana vnitřních zón (Syntaxe <phrase os="sles;sled">SLE</phrase> <phrase os="osuse">Leap</phrase> 15)

source: Opening Ports
cs: Otevírání portů

source: In SuSEfirewall2 the <tag class="element">FW_SERVICES_\{DMZ,EXT,INT}_\{TCP,UDP,IP,RPC}</tag> tags were used to open ports in different zones.
cs: V SuSEfirewall2 byly k otevření portů v různých zónách použity značky <tag class="element">FW_SERVICES _\{DMZ,EXT,INT}_\{TCP,UDP,IP,RPC}</tag>.

source: For <literal>TCP</literal> or <literal>UDP</literal>, SuSEfirewall2 supported a port number or range, or a service name from <filename>/etc/services </filename> with a single tag for the respective zone and service. For IP services a port number or range, or a protocol name from <filename>/etc protocols</filename> could be specified with <tag class="element">FW_SERVICES_<replaceable>ZONE</replaceable>_IP</tag>.
cs: Pro protokoly <literal>TCP</literal> nebo <literal>UDP</literal> podporoval SuSEfirewall2 číslo nebo rozsah portu nebo název služby z <filename>/etc/services</filename> s jedinou značkou pro příslušnou zónu a službu. U služeb IP šlo zadat číslo portu nebo rozsah nebo název protokolu z <filename>/etc/protocols</filename> pomocí <tag class="element">FW_SERVICES_<replaceable>ZÓNA</replaceable>_IP</tag>.

source: For <systemitem class="daemon">firewalld</systemitem> each port, port range, and service requires a separate entry in the <tag class="element">port</tag> section for the respective zone. IP services need separate entries in the <tag class="element">protocol</tag> section.
cs: U <systemitem class="daemon">firewalld</systemitem> vyžaduje každý port, rozsah portů a služba samostatný záznam v sekci <tag class="element">port</tag> pro příslušnou zónu. Služby IP vyžadují samostatné položky v sekci <tag class="element">protocol</tag>.

source: RPC services, which were supported by SuSEfirewall2, are no longer supported with <systemitem class="daemon">firewalld</systemitem>.
cs: Služby RPC, které byly podporovány SuSEfirewall2, již v <systemitem class="daemon">firewalld</systemitem> podporovány nejsou.

source: Opening Ports (Deprecated Syntax)
cs: Otevírání portů (zastaralá syntaxe)

source: Opening Ports (<phrase os="sles;sled">SLE</phrase><phrase os="osuse">Leap</phrase> 15 Syntax)
cs: Otevírání portů (syntaxe <phrase os="sles;sled">SLE</phrase> <phrase os="osuse">Leap</phrase> 15)

source: Opening <systemitem class="daemon">firewalld</systemitem> Services
cs: Otevírání služeb <systemitem class="daemon">firewalld</systemitem>

source: For opening a combination of ports and/or protocols, SuSEfirewall2 provides the <tag class="element">FW_CONFIGURATIONS_\{EXT, DMZ, INT}</tag> tags which are equivalent to services in <systemitem class="daemon">firewalld</systemitem>.
cs: Pro otevření kombinace portů a/nebo protokolů poskytuje SuSEfirewall2 značky <tag class="element">FW_CONFIGURATIONS_\{EXT, DMZ, INT}</tag>, které jsou ekvivalentní službám v <systemitem class="daemon">firewalld</systemitem>.

source: Opening Services (Deprecated Syntax)
cs: Otevírání služeb (zastaralá syntaxe)

source: Opening Services (<phrase os="sles;sled">SLE</phrase><phrase os="osuse">Leap</phrase> 15 Syntax)
cs: Otevírání služeb (syntaxe<phrase os="sles;sled">SLE</phrase> <phrase os="osuse">Leap</phrase> 15)

source: The services definition can be added via packages in both cases:
cs: Definici služeb lze v obou případech přidat pomocí balíčků:

source: SuSEfirewall2 Service Definitions: <link xlink:href="https://en.opensuse.org/SuSEfirewall2/Service_Definitions_Added_via_Packages"/>
cs: Definice služby SuSEfirewall2: <link xlink:href="https://en.opensuse.org/SuSEfirewall2/Service_Definitions_Added_via_Packages"/>

source: <systemitem class="daemon">firewalld</systemitem> RPM Packaging <link xlink:href="https://en.opensuse.org/firewalld/RPM_Packaging"/>
cs: <systemitem class="daemon">firewalld</systemitem> - balení RPM <link xlink:href="https://en.opensuse.org/firewalld/RPM_Packaging"/>

source: <systemitem class="daemon">firewalld</systemitem> already provides support for the majority of important services in <filename>/usr/lib/firewalld/services</filename>. Check this directory for an existing configuration before defining a new one.
cs: <systemitem class="daemon">firewalld</systemitem> již poskytuje podporu pro většinu důležitých služeb v <filename>/usr/lib/firewalld/services</filename>. Než definujete novou službu, zkontrolujte konfiguraci uloženou v tomto adresáři.

source: For More Information
cs: Další informace

source: <link xlink:href="https://www.suse.com/documentation/sles-12/book_autoyast/data/createprofile_firewall.html">SuSEfirewall2/AutoYaST Documentation for SLE 12</link>
cs: <link xlink:href="https://www.suse.com/documentation/sles-12/book_autoyast/data/createprofile_firewall.html">Dokumentace SuSEfirewall2/AutoYaST pro SLE 12</link>

source: <link xlink:href="http://www.firewalld.org/documentation/">Official <systemitem class="daemon">firewalld</systemitem> Documentation</link>
cs: <link xlink:href="http://www.firewalld.org/documentation/">Oficiální dokumentace <systemitem class="daemon">firewalld</systemitem></link>

source: NTP Configuration
cs: Konfigurace NTP

source: The time server synchronization daemon <systemitem class="daemon">ntpd</systemitem> has been replaced with the more modern daemon <systemitem class="daemon">chrony</systemitem>. Therefore the configuration syntax for the time-keeping daemon in AutoYaST has changed. AutoYaST profiles from <phrase os="sles;sled">SLE</phrase><phrase os="osuse">Leap</phrase> <phrase os="sles;sled">12</phrase><phrase os="osuse">42.3</phrase> that contain a section with <tag class="element">ntp:client</tag> need to be updated.
cs: Démon synchronizace časového serveru <systemitem class="daemon">ntpd</systemitem> byl nahrazen modernějším démonem <systemitem class="daemon">chrony</systemitem>. Proto se změnila i syntaxe konfigurace AutoYaST pro démona udržujícího čas. Profily AutoYaST v <phrase os="sles;sled">SLE</phrase><phrase os="osuse">Leap</phrase> <phrase os="sles;sled">12</phrase><phrase os="osuse">42.3</phrase>, obsahující sekci s <tag class="element">ntp:client</tag>, je třeba aktualizovat.

source: Instead of containing low level configuration options, NTP is now configured by a set of high level options that are applied on top of the default settings:
cs: Místo toho, aby obsahoval možnosti konfigurace na nízké úrovni, je nyní NTP konfigurován sadou možností vysoké úrovně, které jsou nástavbou výchozího nastavení:

source: NTP configuration (<phrase os="sles;sled">SLE</phrase><phrase os="osuse">Leap</phrase> 15 Syntax)
cs: Konfigurace NTP (syntaxe <phrase os="sles;sled">SLE</phrase> <phrase os="osuse">Leap</phrase> 15)

source: AutoYaST Packages Are Needed for the Second Stage
cs: Pro druhou fázi jsou zapotřebí balíčky AutoYaST

source: A regular installation is performed in a single stage, while an installation performed via AutoYaST needs two stages in most cases. In order to perform the second stage of the installation AutoYaST requires a few additional packages, for example <package>autoyast2-installation</package> and <package>autoyast2</package>. If these are missing, a warning will be shown.
cs: Normální instalace se provádí v jedné fázi, zatímco instalace pomocí AutoYaST vyžaduje ve většině případů dvě fáze. Aby bylo možné provést druhou fázi instalace, vyžaduje AutoYaST několik dalších balíčků, například <package>autoyast2-installation</package> a <package>autoyast2</package>. Pokud tyto balíčky chybí, zobrazí se varování.

source: The CA Management Module Has Been Dropped
cs: Modul správy CA byl zrušen

source: The module for CA Management (<package>yast2-ca-management</package>&gt;) has been removed from <phrase role="productname"><phrase os="osuse">openSUSE Leap</phrase><phrase os="sles">SUSE Linux Enterprise Server</phrase><phrase os="sled">SUSE Linux Enterprise Desktop</phrase></phrase> 15, and for the time being there is no replacement available. In case you are reusing <phrase os="sles;sled">an SLE</phrase><phrase os="osuse">a Leap</phrase> <phrase os="sles;sled">12</phrase><phrase os="osuse">42.3</phrase> profile, make sure it does not contain a <tag class="element">ca_mgm</tag> section.
cs: Modul pro správu CA (<package>yast2-ca-management</package>&gt;) byl odebrán z <phrase role="productname"><phrase os="osuse">openSUSE Leap</phrase><phrase os="sles">SUSE Linux Enterprise Server</phrase><phrase os="sled">SUSE Linux Enterprise Desktop</phrase></phrase> 15 a prozatím není k dispozici žádná náhrada. V případě, že znovu použijete profil <phrase os="sles;sled">an SLE</phrase><phrase os="osuse">a Leap</phrase> <phrase os="sles;sled">12</phrase><phrase os="osuse">42.3</phrase>, ujistěte se, že neobsahuje sekci <tag class="element">ca_mgm</tag>.

source: <phrase os="sles;sled">SLE 12</phrase><phrase os="osuse">Leap 42.3</phrase> has two modes of evaluating which packages need to be upgraded. In <phrase role="productname"><phrase os="osuse">openSUSE Leap</phrase><phrase os="sles">SUSE Linux Enterprise Server</phrase><phrase os="sled">SUSE Linux Enterprise Desktop</phrase></phrase> <phrase role="productnumber"><phrase os="osuse">15.0</phrase><phrase os="sles;sled">15</phrase></phrase>, upgrades are always determined by the dependency solver, equivalent to using <command>zypper dup</command>.
cs: <phrase os="sles;sled">SLE 12</phrase><phrase os="osuse">Leap 42.3</phrase> má dva režimy vyhodnocení, které balíčky je třeba upgradovat. V <phrase role="productname"><phrase os="osuse">openSUSE Leap</phrase><phrase os="sles">SUSE Linux Enterprise Server</phrase><phrase os="sled">SUSE Linux Enterprise Desktop</phrase></phrase> <phrase role="productnumber"><phrase os="osuse">15.0</phrase><phrase os="sles;sled">15</phrase></phrase> jsou upgrady vždy určeny programem - řešitelem závislostí, ekvivalentně k použití <command>zypper dup</command>.

source: This makes the option <tag class="element">only_installed_packages</tag> in the software section obsolete.
cs: Díky tomu je možnost <tag class="element">only_installed_packages</tag> (balíčky pouze instalovat) v sekci software zastaralá.

source: Registration
cs: Registrace

source: When upgrading a registered system, all old repositories are removed. This is done to avoid possible conflicts between the new and old repositories and to clean-up the repositories for the dropped products. If you need to keep custom repositories, add them again using the <tag class="element">add-on</tag> option.
cs: Při upgradu registrovaného systému jsou odstraněna všechna stará úložiště. Je to proto, aby se zabránilo možným konfliktům mezi novým a starým úložištěm a aby se vyčistila úložiště vyřazených produktů. Pokud si potřebujete uchovat vlastní úložiště, přidejte je znovu možností <tag class="element">add-on</tag>.

source: Minimal Registration Configuration for Upgrade
cs: Konfigurace minimální registrace pro upgrade

source: If the registration server returns more than one possible migration target, AutoYaST will automatically select the first one. Currently you cannot select a different migration target.
cs: Pokud registrační server vrátí více než jeden možný cíl migrace, AutoYaST automaticky vybere první. V současné době nemůžete vybrat jiný cíl migrace.

source: After upgrading an unregistered system or skipping registration upgrade by omitting the <tag class="element">suse_register</tag> option, you might need to adjust the repository setup manually.
cs: Po upgradu neregistrovaného systému nebo přeskočení upgradu registrace vynecháním možnosti <tag class="element">suse_register</tag> bude pravděpodobně nutné upravit nastavení úložiště ručně.
