Repository: openSUSE/doc-sle-translations
Catalog: */po/backup.*.po
Languages: cs

# _
source: translator-credits
cs: překladatelské kredity alkas alkas@volny.cz, 2016, 2020

source: Backing Up User Data
cs: Zálohování uživatelských dat

source: The Backup tool is a simple framework to let users back up and restore their own data such as home directories or selected files. It is possible to create scheduled backups or backups on request, and to play back a previous state of this data.
cs: Nástroj Zálohování je jednoduchý prostředek umožňující uživatelům zálohovat a obnovovat svá vlastní data, jako jsou domovské adresáře nebo vybrané soubory. Lze vytvořit plánované zálohy nebo zálohy na vyžádání a obnovit předchozí stav těchto dat.

source: yes
cs: ano

source: To start the <guimenu>Backups</guimenu> application open the Activities Overview by pressing <keycap function="meta"/> and search for <literal>back</literal>.
cs: Chcete-li spustit aplikaci <guimenu>Zálohy</guimenu>, otevřete Přehled aktivit stisknutím <keycap function="meta"/> a vyhledejte <literal>back</literal>.

source: Configuring Backups
cs: Konfigurace Záloh

source: Before you can start to backup data, configure which files to back up, which ones to ignore and where to store the backup.
cs: Než začnete zálohovat data, konfigurujte, které soubory se mají zálohovat, které ignorovat a kam uložit zálohu.

source: Configure which folders to back up by clicking <guimenu>Folders to save</guimenu>. By default, your home directory is preconfigured. Use the plus and minus signs to add or delete folders.
cs: Kliknutím na <guimenu>Složky k uložení</guimenu> můžete nastavit, které složky se mají zálohovat. Ve výchozím nastavení je předem konfigurován váš domovský adresář. K přidávání nebo mazání složek použijte znaménka plus a minus.

source: Optionally, configure folders that should be ignored when backing up data by clicking <guimenu>Folders to ignore</guimenu>. By default the trash bin and the <filename>Download</filename> directory are preconfigured. Use the plus and minus signs to add or delete folders.
cs: Kliknutím na <guimenu> Ignorovat složky </guimenu> můžete případně konfigurovat složky, které mají být při zálohování dat vynechány. Ve výchozím nastavení jsou předem konfigurovány koš a adresář <filename>Stažené soubory</filename> (Download). K přidávání nebo mazání složek použijte znaménka plus a minus.

source: To define a location where to store the backup, click <guimenu>Storage Location</guimenu>. You may choose a <guimenu>Local Folder</guimenu>, a <guimenu>Network Server</guimenu>, or an cloud storage. If you opt for the latter, either choose an existing service from the list or add a service by clicking <guimenu>Open Online Account Settings</guimenu>. Make sure you have provided your login credentials for the respective online service via <guimenu>Open Online Account Settings</guimenu>.
cs: Chcete-li definovat umístění, kam chcete zálohu uložit, klikněte na <guimenu>Umístění úložiště</guimenu>. Můžete si vybrat <guimenu>Místní složku</guimenu>, <guimenu>Síťový server</guimenu> nebo cloudové úložiště. Pokud se rozhodnete pro druhou možnost, vyberte ze seznamu existující službu nebo přidejte službu kliknutím na <guimenu>Otevřít nastavení online účtu</guimenu>. Ujistěte se, že jste zadali své přihlašovací údaje pro příslušnou službu online prostřednictvím <guimenu>Otevřít nastavení online účtu</guimenu>.

source: Regardless of the Storage location, provide a directory name under which the backup(s) will be stored. It is recommended to choose a name that can easily be associated with backups for the respective machine and data.
cs: Bez ohledu na umístění úložiště uveďte název adresáře, pod kterým budou zálohy uloženy. Doporučuje se zvolit název, který lze snadno spojit se zálohami pro příslušný stroj a data.

source: Creating Backups
cs: Vytváření záloh

source: Once you have configured which folders to back up and where to store them, you have two choices for backing up. First, by manually starting the backup. Switch to the <guimenu>Overview</guimenu> screen and click <guimenu>Back Up Now</guimenu>. Choose whether you want to protect the backup with a password or not. Proceed with <guimenu>Forward</guimenu>.
cs: Jakmile nakonfigurujete, které složky se mají zálohovat a kam je uložit, máte dvě možnosti zálohování. Nejprve ručním spuštěním zálohy. Přepněte na obrazovku <guimenu>Přehled</guimenu> a klikněte na <guimenu>Zálohovat teď</guimenu>. Vyberte, zda chcete zálohu chránit heslem nebo ne. Pokračujte <guimenu>Vpřed</guimenu>.

source: The second option is to schedule automatic backups: Create a backup schedule by clicking <guimenu>Scheduling</guimenu>. Enter the backup frequency and decide how long to keep backups. Enable scheduled backups by turning the <guimenu>Automatic Backup</guimenu> switch <guimenu>On</guimenu>.
cs: Druhou možností je naplánovat automatické zálohy: Kliknutím na <guimenu>Plánování</guimenu> vytvořte plán zálohování. Zadejte frekvenci zálohování a rozhodněte se, jak dlouho chcete zálohy uchovávat. Povolte plánované zálohy přepnutím přepínače <guimenu>Automatické zálohování</guimenu> na <guimenu>Zapnuto</guimenu>.

source: Restoring Data
cs: Obnovení dat

source: To restore a previous state of your data, switch to the <guimenu>Overview</guimenu> screen and click <guimenu>Restore</guimenu>.
cs: Chcete-li obnovit předchozí stav svých dat, přepněte na obrazovku <guimenu>Přehled</guimenu> a klikněte na <guimenu>Obnovit</guimenu>.

source: Choose a backup location, a directory name and proceed with <guimenu>Forward</guimenu>.
cs: Vyberte umístění zálohy, název adresáře a pokračujte <guimenu>Vpřed</guimenu>.

source: Select the backup date which you want to restore and proceed with <guimenu>Forward</guimenu>.
cs: Vyberte datum zálohy, které chcete obnovit, a pokračujte <guimenu>Vpřed</guimenu>.

source: Choose whether to restore the files from the backup to their original location or to a different directory. Proceed with <guimenu>Forward</guimenu>.
cs: Vyberte, zda chcete obnovit soubory ze zálohy do původního umístění nebo do jiného adresáře. Pokračujte <guimenu>Vpřed</guimenu>.

source: Review your settings. If necessary, go <guimenu>Back</guimenu> to change them. To start restoring data from the backup, click <guimenu>Restore</guimenu>.
cs: Zkontrolujte nastavení. V případě potřeby je můžete změnit po návratu <guimenu>Zpět</guimenu>. Chcete-li začít obnovovat data ze zálohy, klikněte na <guimenu>Obnovit</guimenu>.
